<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'support' => [
        'convinced' => [
            'title' => 'Έχω πειστεί! :D',
            'support' => 'υποστηρίξτε το osu!',
            'gift' => 'ή δωρίστε σε άλλους παίκτες',
            'instructions' => 'κάντε κλικ στην καρδιά για να προχωρήσετε στο osu!κατάστημα',
        ],
        'why-support' => [
            'title' => 'Γιατί πρέπει να υποστηρίξω το osu!? Πού πηγαίνουν τα χρήματα;',

            'team' => [
                'title' => 'Υποστηρίξτε την Ομάδα',
                'description' => 'Μια μικρή ομάδα αναπτύσσεται και τρέχει osu!. Η υποστήριξή σας τους βοηθάει σε, ξέρεις... ζει.',
            ],
            'infra' => [
                'title' => 'Υποδομή Διακομιστή',
                'description' => 'Συνεισφορές πηγαίνουν προς τους διακομιστές για την εκτέλεση της ιστοσελίδας, υπηρεσίες για πολλούς παίκτες, σε απευθείας σύνδεση leaderboards, κλπ.',
            ],
            'featured-artists' => [
                'title' => 'Προτεινόμενοι Καλλιτέχνες',
                'description' => 'Με την υποστήριξή σας, μπορούμε να προσεγγίσουμε ακόμα πιο φοβερό καλλιτέχνες και να αδειοδοτήσουμε πιο μεγάλη μουσική για χρήση σε osu!',
                'link_text' => 'Δείτε το τρέχον ρόστερ &raquo;',
            ],
            'ads' => [
                'title' => 'Συνέχισε το osu',
                'description' => 'Οι συνεισφορές σας βοηθούν να διατηρήσετε το παιχνίδι ανεξάρτητο και εντελώς απαλλαγμένο από διαφημίσεις και εξωτερικούς χορηγούς.',
            ],
            'tournaments' => [
                'title' => 'Επίσημα Τουρνουά',
                'description' => 'Βοηθήστε να χρηματοδοτήσει τη λειτουργία του (και τα βραβεία) το επίσημο osu! Παγκόσμιο Κύπελλο τουρνουά.',
                'link_text' => 'Εξερευνήστε τουρνουά &raquo;',
            ],
            'bounty-program' => [
                'title' => 'Πρόγραμμα Bounty ανοιχτού κώδικα',
                'description' => 'Υποστηρίξτε τους συνεισφέροντες της κοινότητας που έχουν δώσει το χρόνο και την προσπάθειά τους να βοηθήσουν το osu.',
                'link_text' => 'Μάθετε περισσότερα &raquo;',
            ],
        ],
        'perks' => [
            'title' => 'Χμ; Τι κερδίζω;!',
            'osu_direct' => [
                'title' => 'osu!direct',
                'description' => 'γρήγορη και εύκολη πρόσβαση για να αναζητήσετε beatmaps χωρίς να βγείτε από το παιχνίδι.',
            ],

            'friend_ranking' => [
                'title' => 'Κατάταξη Φίλου',
                'description' => "Δες πώς στοιβάζεις ενάντια στους φίλους σου στον πίνακα του beatmap, τόσο στο παιχνίδι όσο και στην ιστοσελίδα.",
            ],

            'country_ranking' => [
                'title' => 'Κατάταξη Χώρας',
                'description' => 'Κατακτήστε τη χώρα σας πριν κατακτήσετε τον κόσμο.',
            ],

            'mod_filtering' => [
                'title' => 'Φιλτράρισμα ανά mods',
                'description' => 'Συνδέεται μόνο με άτομα που παίζουν HDHR? Δεν υπάρχει πρόβλημα!',
            ],

            'auto_downloads' => [
                'title' => 'Αυτόματα download',
                'description' => 'Αυτόματα download όσο παίζετε σε multiplayer, όταν κάνετε spectate άλλους, ή ανοίγετε links στο chat!',
            ],

            'upload_more' => [
                'title' => 'Ανεβάστε Περισσότερα',
                'description' => 'Επιπλέον θέσεις για pending beatmaps (ανά ranked beatmap) μέχρι το μέγιστο των 10.',
            ],

            'early_access' => [
                'title' => 'Πρόωρη Πρόσβαση',
                'description' => 'Πρόσβαση σε πρόωρες κυκλοφορίες, όπου μπορείτε να δοκιμάσετε τα νέα χαρακτηριστικά πριν γίνουν δημόσια!',
            ],

            'customisation' => [
                'title' => 'Προσαρμογή',
                'description' => "Προσαρμόστε το προφίλ σας προσθέτοντας μία πλήρως προσαρμόσιμη σελίδα χρήστη.",
            ],

            'beatmap_filters' => [
                'title' => 'Φίλτρα για beatmaps',
                'description' => 'Φιλτράρετε τις αναζητήσεις για beatmaps σε αυτά που έχετε παίξει και σε αυτά που δεν έχετε παίξει και στο βαθμό που έχετε πάρει (αν υπάρχει).',
            ],

            'yellow_fellow' => [
                'title' => 'Κίτρινος Σύντροφος',
                'description' => 'Είστε αναγνωρίσιμοι μέσα στο παιχνίδι από το φωτεινό κίτρινο χρώμα στο όνομα χρήστη σας.',
            ],

            'speedy_downloads' => [
                'title' => 'Γρήγορα Download',
                'description' => 'Πιο επιεικείς περιορισμοί στα download, ειδικά όταν χρησιμοποιείτε το osu!direct.',
            ],

            'change_username' => [
                'title' => 'Αλλάξτε το όνομα χρήστη σας',
                'description' => 'Η δυνατότητα να αλλάξετε το όνομα χρήστη σας χωρίς επιπλέον κόστη. (μία φορά το πολύ)',
            ],

            'skinnables' => [
                'title' => 'Προσαρμόσιμα χαρακτηριστικά',
                'description' => 'Επιπλέον προσαρμόσιμα χαρακτηριστικά μέσα στο παιχνίδι, όπως το εξώφυλλο του κύριου μενού.',
            ],

            'feature_votes' => [
                'title' => 'Ψήφοι για Λειτουργίες',
                'description' => 'Ψήφοι για αιτήματα νέων λειτουργιών. (2 κάθε μήνα)',
            ],

            'sort_options' => [
                'title' => 'Κατάταξε',
                'description' => 'Η ικανότητα να βλέπετε την σειρά κατάταξης της χώρας / των φίλων σας / συγκεκριμένων mod στα beatmaps μέσα στο παιχνίδι.',
            ],

            'more_favourites' => [
                'title' => 'Περισσότερα Αγαπημένα',
                'description' => 'Ο μέγιστος αριθμός beatmaps που προτιμάτε αυξάνεται από :normally &rarr; :supporter',
            ],
            'more_friends' => [
                'title' => 'Περισσότεροι Φίλοι',
                'description' => 'Ο μέγιστος αριθμός φίλων που μπορείτε να έχετε αυξάνεται από :normally &rarr; :supporter',
            ],
            'more_beatmaps' => [
                'title' => 'Ανεβάστε Περισσότερα Beatmaps',
                'description' => 'Πόσες εκκρεμείς beatmaps μπορείτε να έχετε ταυτόχρονα υπολογίζεται από μια τιμή βάσης συν ένα επιπλέον μπόνους για κάθε κατάταξη beatmap που έχετε αυτή τη στιγμή (μέχρι ένα όριο).<br/><br/>Κανονικά αυτό είναι :base συν :bonus ανά κατάταξη beatmap (μέχρι :bonus_max). Με υποστηρικτή, αυτό αυξάνει σε :supporter_base συν :supporter_bonus ανά κατάταξη beatmap (έως και :supporter_bonus_max).',
            ],
            'friend_filtering' => [
                'title' => 'Πίνακες Φίλων',
                'description' => 'Ανταγωνίζονται με τους φίλους σας και να δούμε πώς θα κατατάσσονται εναντίον τους!',
            ],

        ],
        'supporter_status' => [
            'contribution_with_duration' => 'Σας ευχαριστούμε για την συνεχή σας υποστήριξη! Μέχρι στιγμής, έχετε συνεισφέρει ένα σύνολο :dollars, κερδίζοντας την ετικέτα \'\'Supporter\'\' για :duration',
            'not_yet' => "Δεν έχετε supporter tag. :(",
            'valid_until' => 'Το τρέχον supporter tag σας είναι έγκυρο μέχρι τις :date!',
            'was_valid_until' => 'Το supporter tag σας ήταν έγκυρο μέχρι :date.',

            'gifted' => [
                '_' => 'Από τις συνολικές σου συνεισφορές, έχεις δωρίσει ετικέτες αξίας :dollars σε :users που καλύπτουν :duration. Αυτό είναι απίστευτα γενναιόδωρο!',
                'users' => ':count_delimited άλλος χρήστης|:count_delimited άλλοι χρήστες',
            ],
        ],
    ],
];
