<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'audio' => [
        'autoplay' => 'Αυτόματη αναπαραγωγή επόμενου κομματιού',
    ],

    'defaults' => [
        'page_description' => 'osu! - Ο ρυθμός είναι μόνο ένα *κλικ* μακριά! Με Ouendan/EBA, Taiko και αυθεντικά gameplay modes, καθώς και έναν πλήρως λειτουργικό level editor.',
    ],

    'header' => [
        'admin' => [
            'beatmapset' => 'beatmapset',
            'beatmapset_covers' => 'καλύμματα beatmapset',
            'contest' => 'διαγωνισμός',
            'contests' => 'διαγωνισμοί',
            'root' => 'κονσόλα',
        ],

        'artists' => [
            'index' => 'καταχώρηση',
        ],

        'beatmapsets' => [
            'show' => 'πληροφορίες',
            'discussions' => 'συζήτηση',
        ],

        'changelog' => [
            'index' => 'καταχώρηση',
        ],

        'help' => [
            'index' => 'ευρετήριο',
            'sitemap' => 'Sitemap',
        ],

        'store' => [
            'cart' => 'καλάθι',
            'orders' => 'ιστορικό παραγγελιών',
            'products' => 'προϊόντα',
        ],

        'tournaments' => [
            'index' => 'καταχώρηση',
        ],

        'users' => [
            'modding' => 'modding',
            'playlists' => 'λίστες αναπαραγωγής',
            'realtime' => 'multiplayer',
            'show' => 'πληροφορίες',
        ],
    ],

    'gallery' => [
        'close' => 'Κλείσιμο (Esc)',
        'fullscreen' => 'Εναλλαγή πλήρους οθόνης',
        'zoom' => 'Εστίαση σε/έξω',
        'previous' => 'Προηγούμενο (αριστερό βέλος)',
        'next' => 'Επόμενο (βέλος δεξιά)',
    ],

    'menu' => [
        'beatmaps' => [
            '_' => 'beatmaps',
        ],
        'community' => [
            '_' => 'κοινότητα',
            'dev' => 'προγραμματισμός',
        ],
        'help' => [
            '_' => 'βοήθεια',
            'getAbuse' => 'αναφορά κατάχρησης',
            'getFaq' => 'συχνές ερωτήσεις',
            'getRules' => 'κανόνες',
            'getSupport' => 'όχι, πραγματικά, χρειάζομαι βοήθεια!',
        ],
        'home' => [
            '_' => 'αρχική σελίδα',
            'team' => 'ομάδα',
        ],
        'rankings' => [
            '_' => 'κατατάξεις',
        ],
        'store' => [
            '_' => 'κατάστημα',
        ],
    ],

    'footer' => [
        'general' => [
            '_' => 'Γενικά',
            'home' => 'Αρχική σελίδα',
            'changelog-index' => 'Αρχείο καταγραφής αλλαγών',
            'beatmaps' => 'Λίστα Beatmap',
            'download' => 'Κατεβάστε το osu!',
        ],
        'help' => [
            '_' => 'Βοήθεια & Κοινότητα',
            'faq' => 'Συχνές Ερωτήσεις',
            'forum' => 'Φόρουμ Κοινότητας',
            'livestreams' => 'Ζωντανές Μεταδόσεις',
            'report' => 'Αναφέρετε Κάποιο Πρόβλημα',
            'wiki' => 'Wiki',
        ],
        'legal' => [
            '_' => 'Νομική Υπόσταση',
            'copyright' => 'Δικαιώματα Πνευματικής Ιδιοκτησίας (DMCA)',
            'jp_sctl' => '',
            'privacy' => 'Απόρρητο',
            'rules' => 'Κανόνες',
            'server_status' => 'Κατάσταση Διακομιστή',
            'source_code' => 'Πηγαίος Κώδικας',
            'terms' => 'Όροι Παροχής Υπηρεσιών',
        ],
    ],

    'errors' => [
        '400' => [
            'error' => 'Μη έγκυρη παράμετρος αιτήματος',
            'description' => '',
        ],
        '404' => [
            'error' => 'Η Σελίδα Λείπει',
            'description' => "Λυπούμαστε, αλλά η σελίδα που ζητήσατε δεν είναι εδώ!",
        ],
        '403' => [
            'error' => "Δεν πρέπει να είστε εδώ.",
            'description' => 'Θα μπορούσατε όμως να προσπαθήσετε να επιστρέψετε.',
        ],
        '401' => [
            'error' => "Δεν πρέπει να είστε εδώ.",
            'description' => 'Θα μπορούσατε όμως να προσπαθήσετε να επιστρέψετε. Ή ίσως να συνδεθείτε.',
        ],
        '405' => [
            'error' => 'Η Σελίδα Λείπει',
            'description' => "Λυπούμαστε, αλλά η σελίδα που ζητήσατε δεν είναι εδώ!",
        ],
        '422' => [
            'error' => 'Μη έγκυρη παράμετρος αιτήματος',
            'description' => '',
        ],
        '429' => [
            'error' => 'Υπέρβαση ορίου τιμής',
            'description' => '',
        ],
        '500' => [
            'error' => 'Ωχ όχι! Κάτι χάλασε! ;_;',
            'description' => "Eιδοποιούμαστε αυτόματα για κάθε σφάλμα.",
        ],
        'fatal' => [
            'error' => 'Ωχ όχι! Κάτι χάλασε (άσχημα)! ;_;',
            'description' => "Eιδοποιούμαστε αυτόματα για κάθε σφάλμα.",
        ],
        '503' => [
            'error' => 'Εκτός λειτουργίας λόγω συντήρησης!',
            'description' => "Η συντήρηση συνήθως διαρκεί από 5 δευτερόλεπτα έως 10 λεπτά. Αν είμαστε εκτός λειτουργίας για μεγαλύτερο χρονικό διάστημα, δείτε :link για περισσότερες πληροφορίες.",
            'link' => [
                'text' => '',
                'href' => '',
            ],
        ],
        // used by sentry if it returns an error
        'reference' => "Για παν ενδεχόμενο, εδώ είναι ένας κωδικός που μπορείτε να δώσετε στην υποστήριξη!",
    ],

    'popup_login' => [
        'button' => 'συνδεθείτε / εγγραφείτε',

        'login' => [
            'forgot' => "Έχω ξεχάσει τα στοιχεία μου",
            'password' => 'κωδικός',
            'title' => 'Συνδεθείτε Για Να Συνεχίσετε',
            'username' => 'όνομα χρήστη',

            'error' => [
                'email' => "Το όνομα χρήστη ή η διεύθυνση ηλεκτρονικού ταχυδρομείου δεν υπάρχει",
                'password' => 'Λάθος κωδικός',
            ],
        ],

        'register' => [
            'download' => 'Λήψη',
            'info' => 'Χρειάζεστε λογαριασμό, κύριε. Γιατί δεν έχετε ήδη έναν;',
            'title' => "Δεν έχετε λογαριασμό;",
        ],
    ],

    'popup_user' => [
        'links' => [
            'account-edit' => 'Ρυθμίσεις',
            'follows' => 'Λίστες Παρακολούθησης',
            'friends' => 'Φίλοι',
            'legacy_score_only_toggle' => 'Λειτουργία Lazer',
            'legacy_score_only_toggle_tooltip' => 'Η λειτουργία Lazer εμφανίζει τις βαθμολογίες που έχουν οριστεί από το λέιζερ με έναν νέο αλγόριθμο βαθμολόγησης',
            'logout' => 'Αποσύνδεση',
            'profile' => 'Το Προφίλ μου',
            'scoring_mode_toggle' => 'Κλασική βαθμολόγηση',
            'scoring_mode_toggle_tooltip' => 'Ρύθμιση των τιμών βαθμολογίας για πιο παλιά αίσθηση χωρίς βαθμολογία',
            'team' => 'Η Ομάδα Μου',
        ],
    ],

    'popup_search' => [
        'initial' => 'Πληκτρολογήστε για αναζήτηση!',
        'retry' => 'Η αναζήτηση απέτυχε. Κάντε κλικ για να προσπαθήσετε ξανά.',
    ],
];
