<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'beatmapset_update_notice' => [
        'new' => 'Απλά σε ενημερώνουμε πως υπήρξε μια νέα ενημέρωση στο beatmap ":title" από την τελευταία σου επίσκεψη.',
        'subject' => 'Νέα ενημέρωση για το beatmap ":title"',
        'unwatch' => 'Εάν δεν θέλεις άλλο να παρακολουθείς αυτό το beatmap, μπορείς είτε να πατήσεις στο σύνδεσμο \'\'Unwatch\'\' που βρίσκεται στην παραπάνω σελίδα, είτε από την σελίδα παρακολούθησης modding:',
        'visit' => 'Επισκέψου την σελίδα συζήτησης εδώ:',
    ],

    'common' => [
        'closing' => 'Χαιρετισμούς,',
        'hello' => 'Γεια σου :user,',
        'report' => 'Παρακαλούμε να απαντήσεις ΑΜΕΣΑ σε αυτό το email άμα δεν ζήτησες εσύ για αυτήν την αλλαγή.',
        'ignore' => 'Αν δεν το ζήτησες εσύ αυτό, μπορείς να αγνοήσεις με ασφάλεια αυτό το email.',
    ],

    'donation_thanks' => [
        'benefit_more' => 'Περισσότερα νέα οφέλη υποστηρικτών θα εμφανιστούν με την πάροδο του χρόνου, επίσης!',
        'feedback' => "Αν έχεις ερωτήσεις ή σχόλια, μην διστάζεις να απαντήσεις σε αυτό το email. Θα επικοινωνήσω μαζί σου το συντομότερο δυνατόν!",
        'keep_free' => 'Είναι χάρη στους ανθρώπους σαν εσένα που το osu! μπορεί να κρατάει το παιχνίδι και την κοινότητα να τρέχουν ομαλά χωρίς διαφημίσεις ή αναγκαστικές πληρωμές. ',
        'keep_running' => 'Η υποστήριξή σου κρατάει το osu! να τρέχει για :minutes! Μπορεί να μην φαίνεται σαν κάτι τρελό, αλλά βοηθάει σε όλα :). ',
        'subject' => 'Ευχαριστούμε, το osu! σε <3',
        'translation' => 'Μετάφραση που παρέχεται από την κοινότητα για ενημερωτικούς σκοπούς:',

        'benefit' => [
            'gift' => 'Το/α δώρο/α σου θα έχει/ουν τώρα πρόσβαση στο osu!direct και πολλά άλλα οφέλη supporter',
            'self' => 'Τώρα θα έχεις πρόσβαση στο osu!direct και σε πολλά άλλα οφέλη supporter για :duration',
        ],

        'support' => [
            '_' => 'Ευχαριστούμε πολύ για το :support σας προς το osu!.',
            'first' => 'υποστήριξη',
            'repeat' => 'συνεχή υποστήριξη',
        ],
    ],

    'forum_new_reply' => [
        'new' => 'Απλά σε ενημερώνουμε πως υπήρξε μια νέα ενημέρωση στο beatmap ":title" από την τελευταία σου επίσκεψη.',
        'subject' => '[osu!] Νέα απάντηση για το θέμα ":title"',
        'unwatch' => 'Αν δεν θέλεις να παρακαλουθείς άλλο αυτό το θέμα, μπορείς είτε να κάνεις κλικ στο σύνδεσμο \'\'Κατάργηση εγγραφής\'\' που βρίσκεται στο κάτω μέρος του θέματος παραπάνω, ή από τη σελίδα διαχείρισης συνδρομών θεμάτων: ',
        'visit' => 'Μετάβαση κατευθείαν στην τελευταία απάντηση χρησιμοποιώντας τον ακόλουθο σύνδεσμο:',
    ],

    'password_reset' => [
        'code' => 'Ο κωδικός επαλήθευσης σου είναι:',
        'requested' => 'Είτε εσύ είτε κάποιος που προσποιείται ότι είσαι εσύ έχει ζητήσει επαναφορά κωδικού πρόσβασης στο osu! λογαριασμό σου.',
        'subject' => 'osu! ανάκτηση λογαριασμού',
    ],

    'store_payment_completed' => [
        'prepare_shipping' => 'Έχουμε λάβει την πληρωμή σου και προετοιμάζουμε την παραγγελία σου για αποστολή. Μπορεί να κρατήσει μερικές μέρες για εμάς να σου το στείλουμε, ανάλογα με την ποσότητα των παραγγελιών. Μπορείς να παρακολουθήσεις την προόδο της παραγγελίας σου εδώ, συμπεριλαμβανομένων των λεπτομερειών παρακολούθησης όπου είναι διαθέσιμα:',
        'processing' => 'Έχουμε λάβει την πληρωμή σου και αυτή την στιγμή διεκπεραιώνουμε την παραγγελία σου. Μπορείς να παρακολουθήσεις την πρόοδο της παραγγελίας σου εδώ:',
        'questions' => "Αμά έχεις οποιεςδήποτε ερωτήσεις, μην διστάζεις να απαντήσεις σε αυτό το email.",
        'shipping' => 'Μεταφορικά',
        'subject' => 'Λάβαμε την παραγγελία σας από το osu!store!',
        'thank_you' => 'Ευχαριστούμε για την παραγγελία σου στο osu!shop!',
        'total' => 'Σύνολο',
    ],

    'supporter_gift' => [
        'anonymous_gift' => 'Το άτομο που σου έδωσε αυτή την ετικέτα μπορεί να επιλέξει να παραμείνει ανώνυμο, οπότε δεν έχει αναφερθεί σε αυτή την ειδοποίηση.',
        'anonymous_gift_maybe_not' => 'Αλλά πιθανότατα γνωρίζεις ήδη ποιος είναι ;).',
        'duration' => 'Χάρη σε αυτούς, έχεις πρόσβαση στο osu!direct και σε άλλα osu!supporter οφέλη για :duration',
        'features' => 'Μπορείς να μάθεις περισσότερες λεπτομέρειες σχετικά με αυτά τα χαρακτηριστικά εδώ:',
        'gifted' => 'Κάποιος μόλις σας έδωσε osu!supporter ετικέτα!',
        'gift_message' => 'Το άτομο που σου έδωσε αυτή την ετικέτα σου άφησε ένα μήνυμα:',
        'subject' => 'Σας δωρήθηκε ένα osu!supporter tag!',
    ],

    'user_email_updated' => [
        'changed_to' => 'Αυτό είναι ένα email επιβεβαίωσης για να σε ενημερώσουμε πως η osu! διεύθυνση email έχει αλλάξει σε: \'\':email\'\'.',
        'check' => 'Παρακαλώ βεβαιώσου ότι έχεις λάβει αυτό το email από τη νέα διεύθυνση για να αποτρέψεις την απώλεια πρόσβασης στον osu! λογαριασμό σου στο μέλλον.',
        'sent' => 'Για λόγους ασφάλειας, αυτό το email έχει σταλθεί και στη καινούργια, και στην παλιά σου διεύθυνση',
        'subject' => 'επιβεβαίωση αλλαγής email του osu!',
    ],

    'user_force_reactivation' => [
        'main' => 'Ο λογαριασμός σου έχει υποψιαστεί για παραβίαση, έχει πρόσφατη ύποπτη δραστηριότητα ή ΠΟΛΥ αδύναμο κωδικό πρόσβασης. Ως αποτέλεσμα, απαιτούμε να ορίσεις ένα νέο κωδικό πρόσβασης. Παρακαλούμε βεβαιώσου να επιλέξεις ένα ΑΣΦΑΛΗΣ κωδικό πρόσβασης.',
        'perform_reset' => 'Μπορείς να εκτελέσεις την επαναφορά από το :url',
        'reason' => 'Λόγος:',
        'subject' => 'Απαιτείται επανενεργοποίηση osu! λογαριασμού',
    ],

    'user_notification_digest' => [
        'new' => 'Απλά σε ενημερώνουμε πως έχουν επάρξει νέες ενημερώσεις σχετικά με τα στοιχεία που παρακολουθείς.',
        'settings' => 'Αλλαγή προτιμήσεων ειδοποίησης μέσω email:',
        'subject' => 'Νέες ειδοποιήσεις osu!',
    ],

    'user_password_updated' => [
        'confirmation' => 'Αυτή είναι απλά μια επιβεβαίωση ότι ο κωδικός πρόσβασης του osu! σου έχει αλλάξει',
        'subject' => 'επιβεβαίωση αλλαγής κωδικού πρόσβασης του osu!',
    ],

    'user_verification' => [
        'code' => 'Ο κωδικός επαλήθευσης σας είναι:',
        'code_hint' => 'Μπορείς να εισάγεις τον κωδικό με ή χωρίς κενά.',
        'link' => 'Εναλλακτικά, μπορείς επίσης να επισκεφθείς τον παρακάτω σύνδεσμο για την ολοκλήρωση της επαλήθευσης:',
        'report' => 'Εάν δεν το ζήτησες αυτό,',
        'subject' => 'osu! επαλήθευση λογαριασμού',

        'action_from' => [
            '_' => 'Μια ενέργεια που εκτελείται στο λογαριασμό σας από :country απαιτεί επαλήθευση.',
            'unknown_country' => 'άγνωστη χώρα',
        ],
    ],
];
