<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'cart' => [
        'checkout' => 'Ολοκλήρωση αγοράς',
        'empty_cart' => 'Αφαίρεση όλων των αντικειμένων από το καλάθι',
        'info' => ':count_delimited αντικείμενο στο καλάθι ($:subtotal),:count_delimited αντικείμενα στο καλάθι ($:subtotal)',
        'more_goodies' => 'Θέλω να ελέγξω περισσότερα καλούδια πριν ολοκληρώσω την παραγγελία',
        'shipping_fees' => 'έξοδα αποστολής',
        'title' => 'Καλάθι Αγορών',
        'total' => 'σύνολο',

        'errors_no_checkout' => [
            'line_1' => 'Ωχ, υπάρχουν προβλήματα με το καλάθι σας που εμποδίζουν την ολοκλήρωση της αγοράς!',
            'line_2' => 'Καταργήστε ή ενημερώστε τα παραπάνω στοιχεία για να συνεχίσετε.',
        ],

        'empty' => [
            'text' => 'Το καλάθι σας είναι άδειο.',
            'return_link' => [
                '_' => 'Επιστροφή στη :link για να βρείτε μερικά καλούδια!',
                'link_text' => 'λίστα του καταστήματος',
            ],
        ],
    ],

    'checkout' => [
        'cart_problems' => 'Ουπς, υπάρχει πρόβλημα με το καλάθι σας!',
        'cart_problems_edit' => 'Κάντε κλικ εδώ για να το επεξεργαστείτε.',
        'declined' => 'Η πληρωμή ακυρώθηκε.',
        'delayed_shipping' => 'Προσωρινά μας έχουν κατακλύσει οι παραγγελίες! Μπορείτε να παραγγείλετε, αλλά παρακαλούμε να περιμένετε **1-2 εβδομάδες επιπλέον** ενώ προσπαθούμε να προλάβουμε τις υπάρχουσες παραγγελίες.',
        'hide_from_activity' => 'Απόκρυψη όλων των ετικετών osu!supporter σε αυτή τη σειρά από την δραστηριότητά μου',
        'old_cart' => 'Το καλάθι σας φαίνεται να έχει ξεπερασμένα πράγματα και έχει ανανεωθεί, παρακαλώ προσπαθήστε ξανά.',
        'pay' => 'Ολοκλήρωση αγοράς με Paypal',
        'title_compact' => 'ολοκλήρωση αγοράς',

        'has_pending' => [
            '_' => 'Έχετε μη-ολοκληρωμένες αγορές, κάντε κλικ στο κουμπί :link για να τις δείτε.',
            'link_text' => 'εδώ',
        ],

        'pending_checkout' => [
            'line_1' => 'Μία προηγούμενη πληρωμή άρχισε αλλά δεν τελείωσε.',
            'line_2' => 'Συνεχίστε την πληρωμή σας επιλέγοντας μία μέθοδο πληρωμής.',
        ],
    ],

    'discount' => 'κερδίστε :percent%',
    'free' => 'δωρεάν!',

    'invoice' => [
        'contact' => 'Επικοινωνία',
        'date' => 'Ημερομηνία:',
        'echeck_delay' => 'Δεδομένου ότι η πληρωμή σας ήταν μια eCheck, παρακαλώ επιτρέψτε έως και 10ημέρες για την πληρωμή μέσω PayPal!',
        'echeck_denied' => 'Η πληρωμή eCheck απορρίφθηκε από την PayPal.',
        'hide_from_activity' => 'osu!supporter ετικέτες με αυτή τη σειρά δεν εμφανίζονται στις πρόσφατες δραστηριότητές σας.',
        'sent_via' => 'Στάλθηκε Με:',
        'shipping_to' => 'Αποστολή Σε:',
        'title' => 'Τιμολόγιο',
        'title_compact' => 'τιμολόγιο',

        'status' => [
            'cancelled' => [
                'title' => 'Η παραγγελία σου έχει ακυρωθεί',
                'line_1' => [
                    '_' => "Αν δεν ζήτησες για ακύρωση παρακαλούμε να επικοινωνήσεις με το :link αναφέροντας τον αριθμό παραγγελίας σου (#:order_number)",
                    'link_text' => 'υποστήριξη osu!store',
                ],
            ],
            'delivered' => [
                'title' => 'Η παραγγελία σου έχει παραδοθεί! Ελπίζουμε να την απολαμβάνεις!',
                'line_1' => [
                    '_' => 'Αν έχεις οποιαδήποτε προβλήματα με την αγορά σου, παρακαλούμε επικοινωνήστε με το :link',
                    'link_text' => 'υποστήριξη osu!store',
                ],
            ],
            'prepared' => [
                'title' => 'Η παραγγελία σου προετοιμάζεται!',
                'line_1' => 'Παρακαλούμε να περιμένεις λίγο περισσότερο για να αποσταλεί. Η πληροφορίες παρακολούθησης θα εμφανιστούν εδώ μόλις ή παραγγελία έχει επεξεργαστεί και αποσταλεί. Αυτό μπορεί να διαρκέσει έως και 5 ημέρες (αλλά κυρίως λιγότερες!) ανάλογα με το πόσο απασχολημένοι είμαστε.',
                'line_2' => 'Στέλνουμε όλες τις παραγγελίες από την Ιαπωνία χρησιμοποιώντας μια ποικιλία ναυτιλιακών υπηρεσιών ανάλογα με το βάρος και την αξία. Αυτή η περιοχή θα ενημερώσει με τις λεπτομέρειες μόλις έχουμε στείλει την παραγγελία.',
            ],
            'processing' => [
                'title' => 'Δεν έχει ακόμη επιβεβαιωθεί η πληρωμή σας!',
                'line_1' => 'Αν έχετε ήδη πληρώσει, μπορεί ακόμα να περιμένουμε την επιβεβάιωση της πληρωμής σας. Παρακαλούμε ανανεώστε τη σελίδα σε ένα λεπτό ή δύο!',
                'line_2' => [
                    '_' => 'Εάν αντιμετωπίσατε κάποιο πρόβλημα κατά τη διάρκεια checkout, :link',
                    'link_text' => 'κάντε κλικ εδώ για να συνεχίσετε την παραγγελία σας',
                ],
            ],
            'shipped' => [
                'title' => 'Η παραγγελία σου έχει αποσταλεί!',
                'tracking_details' => 'Λεπτομέρειες παρακολούθησης παρακάτω:',
                'no_tracking_details' => [
                    '_' => "Δεν έχουμε πληροφορίες παρακολούθησης καθώς στείλαμε το πακέτο σου μέσω Air Mail, αλλά μπορείς να περιμένεις να το λάβεις μέσα σε 1-3 εβδομάδες. Για την Ευρώπη, μερικές φορές τα τελωνεία μπορούν να καθυστερήσουν την παραγγελία από τον έλεγχο μας. Άμα έχεις οποιεσδήποτε ερωτήσεις, παρακαλούμε να απαντήσεις στο email επιβεβαίωσης παραγγελίας που έλαβες (ή :link).",
                    'link_text' => 'στείλε μας ένα email',
                ],
            ],
        ],
    ],

    'order' => [
        'cancel' => 'Ακύρωση Παραγγελίας',
        'cancel_confirm' => 'Αυτή η παραγγελία θα ακυρωθεί και η πληρωμή δεν θα γίνει δεκτή για αυτήν. Ο πάροχος πληρωμής δεν μπορεί να αποδεσμεύσει οποιαδήποτε δεσμευμένα χρήματα αμέσως. Είσαι σίγουρος;',
        'cancel_not_allowed' => 'Αυτή η παραγγελία δεν μπορεί να ακυρωθεί αυτή τη στιγμή.',
        'invoice' => 'Προβολή τιμολογίου',
        'no_orders' => 'Δεν υπάρχουν παραγγελίες για προβολή.',
        'paid_on' => 'Παραγγελία ορίστηκε :date',
        'resume' => 'Συνέχιση Αγοράς',
        'shipping_and_handling' => 'Μεταφορικά & Διεκπεραιωτικά',
        'shopify_expired' => 'Ο σύνδεσμος παραγγελίας για αυτήν την παραγγελία έχει λήξει.',
        'subtotal' => 'Υποσύνολο',
        'total' => 'Σύνολο',

        'details' => [
            'order_number' => 'Παραγγελία #',
            'payment_terms' => 'Όροι πληρωμής',
            'salesperson' => 'Πωλητής',
            'shipping_method' => 'Τρόπος αποστολής',
            'shipping_terms' => 'Όροι Αποστολής',
            'title' => 'Λεπτομέρειες παραγγελίας',
        ],

        'item' => [
            'quantity' => 'Ποσότητα',

            'display_name' => [
                'supporter_tag' => ':name για τον χρήστη :username (:duration)',
            ],

            'subtext' => [
                'supporter_tag' => 'Μήνυμα: :message',
            ],
        ],

        'not_modifiable_exception' => [
            'cancelled' => 'Δεν μπορείτε να τροποποιήσετε την παραγγελία σας καθώς έχει ακυρωθεί.',
            'checkout' => 'Δεν μπορείτε να τροποποιήσετε την παραγγελία σας όσο βρίσκεται υπό επεξεργασία.', // checkout and processing should have the same message.
            'default' => 'Η παραγγελία δεν είναι τροποποιήσιμη',
            'delivered' => 'Δεν μπορείτε να τροποποιήσετε την παραγγελία σας καθώς έχει ήδη παραδοθεί.',
            'paid' => 'Δεν μπορείτε να τροποποιήσετε την παραγγελία σας καθώς έχει ήδη πληρωθεί.',
            'processing' => 'Δεν μπορείτε να τροποποιήσετε την παραγγελία σας όσο βρίσκεται υπό επεξεργασία.',
            'shipped' => 'Δεν μπορείτε να τροποποιήσετε την παραγγελία σας καθώς έχει ήδη αποσταλεί.',
        ],

        'status' => [
            'cancelled' => 'Ακυρώθηκε',
            'checkout' => 'Προετοιμάζεται',
            'delivered' => 'Παραδόθηκε',
            'paid' => 'Πληρώθηκε',
            'processing' => 'Προς επιβεβαίωση',
            'shipped' => 'Μεταφέρεται',
            'title' => 'Κατάσταση Παραγγελίας',
        ],

        'thanks' => [
            'title' => 'Ευχαριστούμε για την παραγγελία σου!',
            'line_1' => [
                '_' => 'Θα λάβεις ένα email επιβεβαίωσης σύντομα. Αν έχεις οποιεσδήποτε ερωτήσεις, παρακαλούμε :link!',
                'link_text' => 'επικοινώνησε μαζί μας',
            ],
        ],
    ],

    'product' => [
        'name' => 'Όνομα',

        'stock' => [
            'out' => 'Αυτό το αντικείμενο έχει εξαντληθεί προσωρινά. Ελέγξτε ξανά αργότερα!',
            'out_with_alternative' => 'Δυστυχώς αυτό το αντικείμενο έχει εξαντληθεί. Χρησιμοποιήστε το αναπτυσσόμενο μενού για να επιλέξετε έναν διαφορετικό τύπο ή ελέγξτε ξανά αργότερα!',
        ],

        'add_to_cart' => 'Προσθήκη στο Καλάθι',
        'notify' => 'Ειδοποιήστε με όταν θα είναι διαθέσιμο!',
        'out_of_stock' => 'Εξαντλημένο',

        'notification_success' => 'θα σας ειδοποιήσουμε όταν ανανεωθεί το απόθεμά μας. Πατήστε εδω :link για ακύρωση',
        'notification_remove_text' => 'εδώ',

        'notification_in_stock' => 'Αυτό το προϊόν είναι ήδη διαθέσιμο!',
    ],

    'supporter_tag' => [
        'gift' => 'δωρίστε σε έναν παίχτη',
        'gift_message' => 'προσθέστε ένα προαιρετικό μήνυμα στο δώρο σας! (μέχρι :length χαρακτήρες)',

        'require_login' => [
            '_' => 'Πρέπει να είστε :link για να πάρετε ένα supporter tag!',
            'link_text' => 'συνδεδεμένος',
        ],
    ],

    'username_change' => [
        'check' => 'Εισάγετε ένα όνομα χρήστη για να ελέγξετε τη διαθεσιμότητα!',
        'checking' => 'Ελέγχουμε τη διαθεσιμότητα του :username...',
        'placeholder' => 'Ζητήθηκε Όνομα Χρήστη',
        'label' => 'Νέο Όνομα Χρήστη',
        'current' => 'Το τρέχον όνομα χρήστη σου είναι ":username".',

        'require_login' => [
            '_' => 'Πρέπει να είστε :link για να αλλάξετε το όνομα χρήστη σας!',
            'link_text' => 'συνδεδεμένος',
        ],
    ],

    'xsolla' => [
        'distributor' => '',
    ],
];
