<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'index' => [
        'none_running' => 'Δεν υπάρχουν τρέχοντα τουρνουά αυτήν τη στιγμή, παρακαλώ ελέγξτε αργότερα!',
        'registration_period' => 'Εγγραφή από :start μέχρι :end',

        'header' => [
            'title' => 'Τουρνουά της Κοινότητας',
        ],

        'item' => [
            'registered' => 'Εγγεγραμμένοι παίκτες',
        ],

        'state' => [
            'current' => 'Ενεργά Τουρνουά',
            'previous' => 'Παλαιότερα Τουρνουά',
        ],
    ],

    'show' => [
        'banner' => 'Υποστηρίξτε την Ομάδα Σας',
        'entered' => 'Έχετε εγγραφεί για αυτό το τουρνουά.<br><br>Έχετε υπόψιν σας ότι αυτό δεν σημαίνει ότι έχετε ανατεθεί σε μια ομάδα.<br><br>Περισσότερες οδηγίες θα σας αποσταλούν μέσω email πιο κοντά στην ημερομηνία του τουρνουά, οπότε παρακαλούμε βεβαιωθείτε ότι το email του λογαριασμού σας στο osu! είναι έγκυρο!',
        'info_page' => 'Σελίδα Πληροφοριών',
        'login_to_register' => 'Παρακαλώ :login για να δείτε τις λεπτομέρειες της εγγραφής!',
        'not_yet_entered' => 'Δεν είστε εγγεγραμμένοι για αυτό το τουρνουά.',
        'rank_too_low' => 'Συγνώμη, δεν πληροίτε τις απαιτήσεις κατάταξης για αυτό το τουρνουά!',
        'registration_ends' => 'Οι εγγραφές κλείνουν στις :date',

        'button' => [
            'cancel' => 'Ακύρωση Eγγραφής',
            'register' => 'Εγγέγραψέ με!',
        ],

        'period' => [
            'end' => '',
            'start' => '',
        ],

        'state' => [
            'before_registration' => 'Οι εγγραφές για αυτό το τουρνουά δεν έχουν ακόμη ανοίξει.',
            'ended' => 'Αυτό το τουρνουά έχει ολοκληρωθεί. Ελέγξτε τη σελίδα πληροφοριών για τα αποτελέσματα.',
            'registration_closed' => 'Η εγγραφή για αυτό το τουρνουά έχει κλείσει. Ελέγξτε τη σελίδα πληροφοριών για πιο πρόσφατες ενημερώσεις.',
            'running' => 'Αυτό το τουρνουά βρίσκεται σε εξέλιξη. Ελέγξτε τη σελίδα πληροφοριών για περισσότερες λεπτομέρειες.',
        ],
    ],
    'tournament_period' => 'Από :start μέχρι :end',
];
