<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'show' => [
        'fallback_translation' => 'Η σελίδα δεν είναι ακόμα μεταφρασμένη στην επιλεγμένη γλώσσα (:language). Αλλαγή στην Αγγλική έκδοση.',
        'incomplete_or_outdated' => 'Το περιεχόμενο σε αυτήν τη σελίδα είναι ελλιπές ή παρωχημένο. Αν μπορείτε να βοηθήσετε, παρακαλούμε να ενημερώσετε το άρθρο!',
        'missing' => 'Η σελίδα ":keyword" δεν βρέθηκε.',
        'missing_title' => 'Δεν Βρέθηκε',
        'missing_translation' => 'Η σελίδα που ζητήσατε δεν βρέθηκε για την επιλεγμένη γλώσσα.',
        'needs_cleanup_or_rewrite' => 'Αυτή η σελίδα δεν καλύπτει τις προϋποθέσεις του osu! wiki και χρειάζεται να καθαριστεί ή να ξαναγραφεί. Αν μπορείτε να βοηθήσετε, παρακαλούμε να ενημερώσετε το άρθρο!',
        'search' => 'Αναζήτηση υπάρχουσων σελίδων για :link.',
        'stub' => 'Το άρθρο είναι ελλιπές και αναμένουμε κάποιον να το επεκτείνει.',
        'toc' => 'Περιεχόμενα',

        'edit' => [
            'link' => 'Εμφάνιση σε GitHub',
            'refresh' => 'Ανανέωση',
        ],

        'translation' => [
            'legal' => 'Αυτή η μετάφραση παρέχεται μόνο για λόγους ευκολίας. Το πρωτότυπο :default πρέπει να είναι η μοναδική νομικά δεσμευμένη έκδοση του κειμένου.',
            'outdated' => 'Αυτή η σελίδα περιέχει μια παλαιότερη μετάφραση του αρχικού περιεχομένου. Παρακαλώ ελέγξτε το :default για πιο ακριβής πληροφόρηση (και μπορείτε να ενημερώσετε τη μετάφραση, εάν θέλετε να βοηθήσετε)!',

            'default' => 'Αγγλική έκδοση',
        ],
    ],
];
