<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'play_more' => 'Защо не поиграете още osu! вместо това?',
    'require_login' => 'Моля влезте в профила си, за да продължите.',
    'require_verification' => 'Моля потвърдете, за да продължите.',
    'restricted' => "Не може да правите това докато сте с ограничен статут.",
    'silenced' => "Не може докато сте заглушен.",
    'unauthorized' => 'Достъпът е отказан.',

    'beatmap_discussion' => [
        'destroy' => [
            'is_hype' => 'Не може да отмените надъхването.',
            'has_reply' => 'Не може да изтриете дискусия с отговори',
        ],
        'nominate' => [
            'exhausted' => 'Вие стигнахте вашия лимит за номиниране за деня, моля опитайте пак утре.',
            'incorrect_state' => 'Грешка при извършване на това действие, опитайте да презаредите страницата.',
            'owner' => "Не може да номинирате собствения си бийтмап.",
            'set_metadata' => 'Трябва да зададете жанр и език преди номиниране.',
        ],
        'resolve' => [
            'not_owner' => 'Само автор и притежател на бийтмап могат да разрешат дискусия.',
        ],

        'store' => [
            'mapper_note_wrong_user' => 'Само собственикът на биийтмапа или номинатор/член на QAT групата може да публикува бележки по картата.',
        ],

        'vote' => [
            'bot' => "Не може да гласувате на дискусия създадена от бот",
            'limit_exceeded' => 'Моля изчакайте малко преди да гласувате отново',
            'owner' => "Не може да гласувате на собствена дискусия.",
            'wrong_beatmapset_state' => 'Може да се гласува само в дускусии на бийтмапове чакащи одобрение.',
        ],
    ],

    'beatmap_discussion_post' => [
        'destroy' => [
            'not_owner' => 'Можете да триете само собствените си публикации.',
            'resolved' => 'Не можете да триете публикация на разрешена дискусия.',
            'system_generated' => 'Автоматично създадената публикация не може да бъде изтрита.',
        ],

        'edit' => [
            'not_owner' => 'Само създателят на публикацията може да я редактира.',
            'resolved' => 'Не можете да редактирате публикация на разрешена дискусия.',
            'system_generated' => 'Автоматично създанената публикация не може да бъде редактирана.',
        ],

        'store' => [
            'beatmapset_locked' => 'Този бийтмап е заключен за дискусии.',
        ],
    ],

    'beatmapset' => [
        'metadata' => [
            'nominated' => 'Не можете да промените на метаданните на номиниран мап. Свържете се с BN или NAT член ако смятате, че са зададени погрешно.',
        ],
    ],

    'chat' => [
        'blocked' => 'Не може да пращате съобщения на потребител, който ви блокира, или сте го блокирали.',
        'friends_only' => 'Потребителят блокира съобщенията от всички, които не са в списъка му с приятели.',
        'moderated' => 'Този канал в момента бива модериран.',
        'no_access' => 'Нямате достъп до този канал.',
        'restricted' => 'Не може да пращате съобщения докато сте заклушени, в ограничен режим или баннати.',
        'silenced' => 'Не може да пращате съобщения докато сте заглушен, ограничен или баннат.',
    ],

    'comment' => [
        'update' => [
            'deleted' => "Не може да редактирате вече изтрити публикации.",
        ],
    ],

    'contest' => [
        'voting_over' => 'Не можете да промените гласа си след като периода за гласуване е свършил.',

        'entry' => [
            'limit_reached' => 'Достигнахте ограничението на записи за този конкурс',
            'over' => 'Благодарим Ви за участието! Записването затвори за този конкурс и гласуването ще започне скоро.',
        ],
    ],

    'forum' => [
        'moderate' => [
            'no_permission' => 'Нямате право да модерирате този форум.',
        ],

        'post' => [
            'delete' => [
                'only_last_post' => 'Само последната публикация може да бъде изтрита.',
                'locked' => 'Не може да изтриете публикация в заключена тема.',
                'no_forum_access' => 'Достъп до исканият форум е нужен.',
                'not_owner' => 'Само създателят на публицатията може да я изтрие.',
            ],

            'edit' => [
                'deleted' => 'Не можете да редактирате изтрита публикация.',
                'locked' => 'Тази публикация е заключена от редактиране.',
                'no_forum_access' => 'Достъп до исканият форум е нужен.',
                'not_owner' => 'Само създателят на публикацията може да я редактира.',
                'topic_locked' => 'Не може да изтриете публикация в заключена тема.',
            ],

            'store' => [
                'play_more' => 'Опитайте се да играете играта преди да публикувате във форумите, моля! Ако имате проблем с играта, моля направете пост във форума за Помощ и Поддръжка.',
                'too_many_help_posts' => "Трябва да играете играта повече, преди да можете да направите допълнителни публикации. Ако все още срещате проблеми с играта, пишете имейл към support@ppy.sh", // FIXME: unhardcode email address.
            ],
        ],

        'topic' => [
            'reply' => [
                'double_post' => 'Моля редактирайте последната Ви публикация вместо да публикувате отново.',
                'locked' => 'Не можете да отговаряте във заключен форум.',
                'no_forum_access' => 'Достъп до исканият форум е нужен.',
                'no_permission' => 'Няма разрешение за отговор.',

                'user' => [
                    'require_login' => 'Моля влезте в профила си за да отговорите.',
                    'restricted' => "Не може да отговорите докато сте с ограничен статут.",
                    'silenced' => "Не може да отговорите докато сте заглушен.",
                ],
            ],

            'store' => [
                'no_forum_access' => 'Достъп до исканият форум е нужен.',
                'no_permission' => 'Няма разрешение за създаване на нова тема.',
                'forum_closed' => 'Форумът е затворен и не може да се публикува в него.',
            ],

            'vote' => [
                'no_forum_access' => 'Достъп до исканият форум е нужен.',
                'over' => 'Гласуването е приключило, не може да се гласува повече.',
                'play_more' => 'Необходимо е да играете повече преди да можете да гласувате във форума.',
                'voted' => 'Промяната на глас не е разрешена.',

                'user' => [
                    'require_login' => 'Моля влезте в профила си, за да гласувате.',
                    'restricted' => "Не може да гласувате докато сте с ограничен статут.",
                    'silenced' => "Не може да гласувате докато сте заглушен.",
                ],
            ],

            'watch' => [
                'no_forum_access' => 'Достъп до исканият форум е нужен.',
            ],
        ],

        'topic_cover' => [
            'edit' => [
                'uneditable' => 'Невалидна зададена корица.',
                'not_owner' => 'Само собственикът може да редактира корицата.',
            ],
            'store' => [
                'forum_not_allowed' => 'Този форум не приема тематични корици.',
            ],
        ],

        'view' => [
            'admin_only' => 'Само админ може да види този форум.',
        ],
    ],

    'user' => [
        'page' => [
            'edit' => [
                'locked' => 'Профилната страница е заключена.',
                'not_owner' => 'Може да редактирате само собствената си профилна страница.',
                'require_supporter_tag' => 'необходим е osu!supporter',
            ],
        ],
    ],
];
