<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'availability' => [
        'disabled' => 'Този бийтмап в момента не може да бъде изтеглен.',
        'parts-removed' => 'Части от този бийтмап са премахнати по заявка на създателя или притежател на авторски права.',
        'more-info' => 'Кликни тук, за повече информация.',
        'rule_violation' => 'Някои части от бийтмапа са премахнати, тъй като бяха определени като неподходящи за използване в osu!.',
    ],

    'download' => [
        'limit_exceeded' => 'Забави малко, играй повече.',
    ],

    'featured_artist_badge' => [
        'label' => 'Представени Автори',
    ],

    'index' => [
        'title' => 'Списък с Бийтмапове',
        'guest_title' => 'Бийтмапове',
    ],

    'panel' => [
        'empty' => 'няма бийтмапове',

        'download' => [
            'all' => 'изтегляне',
            'video' => 'изтегляне с видео',
            'no_video' => 'изтегляне без видео',
            'direct' => 'отваряне в osu!direct',
        ],
    ],

    'nominate' => [
        'hybrid_requires_modes' => 'Хибридният бийтмап изисква да бъде избран поне едни режим на игра за номинирането му.',
        'incorrect_mode' => 'Нямате право да номинирате за следните режими: :mode',
        'full_bn_required' => 'Трябва да сте с пълни номинаторски права, за да изпълните тази квалификационна номинация.',
        'too_many' => 'Условията за номинация вече са изпълнени.',

        'dialog' => [
            'confirmation' => 'Сигурни ли сте, че искате да номинирате този бийтмап?',
            'header' => 'Номинирай Бийтмап',
            'hybrid_warning' => 'забележка: може да се номинира само веднъж, затова се уверете, че сте избрали всеки желан режим',
            'which_modes' => 'Номиниране за кои режими?',
        ],
    ],

    'nsfw_badge' => [
        'label' => 'Explicit',
    ],

    'show' => [
        'discussion' => 'Дискусия',

        'details' => [
            'by_artist' => '- :artist',
            'favourite' => 'добавяне в Любими',
            'favourite_login' => 'Влез, за да добавиш в Любими',
            'logged-out' => 'Моля, влез в профила си, за изтегляне на Бийтмапове!',
            'mapped_by' => 'създаден от :mapper',
            'unfavourite' => 'премахване от Любими',
            'updated_timeago' => 'последно актуализиран :timeago',

            'download' => [
                '_' => 'Изтегляне',
                'direct' => '',
                'no-video' => 'без видео',
                'video' => 'с видео',
            ],

            'login_required' => [
                'bottom' => 'за достъп до повече функции',
                'top' => 'Влез',
            ],
        ],

        'details_date' => [
            'approved' => 'одобрен :timeago',
            'loved' => 'обичан :timeago',
            'qualified' => 'квалифициран :timeago',
            'ranked' => 'класиран :timeago',
            'submitted' => 'публикуван :timeago',
            'updated' => 'последно актуализиран :timeago',
        ],

        'favourites' => [
            'limit_reached' => 'Имате прекалено много Любими бийтмапове. Премахнете няколко от списъка и опитайте отново.',
        ],

        'hype' => [
            'action' => 'Надъхайте този бийтмап ако ви е изкефил, за да помогнете с напредъка в <strong>Класирането</strong> му.',

            'current' => [
                '_' => 'Този бийтмап в момента е :status.',

                'status' => [
                    'pending' => 'изчакващ',
                    'qualified' => 'квалифициран',
                    'wip' => 'в процес на разработка',
                ],
            ],

            'disqualify' => [
                '_' => 'Ако откриете проблем с този бийтмап, моля дисквалифицирайте го :link.',
            ],

            'report' => [
                '_' => 'Ако откриете проблем в този бийтмап, моля докладвайте :link, за да уведомите отбора ни.',
                'button' => 'Докладване за Проблем',
                'link' => 'тук',
            ],
        ],

        'info' => [
            'description' => 'Описание',
            'genre' => 'Жанр',
            'language' => 'Език',
            'no_scores' => 'Информацията все още се обработва...',
            'nsfw' => 'Explicit content',
            'points-of-failure' => 'Връхни точки на провал',
            'source' => 'Източник',
            'storyboard' => 'Този бийтмап съдържа анимирана история',
            'success-rate' => 'Степен на успех (%)',
            'tags' => 'Етикети',
            'video' => 'Този бийтмап съдържа видео',
        ],

        'nsfw_warning' => [
            'details' => 'В този бийтмап има explict, офензивно или неприлично съдържание. Искате ли да го разгледате въпреки това?',
            'title' => 'Explicit Съдържание',

            'buttons' => [
                'disable' => 'Изключване на предупреждение',
                'listing' => 'Списък с бийтмапове',
                'show' => 'Показване',
            ],
        ],

        'scoreboard' => [
            'achieved' => 'постигнато :when',
            'country' => 'Държавно класиране',
            'friend' => 'Приятелско класиране',
            'global' => 'Глобално класиране',
            'supporter-link' => 'Кликнете <a href=":link">тук</a> за разглеждане на всички хубави екстри, които ще получите!',
            'supporter-only' => 'Трябва да сте osu!supporter за достъп до държавно, приятелско и мод-специфично класиране!',
            'title' => 'Класация',

            'headers' => [
                'accuracy' => 'Прецизност',
                'combo' => 'Макс комбо',
                'miss' => 'X',
                'mods' => 'Модове',
                'player' => 'Играч',
                'pp' => '',
                'rank' => 'Ранг',
                'score_total' => 'Общ брой точки',
                'score' => 'Точки',
                'time' => 'Преди',
            ],

            'no_scores' => [
                'country' => 'Няма никой от твоята държава в тази класация!',
                'friend' => 'Няма никой от приятелите ти в тази класация!',
                'global' => 'Няма никой в класацията. Защо не опитате да се класирате?',
                'loading' => 'Зареждане на резултати...',
                'unranked' => 'Некласиран бийтмап.',
            ],
            'score' => [
                'first' => 'Начело',
                'own' => 'Твоят най-добър',
            ],
        ],

        'stats' => [
            'cs' => 'Големина на Кръгове',
            'cs-mania' => 'Брой Клавиши',
            'drain' => 'Загуба на Живот',
            'accuracy' => 'Прецизност',
            'ar' => 'Скорост на Достигане',
            'stars' => 'Трудност',
            'total_length' => 'Продължителност (на изтощаване: :hit_length)',
            'bpm' => 'BPM',
            'count_circles' => 'Брой Кръгове',
            'count_sliders' => 'Брой Плъзгачи',
            'user-rating' => 'Потребителски рейтинг',
            'rating-spread' => 'Разпределение на рейтинг',
            'nominations' => 'Номинации',
            'playcount' => 'Брой игри',
        ],

        'status' => [
            'ranked' => 'Класиран',
            'approved' => 'Одобрен',
            'loved' => 'Обичан',
            'qualified' => 'Квалифициран',
            'wip' => 'в прогрес',
            'pending' => 'Изчакващ',
            'graveyard' => 'Гробище',
        ],
    ],
];
