<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'availability' => [
        'disabled' => 'Този бийтмап в момента не може да бъде итеглен.',
        'parts-removed' => 'Части от този бийтмап са премахнати по искане на създателя или притежателя на авторските права.',
        'more-info' => 'Щракнете тук за още информация.',
        'rule_violation' => 'Някои части от бийтмапа са премахнати, тъй като бяха определени като неподходящи за използване в osu!.',
    ],

    'download' => [
        'limit_exceeded' => 'Забави малко, играй повече.',
    ],

    'featured_artist_badge' => [
        'label' => '',
    ],

    'index' => [
        'title' => 'Списък с бийтмапове',
        'guest_title' => 'Бийтмапове',
    ],

    'panel' => [
        'empty' => 'няма бийтмапове',

        'download' => [
            'all' => 'изтегли',
            'video' => 'изтегли с видео',
            'no_video' => 'изтегли без видео',
            'direct' => 'отвори в osu!direct',
        ],
    ],

    'nominate' => [
        'hybrid_requires_modes' => 'Хибридният бийтмап изисква да бъде избран поне едни режим на игра за номинирането му.',
        'incorrect_mode' => 'Нямате права да номинирате за следните режими: :mode',
        'full_bn_required' => 'Трябва да сте с пълни номинаторски права за да изълните тази квалификационна номинация.',
        'too_many' => 'Условията за номинация вече са изпълнени.',

        'dialog' => [
            'confirmation' => 'Сигурни ли сте, че искате да номинирате този бийтмап?',
            'header' => 'Номинирай Бийтмап',
            'hybrid_warning' => 'забележка: може да се номинира само веднъж, затова се уверете, че номинирате всеки искан режим',
            'which_modes' => 'Номиниране за кои режими?',
        ],
    ],

    'nsfw_badge' => [
        'label' => 'Explicit',
    ],

    'show' => [
        'discussion' => 'Дискусия',

        'details' => [
            'by_artist' => 'от :artist',
            'favourite' => 'Харесай този бийтмап сет',
            'favourite_login' => 'Влез за да добавиш в любими',
            'logged-out' => 'Трябва да сте влезли в акаунта си преди да е възможно да теглите бийтмапове!',
            'mapped_by' => 'съпоставено от :mapper',
            'unfavourite' => 'Премахни от харесани бийтмап сетове',
            'updated_timeago' => 'последно актуализиран :timeago',

            'download' => [
                '_' => 'Изтегли',
                'direct' => '',
                'no-video' => 'без видео',
                'video' => 'с видео',
            ],

            'login_required' => [
                'bottom' => 'за достъп до повече функции',
                'top' => 'Влизане',
            ],
        ],

        'details_date' => [
            'approved' => 'одобрен :timeago',
            'loved' => 'обичан :timeago',
            'qualified' => 'квалифициран :timeago',
            'ranked' => 'класиран :timeago',
            'submitted' => 'публикуван :timeago',
            'updated' => 'последно актуализиран :timeago',
        ],

        'favourites' => [
            'limit_reached' => 'Имате прекалено много харесани бийтмапове. Моля махнете няколко от списъка и опитайте отново.',
        ],

        'hype' => [
            'action' => 'Надъхай този бийтмап ако ви е харесал и искате да помогнете за развитието и <strong>класирането</strong> му.',

            'current' => [
                '_' => 'Този мап в момента е :status.',

                'status' => [
                    'pending' => 'изчакващ',
                    'qualified' => 'квалифициран',
                    'wip' => 'в процес на разработка',
                ],
            ],

            'disqualify' => [
                '_' => 'Ако откриете проблем с този бийтмап, моля дисквалифицирайте го :link.',
            ],

            'report' => [
                '_' => 'Ако откриете проблем с този бийтмап, моля докладвайте го :link, за да уведомите отбора ни.',
                'button' => 'Докладвай проблем',
                'link' => 'тук',
            ],
        ],

        'info' => [
            'description' => 'Описание',
            'genre' => 'Жанр',
            'language' => 'Език',
            'no_scores' => 'Информацията все още се обработва...',
            'nsfw' => 'Explicit content',
            'points-of-failure' => 'Връхни точки на провал',
            'source' => 'Източник',
            'storyboard' => 'Този бийтмап съдържа анимирана история',
            'success-rate' => 'Степен на успех (%)',
            'tags' => 'Тагове',
            'video' => 'Този бийтмап съдържа видео',
        ],

        'nsfw_warning' => [
            'details' => 'В този бийтмап има explict, офензивно или неприлично съдържание. Искате ли да го разгледате въпреки това?',
            'title' => 'Explicit Content',

            'buttons' => [
                'disable' => 'Изключи предупреждение',
                'listing' => 'Списък с бийтмапове',
                'show' => 'Покажи',
            ],
        ],

        'scoreboard' => [
            'achieved' => 'постигнато на :when',
            'country' => 'Класиране в страната',
            'friend' => 'Приятелско класиране',
            'global' => 'Глобално класиране',
            'supporter-link' => 'Щракнете <a href=":link">тук</a>, за да видите всички хубави екстри, които получаваш!',
            'supporter-only' => 'Трябва да сте osu!supporter, за да имате достъп до държавното и приятелско класиране!',
            'title' => 'Табло за точки',

            'headers' => [
                'accuracy' => 'Прецизност',
                'combo' => 'Макс комбо',
                'miss' => 'Пропуски',
                'mods' => 'Модове',
                'player' => 'Играч',
                'pp' => '',
                'rank' => 'Ранг',
                'score_total' => 'Общ брой точки',
                'score' => 'Точки',
                'time' => 'Време',
            ],

            'no_scores' => [
                'country' => 'Никой от твоята държава не е играл тази карта все още!',
                'friend' => 'Никой от твоите приятели не е играл тази карта все още!',
                'global' => 'Все още няма резултати. Може би се пробвайте да зададете няколко?',
                'loading' => 'Зареждане на резултатите...',
                'unranked' => 'Некласиран бийтмап.',
            ],
            'score' => [
                'first' => 'Начело',
                'own' => 'Твоят най-добър',
            ],
        ],

        'stats' => [
            'cs' => 'Големина на кръгчетата',
            'cs-mania' => 'Брой клавиши',
            'drain' => 'HP Изтощаване',
            'accuracy' => 'Прецизност',
            'ar' => 'Скорост на наближаване',
            'stars' => 'Трудност',
            'total_length' => 'Продължителност',
            'bpm' => 'BPM',
            'count_circles' => 'Брой кръгчета',
            'count_sliders' => 'Брой слайдери',
            'user-rating' => 'Потребителски рейтинг',
            'rating-spread' => 'Разпределение на рейтинга',
            'nominations' => 'Номинации',
            'playcount' => 'Брой игри',
        ],

        'status' => [
            'ranked' => 'Класиран',
            'approved' => 'Одобрени',
            'loved' => 'Обичан',
            'qualified' => 'Квалифициран',
            'wip' => 'WIP',
            'pending' => 'Предстоящ',
            'graveyard' => 'Гробище',
        ],
    ],
];
