<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'index' => [
        'description' => 'Предварително пакетирани колекции от бийтмапове, базирани на обща тема.',
        'nav_title' => 'списък',
        'title' => 'Бийтмап пакети',

        'blurb' => [
            'important' => 'ПРОЧЕТЕТЕ ТОВА ПРЕДИ ИЗТЕГЛЯНЕ',
            'instruction' => [
                '_' => "Инсталация: След като изтеглите пакет с песни, разархивирайте .rar файла във вашата osu! директория, папка Songs.
                    Всички песни са взе още .zip-нати и/или .osz-нати във пакета, така че osu! ще трябва да ги разархивира от само себе си следващия път като пуснете играта.
                    :scary разархивирайте .zip/.osz файловете сами
                    или бийтмаповете ще се покажат неправилно в osu! и няма да работят правилно.",
                'scary' => 'НЕДЕЙТЕ',
            ],
            'note' => [
                '_' => 'Също, препоръчително е да :scary, защото старите мапове са с много по-ниско качество от най-новите мапове.',
                'scary' => 'изтеглите пакетите от най-новите към най-старите',
            ],
        ],
    ],

    'show' => [
        'download' => 'Изтегли',
        'item' => [
            'cleared' => 'преминат',
            'not_cleared' => 'не преминат',
        ],
        'no_diff_reduction' => [
            '_' => '',
            'link' => '',
        ],
    ],

    'mode' => [
        'artist' => 'Артист/Албум',
        'chart' => 'Препоръчани',
        'standard' => 'Стандартен',
        'theme' => 'Тема',
    ],

    'require_login' => [
        '_' => 'Трябва да сте :link за да изтеглите',
        'link_text' => 'влезли в профила си',
    ],
];
