<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'loading_users' => 'зареждане на потребители...',
    'talking_in' => 'разговаряте в :channel',
    'talking_with' => 'разговаряте с :name',
    'title_compact' => 'чат',
    'unread_messages' => 'непрочетени съобщения',

    'cannot_send' => [
        'channel' => 'Неуспешно изпращане на съобщение в дадения канал. Това може да се дължи на някоя от следните причини:',
        'user' => 'Неуспешно изпращане на съобщение до дадения потребител. Това може да се дължи на някоя от следните причини:',
    ],

    'channels' => [
        'confirm_part' => 'Искате ли да скриете този канал? Ще продължите да получавате съобщения от канала.',
        'create' => 'създаване на оповестяване',

        'list' => [
            'title' => [
                'ANNOUNCE' => 'Известия',
                'GROUP' => 'Групи',
                'PM' => 'Лични съобщения',
                'PUBLIC' => 'Канали',
            ],
        ],
    ],

    'form' => [
        'title' => [
            'announcement' => 'Създаване на ново оповестяване',
        ],

        'labels' => [
            'description' => 'описание',
            'message' => 'съобщение',
            'name' => 'име на стая',
            'users' => 'добавяне на играчи',
        ],
    ],

    'not_found' => [
        'message' => 'Тук няма нищо, може би сте напуснали канал или вече не съществува...',
        'title' => 'каналът не е намерен',
    ],

    'input' => [
        'create' => 'Създаване',
        'disabled' => 'неуспешно изпратено съобщение...',
        'disconnected' => 'Връзката е прекъсната',
        'placeholder' => 'напиши своето съобщение...',
        'send' => 'Изпращане',
    ],

    'no-conversations' => [
        'howto' => "Започнете дискусия с потребител от неговия профил или изскачащ прозорец.",
        'lazer' => 'Публичните канали към които сте се присъединили чрез <a href=":link">osu!lazer</a> ще са видими и тук.',
        'title' => 'няма налични дискусии',
    ],
];
