<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'support' => [
        'convinced' => [
            'title' => 'Аз съм убеден! :D',
            'support' => 'подкрепете osu!',
            'gift' => 'или подарете osu!support на други играчи',
            'instructions' => 'щракнете на розовият бутон със сърце горе, за да продължите към osu!store',
        ],
        'why-support' => [
            'title' => 'Защо да подкрепям финансово osu!? Къде отиват парите?',

            'team' => [
                'title' => 'Подкрепи отбора ни',
                'description' => 'Малък отбор разработва и поддържа osu!. Вашата подкрепа им помага, нали знаете... да живеят.',
            ],
            'infra' => [
                'title' => 'Инфраструктура на сървъра',
                'description' => 'Приносите Ви са насочени към поддържането на сървърите за работа на уебсайта, мултиплейър услугите ни, онлайн класациите и т.н.
',
            ],
            'featured-artists' => [
                'title' => 'Препоръчани изпълнители',
                'description' => 'С вашата подкрепа можем да се обърнем към още страхотни изпълнители и да лицензираме уникална музика за използване в osu!',
                'link_text' => 'Преглед на текущия списък &raquo;',
            ],
            'ads' => [
                'title' => 'Държи osu! самоподдържаща се
',
                'description' => 'Вашите приноси помагат да запазим играта независима и без никакви реклами и външни спонсори.',
            ],
            'tournaments' => [
                'title' => 'Официални турнири',
                'description' => 'Помогнете с финансирането на официалните osu! World Cup турнири (за тяхното организиране и награди).',
                'link_text' => 'Разгледайте турнири &raquo;',
            ],
            'bounty-program' => [
                'title' => 'Насърчаване за принос към софтуера с отворен код',
                'description' => 'Подкрепете членовете на общността, които са отделили своето време и усилия, за да помогнат да направим osu! едно по-добро преживяване.
',
                'link_text' => 'Разберете повече &raquo;',
            ],
        ],
        'perks' => [
            'title' => 'О? Какво получавам?!',
            'osu_direct' => [
                'title' => 'osu!direct',
                'description' => 'кратък и лесен достъп до нови бийтмапове без да е нужно да излизате от играта.',
            ],

            'friend_ranking' => [
                'title' => 'Приятелско класиране',
                'description' => "Вижте как се подреждате срещу приятелите си в класацията на бийтмапове, както в играта, така и на уебсайта.",
            ],

            'country_ranking' => [
                'title' => 'Класиране в страната',
                'description' => 'Завладейте страната си, след това завладейте света.',
            ],

            'mod_filtering' => [
                'title' => 'Филтриране по модове',
                'description' => 'Асоциирате се само с хора, които граят HDHR? Няма проблем!',
            ],

            'auto_downloads' => [
                'title' => 'Автоматично теглене',
                'description' => 'Автоматичното теглене на бийтмапове докато сте в мултиплейър, наблюдавате други или с кликане на линковете в чата!',
            ],

            'upload_more' => [
                'title' => 'Качвайте повече',
                'description' => 'Допълнителни слотове за бийтмапове чакащи класиране (на класиран бийтмап) до максимум 10.',
            ],

            'early_access' => [
                'title' => 'Ранен достъп',
                'description' => 'Достъп до ранни версии, където може да изпробвате нови функции преди да станат публични!',
            ],

            'customisation' => [
                'title' => 'Персонализация',
                'description' => "Персонализирайте си профила като получите пълен достъп до профилната си страница.",
            ],

            'beatmap_filters' => [
                'title' => 'Бийтмап филтри',
                'description' => 'Филтрирайте бийтмап търсенията по играни и неиграни карти и постигнати ранкове (ако има някакви).',
            ],

            'yellow_fellow' => [
                'title' => 'Златен приятел',
                'description' => 'Бъдете разпознати в игра със своето жълто потребителско име в чата.',
            ],

            'speedy_downloads' => [
                'title' => 'Бързо теглене',
                'description' => 'По-леки ограничения по време на теглене, особено когато ползвате osu!direct.',
            ],

            'change_username' => [
                'title' => 'Промяна на името',
                'description' => 'Способността да си промените потребителското име без допълнително заплащане (само веднъж)',
            ],

            'skinnables' => [
                'title' => 'Скин персонализация',
                'description' => 'Допълнителни скин екстри като възможноста да си зададете заден фон в главното меню.',
            ],

            'feature_votes' => [
                'title' => 'Гласуване за нови функции',
                'description' => 'Възможността да гласувате за добавянето на нови функции в osu! (2 на месец)',
            ],

            'sort_options' => [
                'title' => 'Опции за сортиране',
                'description' => 'Способността да видите бийтмап класациите по страна / приятели / мод-специфични по време на игра.',
            ],

            'more_favourites' => [
                'title' => 'По-голям списък любими бийтмапове',
                'description' => 'Максималният брой бийтмапове, които можете да отбележите като любими, се увеличава от :normally &rarr; :supporter ',
            ],
            'more_friends' => [
                'title' => 'Повече приятели',
                'description' => 'Максималният брой приятели, които можете да имате, се увеличава от :normally &rarr; :supporter',
            ],
            'more_beatmaps' => [
                'title' => 'Качване на повече бийтмапове',
                'description' => 'Това колко некласирани бийтмапове може да имате наведнъж се изчислява от базова стойност плюс допълнителен бонус за всеки класиран бийтмап, който в момента имате (до определен лимит).<br/><br/>Обикновено, това е :base плюс :bonus на класиран бийтмап (до :bonus_max). Със osu!supporter, това се увеличава до :supporter_base плюс :supporter_bonus на класиран бийтмап (до :supporter_bonus_max).',
            ],
            'friend_filtering' => [
                'title' => 'Приятелски класации',
                'description' => 'Съревновавайте се с вашите приятели и вижте как се класирате сред тях!',
            ],

        ],
        'supporter_status' => [
            'contribution' => 'Благодарим ви за вашата подкрепа досега! Вие допринесохте общо :dollars за :tags osu!supporter покупки!',
            'gifted' => ":giftedTags от osu!supporter покупките Ви са подарени (общо :giftedDollars подарени), колко щедро!",
            'not_yet' => "Вие все още нямате osu!supporter :(",
            'valid_until' => 'Вашият osu!supporter е валиден до :date!',
            'was_valid_until' => 'Вашият osu!supporter беше валиден до преди :date.',
        ],
    ],
];
