<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'landing' => [
        'download' => 'Изтеглете сега',
        'online' => '<strong>:players</strong> са в момента онлайн в общо <strong>:games</strong> игри',
        'peak' => 'Връхна точка, :count потребители онлайн',
        'players' => '<strong>:count</strong> регистрирани играчи',
        'title' => 'добре дошли',
        'see_more_news' => 'виж повече новини',

        'slogan' => [
            'main' => 'най-добрата безплатна ритъм игра',
            'sub' => 'ритъмът е само на един клик от вас',
        ],
    ],

    'search' => [
        'advanced_link' => 'Разширено търсене',
        'button' => 'Търсене',
        'empty_result' => 'Нищо не бе открито!',
        'keyword_required' => 'Необходима е ключова дума за търсене',
        'placeholder' => 'Пишете тук за търсене…',
        'title' => 'Търсене',

        'beatmapset' => [
            'login_required' => 'Влезте в профила си, за да търсите бийтмапове',
            'more' => 'още :count бийтмап резултата от търсенето',
            'more_simple' => 'Виж повече бийтмап резултати от търсенето',
            'title' => 'Бийтмапове',
        ],

        'forum_post' => [
            'all' => 'Всички форуми',
            'link' => 'Търсене в форума',
            'login_required' => 'Влезте в профила си, за да търсите във форума',
            'more_simple' => 'Виж повече форум резултати от търсенето',
            'title' => 'Форум',

            'label' => [
                'forum' => 'търсене във форумите',
                'forum_children' => 'прибави и подфорумите',
                'topic_id' => 'тема #',
                'username' => 'автор',
            ],
        ],

        'mode' => [
            'all' => 'всички',
            'beatmapset' => 'бийтмапове',
            'forum_post' => 'форум',
            'user' => 'играч',
            'wiki_page' => 'wiki',
        ],

        'user' => [
            'login_required' => 'Влезте в профила си, за да търсите потребители',
            'more' => 'още :count резултата на играчи от търсенето',
            'more_simple' => 'Виж повече резултати на играчи от търсенето',
            'more_hidden' => 'Търсенето на играчи е ограничено до :max играчи. Опитайте да доусъвършенствате заявката за търсене.',
            'title' => 'Играчи',
        ],

        'wiki_page' => [
            'link' => 'Търсене в wiki',
            'more_simple' => 'Виж повече wiki резултати от търсенето',
            'title' => 'Wiki',
        ],
    ],

    'download' => [
        'tagline' => "нека ти помогнем<br>
с основите да започнеш!",
        'action' => 'Изтеглете osu!',

        'help' => [
            '_' => 'ако имате проблеми със стартирането на играта или с регистрирането на акаунт, :help_forum_link или :support_button.',
            'help_forum_link' => 'проверете форума за помощ',
            'support_button' => 'свързване с поддръжка',
        ],

        'os' => [
            'windows' => 'за Windows',
            'macos' => 'за macOS',
            'linux' => 'за Linux',
        ],
        'mirror' => 'алтернативен линк',
        'macos-fallback' => 'macOS потребители',
        'steps' => [
            'register' => [
                'title' => 'създайте акаунт',
                'description' => 'следвайте указанията, при стартиране на играта, за да влезете в акаунта си или да направите нов акаунт',
            ],
            'download' => [
                'title' => 'изтеглете играта',
                'description' => 'щракнете върху бутона горе, за да изтеглите инсталационната програма, след което я стартирате!',
            ],
            'beatmaps' => [
                'title' => 'изтеглете бийтмапове',
                'description' => [
                    '_' => ':browse голямата библиотека от потребителско създадените бийтмапове и започнете да играете!',
                    'browse' => 'разгледайте',
                ],
            ],
        ],
        'video-guide' => 'видео ръководство',
    ],

    'user' => [
        'title' => 'главно табло',
        'news' => [
            'title' => 'Новини',
            'error' => 'Грешка при зареждането на новините, пробвайте с презареждане на страницата?...',
        ],
        'header' => [
            'stats' => [
                'friends' => 'Приятели онлайн',
                'games' => 'Общо игри',
                'online' => 'Потребители онлайн',
            ],
        ],
        'beatmaps' => [
            'new' => 'Нови класирани бийтмапове',
            'popular' => 'Популярни бийтмапове',
            'by_user' => 'от :user',
        ],
        'buttons' => [
            'download' => 'Изтеглете osu!',
            'support' => 'Подкрепете osu!',
            'store' => 'osu!store',
        ],
    ],

    'support-osu' => [
        'title' => 'Уау!',
        'subtitle' => 'Изглежда си прекарвате прекрасно :D',
        'body' => [
            'part-1' => 'Знаете ли, че в osu! няма реклами и разчита на играчите си да покрепят играта за по-нататъчното й разрастване и поддръжка?',
            'part-2' => 'Знаете ли също че с подкрепата на osu! вие ще получите куп полезни преимущества, като възможността да теглите директно от играта, което става автоматично докато сте в мултиплейър сесия или докато наблюдавате друг играч?',
        ],
        'find-out-more' => 'Щракнете тук, за да разберете повече!',
        'download-starting' => "О и не се притеснявайте - инсталационният файл вече се тегли ;)",
    ],
];
