<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'landing' => [
        'download' => 'Изтегли сега',
        'online' => '<strong>:players</strong> в момента онлайн от общо <strong>:games</strong> игри',
        'peak' => 'Връхна точка, :count потребители онлайн',
        'players' => '<strong>:count</strong> регистрирани играчи',
        'title' => 'добре дошли',
        'see_more_news' => 'виж повече новини',

        'slogan' => [
            'main' => 'най-добрата безплатна ритъм игра',
            'sub' => 'ритъмът е само на клик от вас',
        ],
    ],

    'search' => [
        'advanced_link' => 'Разширено търсене',
        'button' => 'Търсене',
        'empty_result' => 'Нищо не бе открито!',
        'keyword_required' => 'Необходима е ключова дума за търсене',
        'placeholder' => 'Пишете тук за търсене…',
        'title' => 'Търсене',

        'beatmapset' => [
            'login_required' => 'Влез в профила си, за търсене на бийтмапове',
            'more' => 'още :count бийтмап резултата от търсенето',
            'more_simple' => 'Виж повече бийтмап резултати от търсенето',
            'title' => 'Бийтмапове',
        ],

        'forum_post' => [
            'all' => 'Всички форуми',
            'link' => 'Търси във форума',
            'login_required' => 'Влез в профила си, за търсене във форума',
            'more_simple' => 'Виж повече резултати от форум',
            'title' => 'Форум',

            'label' => [
                'forum' => 'търсене във форумите',
                'forum_children' => 'включи и подфорумите',
                'topic_id' => 'тема #',
                'username' => 'автор',
            ],
        ],

        'mode' => [
            'all' => 'всички',
            'beatmapset' => 'бийтмапове',
            'forum_post' => 'форум',
            'user' => 'играч',
            'wiki_page' => 'wiki',
        ],

        'user' => [
            'login_required' => 'Влез в профила си, за търсене на потребители',
            'more' => 'още :count резултата за играчи от търсенето',
            'more_simple' => 'Виж повече резултати на играчи от търсенето',
            'more_hidden' => 'Търсенето на играчи е ограничено до :max играчи. Опитайте да доусъвършенствате заявката за търсене.',
            'title' => 'Играчи',
        ],

        'wiki_page' => [
            'link' => 'Търсене в wiki',
            'more_simple' => 'Виж повече wiki резултати от търсенето',
            'title' => 'Wiki',
        ],
    ],

    'download' => [
        'tagline' => "нека Ви помогнем<br>
да започнете!",
        'action' => 'Изтегли osu!',

        'help' => [
            '_' => 'ако имате проблеми със стартирането на играта или регистрирането на акаунт, :help_forum_link или :support_button.',
            'help_forum_link' => 'проверете форума за помощ',
            'support_button' => 'се свържете с поддръжката',
        ],

        'os' => [
            'windows' => 'за Windows',
            'macos' => 'за macOS',
            'linux' => 'за Linux',
        ],
        'mirror' => 'алтернативна връзка',
        'macos-fallback' => 'macOS потребители',
        'steps' => [
            'register' => [
                'title' => 'създай акаунт',
                'description' => 'следвайте указанията, при стартиране на играта, за вход или създаване на нов акаунт',
            ],
            'download' => [
                'title' => 'изтегли играта',
                'description' => 'щракнете върху бутона горе за изтегляне на инсталиращата програма, след това я стартирайте!',
            ],
            'beatmaps' => [
                'title' => 'изтегли бийтмапове',
                'description' => [
                    '_' => ':browse огромната библиотека с бийтмапове, създадени от потребителите ни, и започнете да играете!',
                    'browse' => 'разгледайте',
                ],
            ],
        ],
        'video-guide' => 'видео ръководство',
    ],

    'user' => [
        'title' => 'главно табло',
        'news' => [
            'title' => 'Новини',
            'error' => 'Грешка при зареждане на новините, пробвайте с презареждане на страницата?...',
        ],
        'header' => [
            'stats' => [
                'friends' => 'Приятели онлайн',
                'games' => 'Общо игри',
                'online' => 'Потребители онлайн',
            ],
        ],
        'beatmaps' => [
            'new' => 'Нови класирани бийтмапове',
            'popular' => 'Популярни бийтмапове',
            'by_user' => 'от :user',
        ],
        'buttons' => [
            'download' => 'Изтегли osu!',
            'support' => 'Подкрепи osu!',
            'store' => 'osu!магазин',
        ],
    ],

    'support-osu' => [
        'title' => 'Уау!',
        'subtitle' => 'Изглежда си прекарвате прекрасно :D',
        'body' => [
            'part-1' => 'Знаете ли, че osu! няма реклами и разчита на подкрепата от своите играчи за нейното развитие и поддръжка?',
            'part-2' => 'Знаете ли също, че ако подкрепите osu! получавате куп полезни преимущества, като възможност за <strong>изтегляне на бийтмапове директно от играта</strong>, което става автоматично докато сте в мултиплейър сесия или наблюдавате играч?',
        ],
        'find-out-more' => 'Щракнете тук, за да разберете повече!',
        'download-starting' => "Ох, и не се притеснявайте - инсталационният файл вече се изтегля за Вас ;)",
    ],
];
