<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'beatmapset_update_notice' => [
        'new' => 'Уведомяваме ви, че има нова актуализация за бийтмапа ":title" след последното ви посещение.',
        'subject' => 'Нова актуализация за бийтмапа ":title"',
        'unwatch' => 'Ако вече не желаете да следите този бийтмап, може да кликнете върху връзката "Спри наблюдаването", в страницата по-горе или от страницата със списъка за наблюдение:
',
        'visit' => 'Посетете страницата за дискусии тук:',
    ],

    'common' => [
        'closing' => 'С уважение,',
        'hello' => 'Здравей :user,',
        'report' => 'Моля, отговорете на този имейл НЕЗАБАВНО, в случай че не сте поискали тази промяна.',
    ],

    'donation_thanks' => [
        'benefit_more' => 'Разбира се, с течение на времето ще получавате нови облаги за подкрепата която ни давате!',
        'feedback' => "Ако имате каквито и да е въпроси или искате да се свържете с нас, не се колебайте да отговорите на този имейл; Ще се свържем с вас възможно най-скоро!",
        'keep_free' => 'Благодарение на хора като вас, osu! е в състояние да поддържа играта и общността безпроблемно работещи, без реклами или принудителни плащания.',
        'keep_running' => 'Вашата подкрепа помага на osu! да работи за около :minutes! Това може да не изглежда като много, но всичко се натрупва :).',
        'subject' => 'Благодаря, osu! Ви <3',
        'translation' => 'Следва предоставен от общността превод за информационни цели:',

        'benefit' => [
            'gift' => 'Получателят(ите) на подаръка вече има достъп до osu!direct и всички други привилегии за поддръжници.',
            'self' => 'Вече имате достъп до osu!direct и всички останали привилегии за поддръжници за :duration.',
        ],

        'support' => [
            '_' => 'Благодаря много за цялата :support спрямо osu!.',
            'first' => 'подкрепа',
            'repeat' => 'продължаваща подкрепа',
        ],
    ],

    'forum_new_reply' => [
        'new' => 'Уведомяваме ви, че има нов отговор в ":title" след последното ви посещение.',
        'subject' => '[osu!] Нов отговор в дискусията ":title"',
        'unwatch' => 'Ако вече не желаете да следите тази дискусия, може да кликнете върху връзката „Отписване на абонамент от тази тема“, в долната част или от страницата за управление на следваните теми:',
        'visit' => 'Направо към последния отговор, използвайки следната връзка:',
    ],

    'password_reset' => [
        'code' => 'Твоят код за потвърждение е:',
        'requested' => 'Вие, или някой който се преструва на вас е поискал нулиране на паролата за вашия osu! профил.
',
        'subject' => 'възстановяване на osu! акаунт',
    ],

    'store_payment_completed' => [
        'prepare_shipping' => 'Получихме плащането и подготвяме вашата поръчка за доставка. Може да ни отнеме няколко дни за да я изпратим, в зависимост от количеството артикули. Може да проследите напредъка на поръчката от тук, включително подробности за проследяване, когато са налични:',
        'processing' => 'Получихме вашето разплащане и в момента обработваме поръчката. Може да проследите напредъка на поръчката от тук:
',
        'questions' => "Ако имате въпроси, не се колебайте да отговорите на този имейл.",
        'shipping' => 'Доставка',
        'subject' => 'Получихме вашата поръчка от osu!store !',
        'thank_you' => 'Благодаря за вашата osu!store поръчка!',
        'total' => 'Общо',
    ],

    'supporter_gift' => [
        'anonymous_gift' => 'Човекът, който ви подари този osu!supporter е решил да остане анонимен, затова той не е споменат в това известие.',
        'anonymous_gift_maybe_not' => 'Но вероятно вече знаете кой е ;).',
        'duration' => 'Благодарение на тях имате достъп до osu!direct и още други osu!supporter привилегии за следващите :duration.',
        'features' => 'Може да откриете повече информация на тези функционалности тук:',
        'gifted' => 'Някой току що ви подари osu!supporter tag!',
        'subject' => 'Подариха ви osu!supporter!',
    ],

    'user_email_updated' => [
        'changed_to' => 'Това е имейл за потвърждение, за да Ви информира, че вашият osu! имейл адрес е променен на: ":email".',
        'check' => 'Моля, уверете се че сте получили този имейл на вашия нов адрес, за да предотвратите загубата на достъп до вашия osu! профил в бъдеще.
',
        'sent' => 'От съображения за сигурност този имейл е изпратен както на вашия нов, така и на стария имейл адрес.',
        'subject' => 'потвърдете смяната на osu! имейла',
    ],

    'user_force_reactivation' => [
        'main' => 'Вашият акаунт се подозира, че е бил компрометиран, има скорошна подозрителна активност или МНОГО слаба парола. В резултат на това, изискваме да зададете нова парола. Моля, не забравяйте да изберете СИГУРНА парола.
',
        'perform_reset' => 'Можете да извършите активирането от :url',
        'reason' => 'Причина:',
        'subject' => 'Необходима е реактивация на osu! профила',
    ],

    'user_notification_digest' => [
        'new' => 'Уведомяваме ви, че има актуализации за нещата които наблюдавате.',
        'settings' => 'Промени известията по имейл:',
        'subject' => 'Нови osu! известия',
    ],

    'user_password_updated' => [
        'confirmation' => 'Това е подвърждение, че вашата osu! парола е променена.',
        'subject' => 'подвърдете смяната на osu! паролата',
    ],

    'user_verification' => [
        'code' => 'Твоят код за потвърждение е:',
        'code_hint' => 'Може да въведете кода с или без интервали.',
        'link' => 'Освен това, може да посетите връзката по-долу, за да завършите проверката:',
        'report' => 'В случай че не сте поискали това, моля ОТГОВОРЕТЕ НЕЗАБАВНО, тъй като профилът може да е в опасност.',
        'subject' => 'потвърждение на osu! акаунт',

        'action_from' => [
            '_' => 'Действие, извършено във вашия акаунт от :country, изисква потвърждение.',
            'unknown_country' => 'неизвестна държава',
        ],
    ],
];
