<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'beatmapset_update_notice' => [
        'new' => 'Просто да Ви уведомим, че е има нова актуална версия за бийтмапа ":title" след последното ви посещение.',
        'subject' => 'Нова актуализация за бийтмапа ":title"',
        'unwatch' => 'Ако вече не желаете да следите този бийтмап, може да кликнете върху връзката "Спри наблюдението", намерена в страницата по-горе или от страницата на модния списък за наблюдение:
',
        'visit' => 'Посетете страницата за дискусии тук:',
    ],

    'common' => [
        'closing' => 'Поздрави,',
        'hello' => 'Привет :user,',
        'report' => 'Моля отговорете на този имейл НЕЗАБАВНО в случай, че не сте поискали тази промяна.',
    ],

    'donation_thanks' => [
        'benefit_more' => 'С течение на времето ще се появят и нови ползи за подкрепата Ви на играта!',
        'feedback' => "Ако имате някакви запитвания или обратна връзка, не се колебайте да отговорите на този имейл; Ще се свържем с вас възможно най-скоро!",
        'keep_free' => 'Благодарение на хора като вас, osu! е в състояние да поддържа играта и общността безпроблемно работещи, без реклами или принудителни плащания.',
        'keep_running' => 'Вашата подкрепа помага osu! да работи за около :minutes! Това може да не изглежда като много, но всичко се натрупва :).',
        'subject' => 'Благодаря, osu! Ви <3',
        'translation' => 'Следва предоставен от общността превод за информационни цели:',

        'benefit' => [
            'gift' => 'Вашият(ите) получател(и) на подаръка вече имат достъп до osu!direct и до много други supporter привилегии.
',
            'self' => 'Вие вече имате достъп до osu!direct и до много други supporter привилегии за :duration.
',
        ],

        'support' => [
            '_' => 'Благодаря ви много за цялата :support спрямо osu!.',
            'first' => 'подкрепа',
            'repeat' => 'продължителна подкрепа',
        ],
    ],

    'forum_new_reply' => [
        'new' => 'Просто да Ви уведомим, че е има нов отговор в ":title" след последното ви посещение.',
        'subject' => '[osu!] Нов отговор на темата ":title"',
        'unwatch' => 'Ако вече не желаете да следите тази тема, може да кликнете върху връзката „Отписване на абонамент от тази тема“, намерена в долната част на темата по-горе или от страницата за управление на абонаменти на теми:',
        'visit' => 'Направо към последния отговор, използвайки следната връзка:',
    ],

    'password_reset' => [
        'code' => 'Твоят код за потвърждение е:',
        'requested' => 'Вие или някой, който се преструва на вас, сте поискали нулиране на паролата на вашия osu! акаунт.
',
        'subject' => 'възстановяване на osu! акаунт',
    ],

    'store_payment_completed' => [
        'prepare_shipping' => 'Получихме плащането ви и подготвяме вашата поръчка за доставка. Може да ни отнеме няколко дни, за да го изпратим, в зависимост от количеството поръчки. Можете да проследите напредъка на вашата поръчка тук, включително подробности за проследяване, когато са налични:',
        'processing' => 'Получихме вашето разплащане и в момента обработваме поръчката Ви. Можете да проследите напредъка на вашата поръчка тук:
',
        'questions' => "Ако имате въпроси, не се колебайте да отговорите на този имейл.",
        'shipping' => 'Доставка',
        'subject' => 'Получихме вашата поръчка от osu!store !',
        'thank_you' => 'Благодаря ви за вашата osu!store поръчка!',
        'total' => 'Общо',
    ],

    'supporter_gift' => [
        'anonymous_gift' => 'Човекът, който ви е подарил този osu!supporter tag може да реши да остане анонимен, затова те не са споменати в това известие.',
        'anonymous_gift_maybe_not' => 'Но Вие вече сигурно знаете кого е ;).',
        'duration' => 'Благодарение на тях, Вие имате достъп до osu!direct и още други osu!supporter привилегии за следващите :duration.',
        'features' => 'Може да откриете повече информация на тези функционалности тук:',
        'gifted' => 'Някой току що ви подари osu!supporter tag!',
        'subject' => 'Подариха ви osu!supporter!',
    ],

    'user_email_updated' => [
        'changed_to' => 'Това е имейл за потвърждение, за да Ви информира, че вашият osu! имейл адрес е променен на: ":email".',
        'check' => 'Моля, уверете се, че сте получили този имейл на вашия нов адрес, за да предотвратите загубата на достъп до вашия osu! акаунт в бъдеще.
',
        'sent' => 'От съображения за сигурност този имейл е изпратен както на вашия нов, така и на стария имейл адрес.',
        'subject' => 'потвърдете смяната на osu! имейла',
    ],

    'user_force_reactivation' => [
        'main' => 'Вашият акаунт се подозира, че е бил компрометиран, има скорошна подозрителна активност или МНОГО слаба парола. В резултат на това, изискваме да зададете нова парола. Моля, не забравяйте да изберете СИГУРНА парола.
',
        'perform_reset' => 'Можете да извършите нулирането от :url',
        'reason' => 'Причина:',
        'subject' => 'Необходима е реактивация на osu! акаунта',
    ],

    'user_notification_digest' => [
        'new' => 'Уведомяваме ви, че има новини за нещата които наблюдавате.',
        'settings' => 'Промени известията по имейл:',
        'subject' => 'Нови osu! известия',
    ],

    'user_password_updated' => [
        'confirmation' => 'Това е подвърждение, че вашата osu! парола бе променена.',
        'subject' => 'подвърдете смяната на osu! паролата',
    ],

    'user_verification' => [
        'code' => 'Твоят код за потвърждение е:',
        'code_hint' => 'Може да въведете кода с или без интервали.',
        'link' => 'Освен това, можете да посетите връзката по-долу, за да завършите проверката:
',
        'report' => 'В случай, че не сте поискали това, моля ви ОТГОВОРЕТЕ НЕЗАБАВНО, тъй като акаунтът ви може да бъде в опасност.',
        'subject' => 'потвърждение на osu! акаунт',

        'action_from' => [
            '_' => 'Действие, извършено във вашия акаунт от :country, изисква потвърждение.',
            'unknown_country' => 'неизвестна държава',
        ],
    ],
];
