<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'index' => [
        'none_running' => 'Вмомента няма активни турнири. Моля проверете отново по-късно!',
        'registration_period' => 'Регистрация: от :start до :end',

        'header' => [
            'title' => 'Обществени турнири',
        ],

        'item' => [
            'registered' => 'Регистрирани играчи',
        ],

        'state' => [
            'current' => 'Текущи турнири',
            'previous' => 'Предишни турнири',
        ],
    ],

    'show' => [
        'banner' => 'Подкрепи отбора си',
        'entered' => 'Вие сте вече регистрирани за този турнир.<br><br>Имайте в предвид, че вмомента не сте назначени към отбор.<br><br>По-нататъшни инструкции ще бъдат изпратени до вас по електронна поща близо до началната дата на турнира, така че проверете дали имейла ви е правилно изписан!',
        'info_page' => 'Информационна страница',
        'login_to_register' => 'Моля :login, за да имате достъп до регистрационните подробности!',
        'not_yet_entered' => 'Вие не сте регистриран за този турнир.',
        'rank_too_low' => 'Не отговяряте на необходимите изисквания за този турнир!',
        'registration_ends' => 'Регистрацията затваря на :date',

        'button' => [
            'cancel' => 'Отмени регистрацията',
            'register' => 'Запиши ме!',
        ],

        'period' => [
            'end' => 'Край',
            'start' => 'Начало',
        ],

        'state' => [
            'before_registration' => 'Регистрацията за този турнир още не е започнала.',
            'ended' => 'Този турнир приключи. Проверете информационната страниза за резултати.',
            'registration_closed' => 'Регистрацията за този турнир затвори. Проверете информационната страница за последните новини.',
            'running' => 'Този турнир в момента се провежда. Проверете информационната страница за повече детайли.',
        ],
    ],
    'tournament_period' => 'от :start до :end',
];
