<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'index' => [
        'none_running' => 'В момента няма активни турнири. Моля, проверете по-късно!',
        'registration_period' => 'Регистрация: от :start до :end',

        'header' => [
            'title' => 'Обществени турнири',
        ],

        'item' => [
            'registered' => 'Регистрирани играчи',
        ],

        'state' => [
            'current' => 'Текущи турнири',
            'previous' => 'Предишни турнири',
        ],
    ],

    'show' => [
        'banner' => 'Подкрепи отбора си',
        'entered' => 'Вие сте регистрирани за този турнир.<br><br>Обърнете внимание, това <b>не</b> означава, че сте назначени към отбор.<br><br>Ще ви бъдат изпратени инструкции по Имейл, когато наближи датата за турнира. Моля, уверете се, че Имейл адресът в osu!профила ви е валиден!',
        'info_page' => 'Информационна страница',
        'login_to_register' => 'Моля :login, за да имате достъп до регистрационните подробности!',
        'not_yet_entered' => 'Не сте регистрирани за този турнир.',
        'rank_too_low' => 'Не отговяряте на необходимите условия за този турнир!',
        'registration_ends' => 'Регистрацията затваря на :date',

        'button' => [
            'cancel' => 'Отмени регистрацията',
            'register' => 'Запиши ме!',
        ],

        'period' => [
            'end' => 'Край',
            'start' => 'Начало',
        ],

        'state' => [
            'before_registration' => 'Регистрацията за този турнир още не е започнала.',
            'ended' => 'Този турнир приключи. Проверете информационната страница за резултати.',
            'registration_closed' => 'Регистрациите за този турнир приключиха. Проверете информационната страница за новини.',
            'running' => 'Този турнир в момента се провежда. Проверете информационната страница за повече детайли.',
        ],
    ],
    'tournament_period' => 'от :start до :end',
];
