<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'box' => [
        'sent' => 'Електронно писмо бе изпратено до :mail с кот за потвърждение. Въведете кода.',
        'title' => 'Потвърждение на акаунта',
        'verifying' => 'Потвърждаване...',
        'issuing' => 'Издаване на нов код...',

        'info' => [
            'check_spam' => "Моля проверете папката спам ако не можете да откриете електронното писмо.",
            'recover' => "Ако нямате достъп до вашият имейл или сте забравили какво сте използвали, моля следвайте :link.",
            'recover_link' => 'процедура за възстановяване на имейл тук',
            'reissue' => 'Можете също така :reissue_link или :logout_link.',
            'reissue_link' => 'поискайте друг код',
            'logout_link' => 'изход',
        ],
    ],

    'errors' => [
        'expired' => 'Кодът за потвърждение е с изтекъл срок, ново електронно писмо бе пратено на пощата ви.',
        'incorrect_key' => 'Грешен код за потвърждение.',
        'retries_exceeded' => 'Грешен код за потвърждение. Лимитът за повторни опити е превишен, ново електронно писмо бе пратено на пощата ви.',
        'reissued' => 'Нов код за потвърждение бе създаден, ново електронно писмо бе пратено на пощата ви.',
        'unknown' => 'Изникна необичаен проблем, ново електронно писмо бе пратено на пощата ви.',
    ],
];
