<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'show' => [
        'fallback_translation' => 'Страницата все още не е преведена на избрания език (:language). Ще бъде показана на английски език.',
        'incomplete_or_outdated' => 'Съдържанието на тази страница е непълно или неактуално. Ако имате възможност да окажете съдействие, то актуализирането на тази статия би ни помогнало!',
        'missing' => 'Страницата ":keyword" не беше намерена.',
        'missing_title' => 'Не е намерено',
        'missing_translation' => 'Страницата не е намерена на текущо избрания език.',
        'needs_cleanup_or_rewrite' => 'Тази страница не отговаря на нашите стандарти за osu! wiki и е необходима преработка или изтриване. Ако имате възможност да окажете съдействие, то актуализирането на тази статия би ни помогнало!',
        'search' => 'Търси съществуващи страници за :link.',
        'stub' => '',
        'toc' => 'Съдържание',

        'edit' => [
            'link' => 'Покажи в GitHub',
            'refresh' => 'Обнови',
        ],

        'translation' => [
            'legal' => 'Този превод е предоставен само за удобство. Оригиналната версия :default е единствената правно обвързваща версия на този текст.',
            'outdated' => 'Тази страница съдържа стар превод на оригиналното съдържание. Моля проверете :default за най-точната информация (и си помислете за актуализация на превода, ако желаете да помогнете)!',

            'default' => 'Версия на английски език',
        ],
    ],
];
