<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'support' => [
        'convinced' => [
            'title' => 'โอเค จัดไป :D',
            'support' => 'สนับสนุน osu!',
            'gift' => 'หรือให้แท็กสนับสนุนแก่ผู้เล่นอื่น ๆ',
            'instructions' => 'คลิกที่ปุ่มหัวใจเพื่อดำเนินต่อไปที่ร้านของ osu!',
        ],
        'why-support' => [
            'title' => 'ทำไมจึงควรสนับสนุน osu! และเงินที่ให้จะไปไหนบ้าง',

            'team' => [
                'title' => 'ช่วยเหลือทีมงาน',
                'description' => 'ทีมงานที่คอยพัฒนา osu! การช่วยเหลือก็..ตามนั้นแหละ..ค่ากินค่าอยู่อะนะ',
            ],
            'infra' => [
                'title' => 'เซิร์ฟเวอร์และโครงสร้างพื้นฐาน',
                'description' => 'เงินที่บริจาคจะไปช่วยค่าเซิร์ฟเวอร์ที่เว็บนี้รันอยู่ รวมถึงระบบการเล่นหลายคน กระดานคะแนนออนไลน์ ฯลฯ',
            ],
            'featured-artists' => [
                'title' => 'ศิลปินโดดเด่น',
                'description' => 'ด้วยการสนับสนุนของคุณ ทางเราจะสามารถซื้อสิทธิ์จากค่ายเพลงสุดมันส์มาใช้ใน osu! ได้มากขึ้น',
                'link_text' => 'ดูรายการค่ายเพลงปัจจุบันที่ทางเราซื้อสิทธิ์มาอย่างถูกต้อง &raquo; ',
            ],
            'ads' => [
                'title' => 'ช่วยให้ osu! อยู่ได้',
                'description' => 'ความช่วยเหลือของคุณช่วยให้เกมนี้ไม่พึ่งพาใคร และไร้โฆษณาจากคนภายนอก',
            ],
            'tournaments' => [
                'title' => 'ทัวร์นาเมนต์แข่งขันอย่างเป็นทางการ',
                'description' => 'ช่วยเงินค่าดำเนินการ (และรางวัล) ทัวร์นาเมนต์ osu! World Cup',
                'link_text' => 'ดูรายการทัวร์นาเมนต์ทั้งหมด &raquo;',
            ],
            'bounty-program' => [
                'title' => 'โครงการเขียนโค้ดล่ารางวัล',
                'description' => 'ช่วยเหลือนักพัฒนาที่สละเวลาเพื่อให้ osu! ดีขึ้น',
                'link_text' => 'อ่านเพิ่มเติม &raquo;',
            ],
        ],
        'perks' => [
            'title' => 'โอ? ฉันได้อะไรบ้างเหรอ?!',
            'osu_direct' => [
                'title' => 'osu!direct',
                'description' => 'ระบบหาบีทแมพที่ง่ายและเร็วโดยไม่ต้องออกจากเกม',
            ],

            'friend_ranking' => [
                'title' => 'อันดับคะแนนของเพื่อน',
                'description' => "ดูว่าคะแนนบีทแมพของตัวเองกับเพื่อนใครเจ๋งกว่ากัน ทั้งในเกมและบนเว็บ",
            ],

            'country_ranking' => [
                'title' => 'อันดับคะแนนประเทศ',
                'description' => 'ครองประเทศ แล้วค่อยไปครองโลก',
            ],

            'mod_filtering' => [
                'title' => 'กรองตามม็อด',
                'description' => 'อยากเล่นกับคนเล่น HDHR ใช่มั้ย จัดไป',
            ],

            'auto_downloads' => [
                'title' => 'การดาวน์โหลดอัตโนมัติ',
                'description' => 'โหลดบีทแมพอัตโนมัติตอนเล่นหลายคน ดูคนอื่นเล่น หรือแค่กดลิงก์ในช่องแชต',
            ],

            'upload_more' => [
                'title' => 'อัปโหลดบีทแมพเพิ่ม',
                'description' => 'ช่องอัปโหลดบีทแมพเพิ่มเติม (ต่อแมพจัดอันดับที่มีอยู่) มากถึง 10 แมพ',
            ],

            'early_access' => [
                'title' => 'เข้าเล่นช่วงพัฒนา',
                'description' => 'สามารถเข้าเล่นช่วงพัฒนาได้ โดยคุณสามารถทดลองระบบใหม่ๆได้ก่อนที่มันจะมาจริงๆ!',
            ],

            'customisation' => [
                'title' => 'ปรับแต่งหน้าผู้ใช้',
                'description' => "ปรับแต่งโปรไฟล์ของคุณโดยการเพิ่มหน้า Userpage ที่ปรับแต่งได้อย่างสมบูรณ์",
            ],

            'beatmap_filters' => [
                'title' => 'ตัวกรองบีทแมพ',
                'description' => 'กรองบีทแมพที่เล่นแล้ว/ยังไม่เล่น และแรงก์ที่เคยได้',
            ],

            'yellow_fellow' => [
                'title' => 'สีเหลืองสดใส',
                'description' => 'ใคร ๆ ก็รู้ว่าเราเป็นผู้สนับสนุนด้วยชื่อสีเหลืองสดใส',
            ],

            'speedy_downloads' => [
                'title' => 'ดาวน์โหลดเร็วทันใจ',
                'description' => 'การจำกัดดาวน์โหลดผ่อนปรนมากขึ้น โดยเฉพาะตอนใช้ osu!direct',
            ],

            'change_username' => [
                'title' => 'เปลี่ยนชื่อผู้ใช้',
                'description' => 'เปลี่ยนชื่อผู้เล่นคุณโดยไม่เสียเงิน (ได้ครั้งเดียว)',
            ],

            'skinnables' => [
                'title' => 'การสกินเพิ่มเติม',
                'description' => 'ส่วนที่สกินได้เพิ่มเติม เช่นพื้นหลังของเมนูหลัก',
            ],

            'feature_votes' => [
                'title' => 'โหวตระบบ',
                'description' => 'โหวตให้ระบบใหม่ๆ (สูงสุด 2 ครั้งต่อเดือน)',
            ],

            'sort_options' => [
                'title' => 'ตัวเลือกการเรียงลำดับ',
                'description' => 'ดูรายการคะแนนของประเทศ/เพื่อน/ม็อดที่เลือกในเกม',
            ],

            'more_favourites' => [
                'title' => 'เพิ่มจำนวนบีทแมพที่คุณสามารถเลือกเป็นรายการโปรด',
                'description' => 'จำนวนบีทแมพที่คุณชื่นชอบได้เพิ่มจาก :normally &rarr; :supporter',
            ],
            'more_friends' => [
                'title' => 'เพิ่มจำนวนเพื่อนที่คุณสามารถมีได้',
                'description' => 'จำนวนเพื่อนที่คุณมีได้สูงสุดเพิ่มจาก :normally &rarr; :supporter',
            ],
            'more_beatmaps' => [
                'title' => 'อัปโหลดบีทแมพเพิ่ม',
                'description' => 'จำนวนบีทแมพที่ไม่ได้จัดอันดับ ณ เวลาใด ๆ จะขึ้นกับค่าเริ่มต้น + โบนัสต่อจำนวนบีทแมพที่ได้จัดอันดับ (สูงสุดตามขีดจำกัดที่มี)<br/><br/>ปกติแล้วคือ :base + :bonus บีทแมพต่อบีทแมพที่ได้จัดอันดับ (สูงสุด :bonus_max) หากเป็นผู้สนับสนุน จะกลายเป็น :supporter_base + :supporter_bonus บีทแมพ (สูงสุด :supporter_bonus_max)',
            ],
            'friend_filtering' => [
                'title' => 'อันดับคะแนนเพื่อน',
                'description' => 'แข่งกับเพื่อนว่าใครเก่งกว่ากัน <br/><br/><small>*ยังไม่ขึ้นเว็บใหม่ แต่ก็ที่นี่ เร็ว ๆ นี้ย์(tm)</small>',
            ],

        ],
        'supporter_status' => [
            'contribution' => 'ขอบคุณสำหรับการสนับสนุนของคุณ! คุณได้สนับสนุนเป็นเงินรวม :dollars จากการซิ้อแท็ก :tags อัน!',
            'gifted' => "คุณได้ซื้อแท็ก :giftedTags อันสำหรับเป็นของขวัญ (มูลค่า :giftedDollars) ใจกว้างมาก!",
            'not_yet' => "คุณยังไม่มีแท็กสนับสนุน :(",
            'valid_until' => 'แท็กสนับสนุนของคุณใช้ได้จนถึง :date!',
            'was_valid_until' => 'แท็กสนับสนุนคุณหมดอายุเมื่อ :date',
        ],
    ],
];
