<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'pinned_topics' => 'หัวข้อที่ปักหมุดไว้',
    'slogan' => "มันอันตรายที่จะเล่นคนเดียว",
    'subforums' => 'ฟอรั่มย่อย',
    'title' => 'ฟอรั่ม osu!',

    'covers' => [
        'edit' => 'แก้ไขหน้าปก',

        'create' => [
            '_' => 'ตั้งภาพหน้าปก',
            'button' => 'อัพโหลดรูปภาพ',
            'info' => 'ภาพหน้าปกควรมีขนาด :dimensions. คุณยังสามารถลากวางรูปที่นี่ได้เพื่ออัพโหลด',
        ],

        'destroy' => [
            '_' => 'นำภาพหน้าปกออก',
            'confirm' => 'คุณแน่ใจหรือไม่ว่าจะนำภาพหน้าปกออก',
        ],
    ],

    'forums' => [
        'forums' => 'ฟอรั่ม',
        'latest_post' => 'โพสต์ล่าสุด',

        'index' => [
            'title' => 'หน้าแรกของบอร์ด',
        ],

        'topics' => [
            'empty' => 'ไม่มีหัวข้อ',
        ],
    ],

    'mark_as_read' => [
        'forum' => 'ทำเครื่องหมายว่าอ่านทั้งหมดแล้ว',
        'forums' => 'ทำเครื่องหมายว่าอ่านทั้งหมดแล้ว',
        'busy' => 'กําลังทำเครื่องหมายว่าอ่านแล้ว...',
    ],

    'post' => [
        'confirm_destroy' => 'ต้องการลบโพสต์จริงหรอ?',
        'confirm_restore' => 'ต้องการกู้คืนโพสต์จริงหรอ?',
        'edited' => 'แก้ไขล่าสุดโดย :user :when ถูกแก้ไขทั้งหมด :count ครั้ง',
        'posted_at' => 'โพสต์เมื่อ :when',
        'posted_by_in' => 'โพสต์โดย :username ใน :forum',

        'actions' => [
            'destroy' => 'ลบโพสต์',
            'edit' => 'แก้ไขโพสต์',
            'report' => 'รายงานโพสต์',
            'restore' => 'กู้คืนโพสต์',
        ],

        'create' => [
            'title' => [
                'reply' => 'ตอบกลับ',
            ],
        ],

        'info' => [
            'post_count' => ':count_delimited โพสต์|:count_delimited โพสต์',
            'topic_starter' => 'ผู้เริ่มกระทู้',
        ],
    ],

    'search' => [
        'go_to_post' => 'ไปยังโพสต์',
        'post_number_input' => 'ป้อนหมายเลขของโพสต์',
        'total_posts' => ':posts_count จำนวนโพสต์ทั้งหมด',
    ],

    'topic' => [
        'confirm_destroy' => 'ต้องการลบโพสต์จริงหรอ?',
        'confirm_restore' => 'ต้องการกู้คืนโพสต์จริงหรอ?',
        'deleted' => 'ลบกระทู้',
        'go_to_latest' => 'ดูโพสต์ล่าสุด',
        'has_replied' => 'คุณได้ตอบกลับการสนทนานี้',
        'in_forum' => 'ใน :forum',
        'latest_post' => ':when โดย :user',
        'latest_reply_by' => 'ตอบกลับล่าสุดโดย :user',
        'new_topic' => 'สร้างกระทู้ใหม่',
        'new_topic_login' => 'เข้าสู่ระบบเพื่อตั้งกระทู้ใหม่',
        'post_reply' => 'โพสต์',
        'reply_box_placeholder' => 'พิมพ์ที่นี่เพื่อตอบกลับ',
        'reply_title_prefix' => 'รี',
        'started_by' => 'โดย :user',
        'started_by_verbose' => 'เริ่มโดย :user',

        'actions' => [
            'destroy' => 'ลบหัวข้อ',
            'restore' => 'กู้คือหัวข้อ',
        ],

        'create' => [
            'close' => 'ปิด',
            'preview' => 'ดูตัวอย่าง',
            // TL note: this is used in the topic reply preview, when
            // the user goes back from previewing to editing the reply
            'preview_hide' => 'เขียน',
            'submit' => 'โพสต์',

            'necropost' => [
                'default' => 'กระทู้นี้ไม่ได้ถูกใช้งานมาระยะหนึ่ง ให้โพสต์ลงที่นี่หากคุณมีเหตุจำเป็นจริงๆ',

                'new_topic' => [
                    '_' => "กระทู้นี้ไม่ได้ถูกใช้งานมาระยะหนึ่ง ให้โพสต์ลงที่นี่หากคุณมีเหตุจำเป็นจริงๆ กรุณา :create แทน",
                    'create' => 'สร้างกระทู้ใหม่',
                ],
            ],

            'placeholder' => [
                'body' => 'พิมพ์เนื้อหาโพสต์ที่นี่',
                'title' => 'คลิกที่นี่เพื่อตั้งหัวข้อ',
            ],
        ],

        'jump' => [
            'enter' => 'คลิกเพื่อป้อนหมายเลขโพสต์ที่ต้องการ',
            'first' => 'ไปที่โพสต์แรก',
            'last' => 'ไปที่โพสต์ล่าสุด',
            'next' => 'ข้ามไป 10 โพสต์',
            'previous' => 'ย้อนกลับไป 10 โพสต์',
        ],

        'logs' => [
            '_' => 'บันทึกหัวข้อ',
            'button' => 'เรียกดูบันทึกหัวข้อ',

            'columns' => [
                'action' => 'จัดการ',
                'date' => 'วันที่',
                'user' => 'ผู้ใช้',
            ],

            'data' => [
                'add_tag' => 'เพิ่มแท็ก ":tag" แล้ว',
                'announcement' => 'ปักหมุดหัวข้อและทำเครื่องหมายเป็นประกาศ',
                'edit_topic' => 'ถึง :title',
                'fork' => 'จาก :topic',
                'pin' => 'หัวข้อที่ปักหมุดไว้',
                'post_operation' => 'โพสต์โดย :username',
                'remove_tag' => 'ลบแท็ก ":tag" แล้ว',
                'source_forum_operation' => 'จาก :forum',
                'unpin' => 'หัวข้อที่ไม่ปักหมุดไว้',
            ],

            'no_results' => 'ไม่พบบันทึก...',

            'operations' => [
                'delete_post' => 'โพสต์ที่ถูกลบ',
                'delete_topic' => 'หัวข้อที่ถูกลบ',
                'edit_topic' => 'เปลี่ยนชื่อหัวข้อแล้ว',
                'edit_poll' => 'แก้ไขโพลล์ของหัวข้อ',
                'fork' => 'คัดลอกหัวข้อแล้ว',
                'issue_tag' => 'แท็กที่มีปัญหาอยู่',
                'lock' => 'หัวข้อที่ถูกล็อค',
                'merge' => 'รวมโพสต์ในหัวข้อนี้แล้ว',
                'move' => 'หัวข้อที่ย้าย',
                'pin' => 'หัวข้อที่ปักหมุดไว้',
                'post_edited' => 'แก้ไขโพสต์แล้ว',
                'restore_post' => 'กู้คืนโพสต์แล้ว',
                'restore_topic' => 'กู้คืนหัวข้อแล้ว',
                'split_destination' => 'ย้ายโพสต์แยกแล้ว',
                'split_source' => 'แยกโพสต์',
                'topic_type' => 'กำหนดประเภทหัวข้อ',
                'topic_type_changed' => 'เปลี่ยนประเภทหัวข้อแล้ว',
                'unlock' => 'หัวข้อที่ปลดล็อค',
                'unpin' => 'หัวข้อเลิกปักหมุดแล้ว',
                'user_lock' => 'ล็อคหัวข้อของตัวเองแล้ว',
                'user_unlock' => 'ปลดล็อคหัวข้อของตัวเองแล้ว',
            ],
        ],

        'post_edit' => [
            'cancel' => 'ยกเลิก',
            'post' => 'บันทึก',
        ],
    ],

    'topic_watches' => [
        'index' => [
            'title_compact' => 'กระทู้ที่ติดตาม',

            'box' => [
                'total' => 'ติดตามกระทู้แล้ว',
                'unread' => 'กระทู้ที่มีการตอบกลับใหม่',
            ],

            'info' => [
                'total' => 'การติดตามของคุณ :total topics.',
                'unread' => 'คุณมี :unread การตอบกลับที่ยังไม่ได้อ่านในกระทู้ที่ติดตาม',
            ],
        ],

        'topic_buttons' => [
            'remove' => [
                'confirmation' => 'ยกเลิกการติดตามกระทู้นี้',
                'title' => 'ยกเลิกการติดตาม',
            ],
        ],
    ],

    'topics' => [
        '_' => 'หัวข้อ',

        'actions' => [
            'login_reply' => 'เข้าสู่ระบบเพื่อตอบกลับ',
            'reply' => 'แสดงหน้าต่างตอบกลับ',
            'reply_with_quote' => 'โพสต์อ้างอิงสำหรับการตอบกลับ',
            'search' => 'ค้นหา',
        ],

        'create' => [
            'create_poll' => 'การสร้างแบบสำรวจความคิดเห็น',

            'preview' => 'ตัวอย่างโพสต์',

            'create_poll_button' => [
                'add' => 'สร้างการสำรวจความคิดเห็น',
                'remove' => 'ยกเลิกการสร้างแบบสำรวจความคิดเห็น',
            ],

            'poll' => [
                'hide_results' => 'ซ่อนผลลัพท์ของโพลล์',
                'hide_results_info' => 'จะแสดงหลังจากโพลล์สิ้นสุดเท่านั้น',
                'length' => 'เรียกใช้แบบสำรวจสำหรับ',
                'length_days_suffix' => 'วัน',
                'length_info' => 'เว้นว่างไว้สำหรับโพลล์ที่ไม่มีวันสิ้นสุด',
                'max_options' => 'ตัวเลือกต่อผู้ใช้',
                'max_options_info' => 'นี่คือจำนวนตัวเลือกที่ผู้ใช้แต่ละคนอาจเลือกเมื่อลงคะแนน',
                'options' => 'ตัวเลือก',
                'options_info' => 'วางแต่ละตัวเลือกในบรรทัดใหม่ คุณสามารถป้อนได้สูงสุด 10 ตัวเลือก',
                'title' => 'คำถาม',
                'vote_change' => 'อนุญาตให้ลงคะแนนใหม่',
                'vote_change_info' => 'หากเปิดใช้งาน ผู้ใช้จะสามารถเปลี่ยนการลงคะแนนของตนได้',
            ],
        ],

        'edit_title' => [
            'start' => 'แก้ไขชื่อเรื่อง',
        ],

        'index' => [
            'feature_votes' => 'ลำดับความสำคัญ',
            'replies' => 'ตอบกลับ',
            'views' => 'ดู',
        ],

        'issue_tag_added' => [
            'to_0' => 'ลบ"แท็ก"ที่เพิ่ม',
            'to_0_done' => 'ลบแท็ก "เพิ่มแล้ว" แล้ว',
            'to_1' => 'เพิ่มแท็ก',
            'to_1_done' => 'เพิ่มแท็ก "เพิ่มแล้ว" แล้ว',
        ],

        'issue_tag_assigned' => [
            'to_0' => 'ลบแท็ก "กำหนดแล้ว"',
            'to_0_done' => 'ลบแท็ก "กำหนดแล้ว" แล้ว',
            'to_1' => 'เพิ่มแท็ก "กำหนดแล้ว"',
            'to_1_done' => 'เพิ่มแท็ก "กำหนดแล้ว" แล้ว',
        ],

        'issue_tag_confirmed' => [
            'to_0' => 'ลบแท็ก "ยืนยันแล้ว"',
            'to_0_done' => 'ลบแท็ก "ยืนยันแล้ว" แล้ว',
            'to_1' => 'เพิ่มแท็ก "ยืนยันแล้ว"',
            'to_1_done' => 'เพิ่มแท็ก "ยืนยันแล้ว" แล้ว',
        ],

        'issue_tag_duplicate' => [
            'to_0' => 'ลบแท็ก "ซ้ำ"',
            'to_0_done' => 'ลบแท็ก "ซ้ำ" แล้ว',
            'to_1' => 'เพิ่มแท็ก "ซ้ำ"',
            'to_1_done' => 'เพิ่มแท็ก "ซ้ำ" แล้ว',
        ],

        'issue_tag_invalid' => [
            'to_0' => 'ลบแท็ก "โมฆะ"',
            'to_0_done' => 'ลบแท็ก "โมฆะ" แล้ว',
            'to_1' => 'เพิ่มแท็ก "โมฆะ"',
            'to_1_done' => 'เพิ่มแท็ก "โมฆะ" แล้ว',
        ],

        'issue_tag_resolved' => [
            'to_0' => 'ลบแท็ก "แก้แล้ว"',
            'to_0_done' => 'ลบแท็ก "แก้แล้ว" แล้ว',
            'to_1' => 'เพิ่มแท็ก "แก้แล้ว"',
            'to_1_done' => 'เพิ่มแท็ก "แก้แล้ว" แล้ว',
        ],

        'lock' => [
            'is_locked' => 'หัวข้อนี้ถูกล็อกและไม่สามารถตอบกลับได้',
            'to_0' => 'ปลดล็อกหัวข้อ',
            'to_0_confirm' => 'จะปลดล็อกกระทู้หรือไม่',
            'to_0_done' => 'หัวข้อถูกปลดล็อกแล้ว',
            'to_1' => 'ล็อกหัวข้อ',
            'to_1_confirm' => 'จะล็อกกระทู้หรือไม่',
            'to_1_done' => 'หัวข้อถูกล็อกแล้ว',
        ],

        'moderate_move' => [
            'title' => 'ย้ายไปฟอรัมอื่น',
        ],

        'moderate_pin' => [
            'to_0' => 'เลิกปักหมุดหัวข้อ',
            'to_0_confirm' => 'จะเลิกปักหมุดหัวข้อหรือไม่',
            'to_0_done' => 'หัวข้อถูกเลิกปักหมุดแล้ว',
            'to_1' => 'ปักหมุดหัวข้อ',
            'to_1_confirm' => 'จะปักหมุดหัวข้อหรือไม่',
            'to_1_done' => 'หัวข้อถูกปักหมุดแล้ว',
            'to_2' => 'ปักหมุดหัวข้อและตั้งให้เป็นประกาศ',
            'to_2_confirm' => 'จะปักหมุดและให้กระทู้นี้เป็นการประกาศหรือไม่',
            'to_2_done' => 'หัวข้อถูกปักหมุดและตั้งให้เป็นประกาศแล้ว',
        ],

        'moderate_toggle_deleted' => [
            'show' => 'แสดงโพสต์ที่ถูกลบ',
            'hide' => 'ซ่อนโพสต์ที่ถูกลบ',
        ],

        'show' => [
            'deleted-posts' => 'โพสต์ที่ถูกลบ',
            'total_posts' => 'โพสต์ทั้งหมด',

            'feature_vote' => [
                'current' => 'ลำดับความสำคัญปัจจุบัน: +:count',
                'do' => 'ส่งเสริมคำขอนี้',

                'info' => [
                    '_' => 'นี่คือ :feature_request คำขอคุณสมบัติสามารถลงคะแนนได้โดย :supporters',
                    'feature_request' => 'ร้องข้อคุณสมบัติ',
                    'supporters' => 'ผู้สนับสนุน',
                ],

                'user' => [
                    'count' => '{0} ไม่โหวต|{1}  :count_delimited โหวต|[2,*] :count_delimited โหวต',
                    'current' => 'คุณมี :votes ที่เหลืออยู่',
                    'not_enough' => "คุณไม่มีคะแนนโหวตเหลืออยู่",
                ],
            ],

            'poll' => [
                'edit' => 'แก้ไขโพลล์',
                'edit_warning' => 'ถ้าแก้ไขโพลล์แล้วผลโหวตจะหายนะ',
                'vote' => 'โหวต',

                'button' => [
                    'change_vote' => 'เปลี่ยนตัวเลือกโหวต',
                    'edit' => 'แก้ไขโพลล์',
                    'view_results' => 'ไปดูผลโหวต',
                    'vote' => 'โหวต',
                ],

                'detail' => [
                    'end_time' => 'การลงคะแนนจะสิ้นสุดลงที่ :time',
                    'ended' => 'การสำรวจสิ้นสุดลง :time',
                    'results_hidden' => 'ผลลัพท์จะถูกแสดงหลังจากโพลล์สิ้นสุดลง',
                    'total' => 'คะแนนโหวตทั้งหมด: :count',
                ],
            ],
        ],

        'watch' => [
            'to_not_watching' => 'ไม่ได้บุ๊กมาร์คไว้',
            'to_watching' => 'บุ๊กมาร์ค',
            'to_watching_mail' => 'บุ๊กมาร์คและรับการแจ้งเตือน',
            'tooltip_mail_disable' => 'การแจ้งเตือนถูกเปิดใช้งาน คลิกเพื่อปิดการใช้งาน',
            'tooltip_mail_enable' => 'การแจ้งเตือนถูกปิดใช้งาน คลิกเพื่อเปิดการใช้งาน',
        ],
    ],
];
