<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'beatmapset_update_notice' => [
        'new' => 'อยากจะบอกว่าตั้งแต่ออกจากกระทู้บีทแมพ ":title" ครั้งล่าสุด บีทแมพอัปเดตแล้ว',
        'subject' => 'มีอัพเดตใหม่สำหรับ beatmap ":title"',
        'unwatch' => 'ถ้าคุณไม่ต้องการที่จะติดตามบีทแมพนี้ต่อ คุณสามารถเลือกระหว่างการกดปุ่ม Unwatch ที่อยู่ในหน้าด้านบน และ การกดปุ่ม Unwatch ที่อยู่ในหน้า รายการ Mod ที่ติดตาม',
        'visit' => 'เยี่ยมชมหน้าการสนทนาได้จากที่นี่',
    ],

    'common' => [
        'closing' => 'ด้วยความเคารพ',
        'hello' => 'สวัสดี :user,',
        'report' => 'โปรดตอบกลับอีเมลนี้โดยทันที หากคุณไม่ได้ร้องขอการเปลี่ยนแปลงนี้',
    ],

    'donation_thanks' => [
        'benefit_more' => 'สิทธิเพิ่มเติมสำหรับผู้สนับสนุนจะถูกเพิ่มตามกาลเวลาด้วย!',
        'feedback' => "หากคุณมีคำถามหรือข้อเสนอแนะอย่าลังเลที่จะตอบกลับอีเมลนี้ ฉันจะตอบกลับไปหาคุณโดยเร็วที่สุด!",
        'keep_free' => 'ขอบคุณคนอย่างคุณ osu! สามารถทำให้เกมและชุมชนทำงานได้อย่างราบรื่นโดยที่ไม่ต้องมีโฆษณาหรือบังคับให้จ่ายเงิน',
        'keep_running' => 'คุณช่วยต่ออายุให้ osu! อีกประมาณ :minutes นาที ดูเหมือนไม่มากแต่ก็ช่วยได้เยอะนะ',
        'subject' => 'ขอบคุณมาก osu! <3 คุณ',
        'translation' => 'คำแปลจากชุมชนของเราอยู่ด้านล่าง',

        'benefit' => [
            'gift' => 'ตอนนี้คนที่คุณส่งของขวัญให้เข้า osu!direct ได้แล้ว พร้อมสิทธิพิเศษนับพันจากการเป็นผู้สนับสนุน',
            'self' => 'ตอนนี้คุณจะสามารถเข้าถึง osu!direct และสิทธิประโยชน์อื่นๆ อีกมากมายสำหรับ:duration',
        ],

        'support' => [
            '_' => '
ขอบคุณมากๆสำหรับการ:supportของคุณต่อ osu!',
            'first' => 'สนับสนุน',
            'repeat' => 'สนับสนุนอย่างต่อเนื่อง',
        ],
    ],

    'forum_new_reply' => [
        'new' => 'อยากจะบอกว่าตั้งแต่ออกจากกระทู้ ":title" ครั้งล่าสุด มีคนตอบกลับแล้ว',
        'subject' => '[osu!] มีการตอบกลับใหม่ใน ":title"',
        'unwatch' => 'หากคุณไม่ต้องการดูหัวข้อนี้อีก คุณสามารถคลิกลิงก์  "ยกเลิกหัวข้อการสมัครรับข้อมูล" ที่ด้านล่างของหัวข้อด้านบนหรือจากหน้าการจัดการการหัวข้อการสมัครสมาชิก',
        'visit' => '
ข้ามไปที่คำตอบล่าสุดโดยใช้ลิงค์ต่อไปนี้: ',
    ],

    'password_reset' => [
        'code' => 'รหัสยืนยันของคุณคือ:',
        'requested' => 'มีคนส่งคำขอรีเซ็ตรหัสผ่านบัญชี osu! ของคุณ ซึ่งคน ๆ นั้นไม่คุณก็คนที่แอบอ้างว่าเป็นคุณ',
        'subject' => 'กู้ข้อมูลผู้ใช้ osu!',
    ],

    'store_payment_completed' => [
        'prepare_shipping' => 'เราได้รับการชำระเงินของคุณและกำลังเตรียมการสั่งซื้อสำหรับการจัดส่ง อาจใช้เวลาสองถึงสามวันในการส่งออก ทั้งนี้ขึ้นอยู่กับปริมาณการสั่งซื้อ คุณสามารถติดตามความคืบหน้าของการสั่งซื้อของคุณได้ที่นี่ รวมถึงรายละเอียดการติดตามสินค้า',
        'processing' => 'เราได้รับการชำระเงินของคุณและกำลังประมวลผลคำสั่งซื้อของคุณ คุณสามารถติดตามความคืบหน้าของการสั่งซื้อของคุณได้ที่นี่',
        'questions' => "
หากคุณมีคำถามใด ๆ อย่าลังเลที่จะตอบกลับอีเมลนี้",
        'shipping' => 'การจัดส่งสินค้า',
        'subject' => 'เราได้รับคำสั่งซื้อ osu!store ของคุณแล้ว!',
        'thank_you' => 'ขอบคุณสำหรับคำสั่งซื้อของ osu! store!',
        'total' => 'รวมยอดทั้งหมด',
    ],

    'supporter_gift' => [
        'anonymous_gift' => 'คนที่ส่งแท็ก osu!supporter ให้อาจจะไม่อยากเปิดเผยตัวตน ดังนั้นจึงไม่มีชื่อคนส่งให้ในการแจ้งเตือนนี้',
        'anonymous_gift_maybe_not' => 'แต่น่าจะรู้แล้วแหละว่าใครส่งมา ;)',
        'duration' => 'ต้องขอบคุณคนส่งมาด้วยเพราะคุณใช้ osu!direct ได้แล้วและสิทธิประโยชน์นับพันจากการเป็นผู้สนับสนุน ใช้ได้นาน :duration',
        'features' => 'คุณสามารถหารายละเอียดเพิ่มเติมเกี่ยวกับคุณสมบัติเหล่านี้ได้ที่นี่',
        'gifted' => 'มีคนให้แท็ก osu!supporter คุณด้วย',
        'subject' => 'คุณได้รับแท็ก osu!supporter',
    ],

    'user_email_updated' => [
        'changed_to' => 'นี่คืออีเมลยืนยันที่จะแจ้งให้คุณทราบว่าอีเมลบัญชีผู้ใช้ osu! ของคุณจะถูกเปลี่ยนไปเป็น ":email"',
        'check' => 'โปรดตรวจสอบให้แน่ใจว่าคุณได้รับอีเมลนี้ตามที่อยู่ใหม่ของคุณ เพื่อป้องกันการสูญเสียสำหรับการเข้าถึงบัญชี osu! ในอนาคต',
        'sent' => 'ด้วยเหตุผลด้านความปลอดภัย เราส่งอีเมล์ให้คุณไปทั้งที่อยู่อีเมลเก่าและใหม่',
        'subject' => 'ยืนยันการเปลี่ยนอีเมล osu!',
    ],

    'user_force_reactivation' => [
        'main' => 'บัญชีของคุณถูกต้องสงสัยว่าถูกบุกรุก หรือมีการกระทำที่น่าสงสัย หรือตั้งรหัสผ่านที่อ่อนมาก ๆ ดังนั้นเราขอให้คุณตั้งรหัสผ่านใหม่ และต้องใช้รหัสผ่านที่ปลอดภัยด้วย',
        'perform_reset' => 'คุณสามารถทำการรีเซ็ตได้จาก :url',
        'reason' => 'เหตุผล:',
        'subject' => 'ต้องเปิดบัญชีใช้งาน osu! อีกครั้ง',
    ],

    'user_notification_digest' => [
        'new' => 'อยากจะบอกว่ามีอัปเดตใหม่ในรายการที่คุณกำลังจับตามองอยู่',
        'settings' => 'เปลี่ยนการตั้งค่าการแจ้งเตือนทาง email',
        'subject' => 'การแจ้งเตือน osu! ใหม่',
    ],

    'user_password_updated' => [
        'confirmation' => 'นี่เป็นการยืนยันว่ารหัสผ่าน osu! ของคุณถูกเปลี่ยน',
        'subject' => 'ยืนยันการเปลี่ยนรหัสผ่าน osu!',
    ],

    'user_verification' => [
        'code' => 'รหัสยืนยันของคุณคือ:',
        'code_hint' => '
คุณสามารถป้อนรหัสโดยมีหรือไม่มีช่องว่าง',
        'link' => '
หรือคุณสามารถไปที่ลิงก์ด้านล่างนี้เพื่อทำการยืนยันให้เสร็จสิ้น',
        'report' => 'หากคุณไม่ได้ขอ ให้ตอบกลับอีเมล์นี้ ***ทันที*** เพราะบัญชีคุณอาจตกอยู่ในอันตราย',
        'subject' => 'ยืนยันตัวตนบัญชี osu!',

        'action_from' => [
            '_' => 'การกระทำที่เกิดขึ้นกับบัญชีของคุณต้องได้รับการยืนยันจาก:country',
            'unknown_country' => 'ประเทศที่ไม่รู้จัก',
        ],
    ],
];
