<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'index' => [
        'none_running' => 'ไม่มีทัวร์นาเมนต์ในขณะนี้ มาทีหลังนะ',
        'registration_period' => 'ระยะเวลาการลงทะเบียน: :start ถึง :end',

        'header' => [
            'title' => 'การแข่งขันของชุมชน',
        ],

        'item' => [
            'registered' => 'ผู้เล่นที่ลงทะเบียน',
        ],

        'state' => [
            'current' => 'ทัวร์นาเมนต์ที่กำลังดำเนินอยู่',
            'previous' => 'ทัวร์นาเมนต์ที่เสร็จสิ้นลงแล้ว',
        ],
    ],

    'show' => [
        'banner' => 'สนับสนุนทีมของคุณ',
        'entered' => 'คุณลงทะเบียนการแข่งขันนี้แล้ว.<br><br>โปรดทราบว่าข้อความนี้<b>ไม่ได้</b>แปลว่าคุณจะได้อยู่ในทีม<br><br>และจะมีอีเมล์ที่มีคำแนะนำเพิ่มเติมส่งไปใกล้วันแข่ง และกรุณาตรวจสอบว่าอีเมล์ของบัญชี osu! นั้นถูกต้อง',
        'info_page' => 'หน้าข้อมูล',
        'login_to_register' => 'กรุณา :login เพื่อดูข้อมูลการลงทะเบียน',
        'not_yet_entered' => 'คุณไม่สามารถลงทะเบียนการแข่งขันนี้ได้',
        'rank_too_low' => 'ขออภัย อันดับของคุณยังไม่ถึงเกณฑ์สำหรับการแข่งขันนี้',
        'registration_ends' => 'ปิดลงทะเบียน :date',

        'button' => [
            'cancel' => 'ยกเลิกการลงทะเบียน',
            'register' => 'ลงทะเบียนเลย! ',
        ],

        'period' => [
            'end' => 'สิ้นสุด',
            'start' => 'เริ่ม',
        ],

        'state' => [
            'before_registration' => 'การลงทะเบียนสำหรับการแข่งขันนี้ยังไม่เปิด',
            'ended' => 'การแข่งขันนี้ได้เสร็จสิ้นแล้ว ตรวจสอบผลลัพธ์จากหน้าข้อมูล',
            'registration_closed' => 'การลงทะเบียนสำหรับการแข่งขันนี้ปิดแล้ว ตรวจสอบหน้าข้อมูลล่าสุด',
            'running' => 'ทัวร์นาเมนต์นี้อยู่ระหว่างการดำเนินการ ตรวจสอบหน้าข้อมูลสำหรับรายละเอียดเพิ่มเติม',
        ],
    ],
    'tournament_period' => ':start ถึง :end',
];
