<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'error' => [
        'chat' => [
            'empty' => 'Нельга адпраўляць пустое паведамленне.',
            'limit_exceeded' => 'Вы адпраўляеце паведамленні надта хутка, трохі пачакайце перш, чым спрабаваць зноў.',
            'too_long' => 'Паведамленне, якое вы спрабуеце адправіць, надта доўгае.',
        ],
    ],

    'scopes' => [
        'bot' => 'Выступае ў ролі чат-бота.',
        'identify' => 'Ідэнтыфікаваць вас і глядзець ваш публічны профіль.',

        'chat' => [
            'read' => 'Чытаць паведамленні ад вашага імя.',
            'write' => 'Адпраўляйце паведамленні ад вашага імя.',
            'write_manage' => 'Далучацца да каналаў і пакідаць іх ад вашага імя.',
        ],

        'forum' => [
            'write' => 'Стварайце і рэдагуйце тэмы форума і паведамленні ад вашага імя.',
            'write_manage' => '',
        ],

        'friends' => [
            'read' => 'Бачыць, за кім вы адсочваеце.',
        ],

        'public' => 'Чытаць вашу публічную інфармацыю.',
    ],
];
