<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'play_more' => 'Можа, лепш у osu! пагуляеш?',
    'require_login' => 'Каб працягнуць, увайдзіце.',
    'require_verification' => 'Калі ласка, каб працягнуць, пацвердзіце верыфікацыю.',
    'restricted' => "Нельга рабіць гэта падчас абмежавання.",
    'silenced' => "Нельга рабіць гэта падчас зацішша.",
    'unauthorized' => 'Доступ забаронены.',

    'beatmap_discussion' => [
        'destroy' => [
            'is_hype' => 'Нельга адмяніць хайп.',
            'has_reply' => 'Нельга выдаліць абмеркаванне з адказамі',
        ],
        'nominate' => [
            'exhausted' => 'Вы дасягнулі ліміту намінацый, паспрабуйце заўтра зноў.',
            'incorrect_state' => 'Узнікла невядомая памылка, паспрабуйце перазагрузіць старонку.',
            'owner' => "Нельга намінаваць уласную карту.",
            'set_metadata' => 'Вы павінны вызначыць жанр і мову перад намінаваннем.',
        ],
        'resolve' => [
            'not_owner' => 'Толькі стваральнік тэмы і карты можа скончыць абмеркаванне.',
        ],

        'store' => [
            'mapper_note_wrong_user' => 'Толькі ўладальнік карты або намінатар/член суполкі можа размяшчаць нататкі.',
        ],

        'vote' => [
            'bot' => "Нельга прагаласаваць за дыскусію, зробленую ботам",
            'limit_exceeded' => 'Трохі пачакайце перш, чым працягнуць галасаваць далей',
            'owner' => "Нельга прагаласаваць за ўласнае абмеркаванне.",
            'wrong_beatmapset_state' => 'Магчыма толькі прагаласаваць у абмеркаваннях карт, якія разглядаюцца.',
        ],
    ],

    'beatmap_discussion_post' => [
        'destroy' => [
            'not_owner' => 'Вы можаце выдаляць толькі вашыя запісы.',
            'resolved' => 'Вы не можаце выдаліць запіс вырашанага абмеркавання.',
            'system_generated' => 'Немагчыма выдаліць аўтаматычна створаны допіс.',
        ],

        'edit' => [
            'not_owner' => 'Толькі аўтар можа рэдагаваць допіс.',
            'resolved' => 'Вы не можаце рэдагаваць запіс вырашанага абмеркавання.',
            'system_generated' => 'Немагчыма рэдагаваць аўтаматычна створаны допіс.',
        ],
    ],

    'beatmapset' => [
        'discussion_locked' => 'Гэта карта заблакавана для абмеркавання.',

        'metadata' => [
            'nominated' => 'Вы не можаце змяніць метададзеныя назначанай карты. Звярніцеся да члена BN або NAT, калі лічыце, што яны ўсталяваны няправільна.',
        ],
    ],

    'beatmap_tag' => [
        'store' => [
            'no_score' => 'Трэба згуляць гэтую карту, каб дадаць метку.',
        ],
    ],

    'chat' => [
        'blocked' => 'Нельга адправіць паведамленне карыстальніку, які заблакаваў вас або якога заблакавалі вы.',
        'friends_only' => 'Карыстальнік заблакаваў паведамленні ад людзей, якіх няма ў спісе сяброў.',
        'moderated' => 'Канал зараз мадэруецца.',
        'no_access' => 'Вы не маеце доступу да гэтага каналу.',
        'no_announce' => 'У вас не хапае праў на публікацыю рэкламы.',
        'receive_friends_only' => 'Гэты карыстальнік не можа вам адказаць, бо вы прымаеце асабістыя паведамленні толькі ад вашых сяброў.',
        'restricted' => 'Нельга адпраўляць паведамленні, калі вы ў спісе заглушаных, абмежаваных або забаненых.',
        'silenced' => 'Нельга адпраўляць паведамленні, калі вы ў спісе заглушаных, абмежаваных або забаненых.',
    ],

    'comment' => [
        'store' => [
            'disabled' => 'Каментарыі адключаныя',
        ],
        'update' => [
            'deleted' => "Нельга рэдагаваць выдалены допіс.",
        ],
    ],

    'contest' => [
        'judging_not_active' => 'Ацэньванне гэтага спаборніцтва неактыўна.',
        'voting_over' => 'Немагчыма змяніць голас пасля сканчэння перыяду галасавання.',

        'entry' => [
            'limit_reached' => 'Вы дасягнулі ліміту ўдзелаў у гэтым конкурсе',
            'over' => 'Дзякуем за ўдзел у гэтым конкурсе! Галасаванне ў хуткім часе пачнецца.',
        ],
    ],

    'forum' => [
        'moderate' => [
            'no_permission' => 'Няма дазволу на мадэрацыю гэтага форуму.',
        ],

        'post' => [
            'delete' => [
                'only_last_post' => 'Толькі апошні допіс можа быць выдалены.',
                'locked' => 'Нельга выдаліць допіс у закрытай тэме.',
                'no_forum_access' => 'Неабходны дазвол да запытанага форуму.',
                'not_owner' => 'Толькі аўтар можа выдаліць гэты допіс.',
            ],

            'edit' => [
                'deleted' => 'Нельга рэдагаваць выдалены допіс.',
                'locked' => 'Допіс абаронены ад рэдагавання.',
                'no_forum_access' => 'Неабходны дазвол да запытанага форуму.',
                'not_owner' => 'Толькі аўтар можа рэдагаваць гэты допіс.',
                'topic_locked' => 'Нельга рэдагаваць допіс у закрытай тэме.',
            ],

            'store' => [
                'play_more' => 'Паспрабуйце пагуляць у гульню, перш чым размяшчаць допісы на форумах. Калі вы маеце праблемы з гульнёй, то звярніцеся да форуму «Дапамога і падтрымка».',
                'too_many_help_posts' => "Перш чым размяшчаць дадатковыя допісы, пагуляйце ў гульню паболей. Калі вы ўсё яшчэ маеце праблемы з гульнёй, то звярніцеся на эл. пошту support@ppy.sh", // FIXME: unhardcode email address.
            ],
        ],

        'topic' => [
            'reply' => [
                'double_post' => 'Калі ласка, адрэдагуйце ваш апошні допіс замест паўторнага стварэння.',
                'locked' => 'Нельга адказваць у закрытай гутаркі.',
                'no_forum_access' => 'Неабходны дазвол да запытанага форуму.',
                'no_permission' => 'Няма дазволу для адказу.',

                'user' => [
                    'require_login' => 'Каб адказаць, увайдзіце.',
                    'restricted' => "Нельга адказваць падчас абмежавання.",
                    'silenced' => "Нельга адказваць падчас заглушэння.",
                ],
            ],

            'store' => [
                'no_forum_access' => 'Неабходны дазвол да запытанага форуму.',
                'no_permission' => 'Няма дазволу для стварэння новых тэм.',
                'forum_closed' => 'Нельга апублікоўваць, калі форум закрыты.',
            ],

            'vote' => [
                'no_forum_access' => 'Неабходны дазвол да запытанага форуму.',
                'over' => 'Апытанне завершана і больш нельга ў ёй галасаваць.',
                'play_more' => 'Вам трэба больш гульняў, каб галасаваць на форуме.',
                'voted' => 'Змяняць свой голас недазволена.',

                'user' => [
                    'require_login' => 'Увайдзіце, каб прагаласаваць.',
                    'restricted' => "Нельга галасаваць падчас абмежавання.",
                    'silenced' => "Нельга галасаваць падчас заглушэння.",
                ],
            ],

            'watch' => [
                'no_forum_access' => 'Неабходны дазвол да запытанага форуму.',
            ],
        ],

        'topic_cover' => [
            'edit' => [
                'uneditable' => 'Няправільна вызначаная вокладка.',
                'not_owner' => 'Толькі ўладальнік можа змяняць вокладку.',
            ],
            'store' => [
                'forum_not_allowed' => 'На гэтым форуме не прымаюцца вокладкі тэм.',
            ],
        ],

        'view' => [
            'admin_only' => 'Толькі адміністратар можа праглядаць гэты форум.',
        ],
    ],

    'room' => [
        'destroy' => [
            'not_owner' => 'Гэту залу можа закрыць толькі стваральнік.',
        ],
    ],

    'score' => [
        'pin' => [
            'disabled_type' => "Немагчыма замацаваць гэты тып выніку",
            'failed' => "Нельга замацаваць гэты вынік.",
            'not_owner' => 'Толькі ўладальнік выніку можа яго замацаваць.',
            'too_many' => 'Замацавана вельмі шмат вынікаў.',
        ],
    ],

    'team' => [
        'application' => [
            'store' => [
                'already_member' => "Вы ўжо далучыліся да гэтай каманды.",
                'already_other_member' => "Вы ўжо далучыліся да іншай каманды.",
                'currently_applying' => 'У вас ужо ёсць запыт далучыцца да іншай каманды.',
                'team_closed' => 'Гэтая каманда на дадзены момант не прымае запыты на ўваходжанне.',
                'team_full' => "Гэтая каманда ўжо перапоўнена і больш не можа прыняць новых удзельнікаў.",
            ],
        ],
        'part' => [
            'is_leader' => "Капітан не можа пакінуць уласную каманду.",
            'not_member' => 'Вы не з\'яўляецеся ўдзельнікам каманды.',
        ],
        'store' => [
            'require_supporter_tag' => 'каб стварыць каманду патрэбны osu!supporter tag.',
        ],
    ],

    'user' => [
        'page' => [
            'edit' => [
                'locked' => 'Старонка карыстальніка заблакаваная.',
                'not_owner' => 'Магчыма рэдагаваць толькі ўласную старонку.',
                'require_supporter_tag' => 'неабходны osu!supporter.',
            ],
        ],
        'update_email' => [
            'locked' => 'адрас электроннай пошты заблакаваны',
        ],
    ],
];
