<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'availability' => [
        'disabled' => 'Гэтая бітмапа зараз недаступна для спампоўвання.',
        'parts-removed' => 'Некаторыя часткі гэтай бітмапы былі выдалены па запыту стваральніка або праваўладальніка.',
        'more-info' => 'Для падрабязнасцей націсніце тут.',
        'rule_violation' => 'Некаторыя актывы, якія змяшчаюцца на гэтай карце, былі выдалены пасля прызнання непрыдатнымі для выкарыстання ў osu!.',
    ],

    'download' => [
        'limit_exceeded' => 'Запавольвайце, гуляйце больш.',
    ],

    'featured_artist_badge' => [
        'label' => 'Ліцэнзаваный мастак',
    ],

    'index' => [
        'title' => 'Спіс бітмап',
        'guest_title' => 'Бітмапы',
    ],

    'panel' => [
        'empty' => 'няма бітмап',

        'download' => [
            'all' => 'спампаваць',
            'video' => 'спампаваць з відэа',
            'no_video' => 'спампаваць без відэа',
            'direct' => 'адкрыць у osu!direct',
        ],
    ],

    'nominate' => [
        'hybrid_requires_modes' => 'Гібрыдная бітмапа патрабуе выбраць хаця б адзін рэжым прайгравання для намінацыі.',
        'incorrect_mode' => 'У вас няма дазволу на намінаванне на рэжым :mode',
        'full_bn_required' => 'Вы павінны быць поўным намінантам для выканання гэтай кваліфікацыйнай намінацыі.',
        'too_many' => 'Патрабаванне да намінацыі ужо выканана.',

        'dialog' => [
            'confirmation' => 'Вы сапраўды жадаеце намінаваць гэту бiтмапу?',
            'header' => 'Намінаваць бiтмапу',
            'hybrid_warning' => 'заўвага: вы можаце намінаваць толькі адзін раз, таму, калі ласка, пераканайцеся, што вы вылучаецеся для ўсіх рэжымаў гульні, якіх вы збіраецеся',
            'which_modes' => 'Намінаваць для якіх рэжымаў?',
        ],
    ],

    'nsfw_badge' => [
        'label' => '18+',
    ],

    'show' => [
        'discussion' => 'Абмеркаванне',

        'details' => [
            'by_artist' => 'ад :artist',
            'favourite' => 'Дадаць да абраных',
            'favourite_login' => 'Увайдзіце, каб дадаць бітмапу ў абраныя',
            'logged-out' => 'Каб спампаваць нейкую бітмапу, вам трэба ўвайсці!',
            'mapped_by' => 'створана :mapper',
            'unfavourite' => 'Выдаліць з абраных',
            'updated_timeago' => 'абноўлены :timeago',

            'download' => [
                '_' => 'Спампаваць',
                'direct' => '',
                'no-video' => 'без відэа',
                'video' => 'з відэа',
            ],

            'login_required' => [
                'bottom' => 'каб атрымаць доступ да іншых функцый',
                'top' => 'Увайсці',
            ],
        ],

        'details_date' => [
            'approved' => 'зацверджана :timeago',
            'loved' => 'любімая :timeago',
            'qualified' => 'кваліфікавана :timeago',
            'ranked' => 'ранкавана :timeago',
            'submitted' => 'апублікаваная :timeago',
            'updated' => 'апошняе абнаўленне :timeago',
        ],

        'favourites' => [
            'limit_reached' => 'Вы маеце зашмат абраных бітмап! Калі ласка, выдаліце некатрыя з іх і паўтарыце спробу.',
        ],

        'hype' => [
            'action' => 'Надайце хайп гэтай мапе, калі вам спадабалася гуляць у яе, і каб павялічыць ейны стан <strong>Рэйтынгу</strong>.',

            'current' => [
                '_' => 'Зараз гэтыя мапа :status.',

                'status' => [
                    'pending' => 'чакае',
                    'qualified' => 'кваліфікаваны',
                    'wip' => 'праца ў працэсе',
                ],
            ],

            'disqualify' => [
                '_' => 'Калі вы выявіце праблему з гэтай бітмапай, дыскваліфікуйце яе :link.',
            ],

            'report' => [
                '_' => 'Калі вы выявілі праблему з гэтай бітмапай, паведаміце пра гэта :link каб папярэдзіць каманду.',
                'button' => 'Паведаміць аб праблеме',
                'link' => 'тут',
            ],
        ],

        'info' => [
            'description' => 'Апісанне',
            'genre' => 'Жанр',
            'language' => 'Мова',
            'no_scores' => 'Усё яшчэ ідзе падлік даных...',
            'nsfw' => 'Непрыстойны змест',
            'points-of-failure' => 'Колькасць правалаў',
            'source' => 'Крыніца',
            'storyboard' => 'Гэта карта ўтрымлівае раскадроўку',
            'success-rate' => 'Шанц поспеху',
            'tags' => 'Тэгі',
            'video' => 'Гэта карта ўтрымлівае відэа',
        ],

        'nsfw_warning' => [
            'details' => 'Гэта карта ўтрымання змяшчае відавочны, абразлівы альбо трывожны змест. Хочаце прагледзець яго ў любым выпадку?',
            'title' => 'Непрыстойны змест',

            'buttons' => [
                'disable' => 'Адключыць папярэджанне',
                'listing' => 'Спіс бітмап',
                'show' => 'Паказаць',
            ],
        ],

        'scoreboard' => [
            'achieved' => 'дасягнуты :when',
            'country' => 'Рэйтынг па краіне',
            'error' => '',
            'friend' => 'Рэйтынг сяброў',
            'global' => 'Глабальны рэйтынг',
            'supporter-link' => 'Націсніце <a href=":link">тут</a>, каб праглядзець усе магчымасці, якія вы атрымліваеце!',
            'supporter-only' => 'Каб мець доступ да рэйтынгу краін і сяброў вам трэба быць osu!supporter',
            'title' => 'Табло',

            'headers' => [
                'accuracy' => 'Дакладнасць',
                'combo' => 'Макс. комба',
                'miss' => 'Промах',
                'mods' => 'Моды',
                'pin' => 'Замацаваць',
                'player' => 'Гулец',
                'pp' => '',
                'rank' => 'Ранг',
                'score' => 'Ачкі',
                'score_total' => 'Усяго ачкоў',
                'time' => 'Час',
            ],

            'no_scores' => [
                'country' => 'Ніхто з вашай краіны яшчэ не гуляў на гэтай мапе!',
                'friend' => 'Ніхто з вашых сяброў ячшэ не гуляў на гэтай мапе!',
                'global' => 'Ніхто яшчэ не гуляў на гэтай мапе. Можа вы паспрабуеце?',
                'loading' => 'Загрузка вынікаў...',
                'unranked' => 'Unranked бітмапа.',
            ],
            'score' => [
                'first' => 'Лідуе',
                'own' => 'Ваш рэкорд',
            ],
            'supporter_link' => [
                '_' => 'Націсніце :here тут, каб праглядзець усе магчымасці, якія вы атрымліваеце!',
                'here' => 'тут',
            ],
        ],

        'stats' => [
            'cs' => 'Памер круга',
            'cs-mania' => 'Колькасць клавіш',
            'drain' => 'Страта HP',
            'accuracy' => 'Дакладнасць',
            'ar' => 'Хуткасць набліжэння',
            'stars' => 'Складанасць',
            'total_length' => 'Працягласць',
            'bpm' => 'BPM',
            'count_circles' => 'Колькасць кругоў',
            'count_sliders' => 'Колькасць слайдараў',
            'user-rating' => 'Рэйтынг карыстальнікаў',
            'rating-spread' => 'Шкала рэйтынгу',
            'nominations' => 'Намінацыі',
            'playcount' => 'Колькасць гульняў',
        ],

        'status' => [
            'ranked' => 'Ранкавана',
            'approved' => 'Зацверджана',
            'loved' => 'Любімая',
            'qualified' => 'Кваліфікавана',
            'wip' => 'У распрацоўцы',
            'pending' => 'У чаканні',
            'graveyard' => 'Закінутая',
        ],
    ],
];
