<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'support' => [
        'convinced' => [
            'title' => 'Пераканаў цябе! :D',
            'support' => 'падтрымаць osu!',
            'gift' => 'або падараваць падтрымку іншаму гульцу',
            'instructions' => 'націсніце па кнопкі з сэрцам, каб перайсці да osu!store',
        ],
        'why-support' => [
            'title' => 'Навошта мне падтрымліваць osu!? Куда ідуць грошы?',

            'team' => [
                'title' => 'Падтрымайце каманду распрацоўкі',
                'description' => 'osu! распрацоўваецца невялікай камандай людзей. Вашая падтрымка дапаможа ім, ну, вы ведаеце... жыць.',
            ],
            'infra' => [
                'title' => 'Серверная інфраструктура',
                'description' => 'Уклад ідзе на серверы вэб-сайта, шматкарыстальніцкія паслугі, онлайн-лідэры і г. д.',
            ],
            'featured-artists' => [
                'title' => 'Ліцэнзаваныя мастакі',
                'description' => 'З вашай падтрымкай мы зможам звярнуцца да яшчэ больш дзіўных выканаўцаў і ліцэнзаваць больш выдатнай музыкі для выкарыстання ў osu!',
                'link_text' => 'Паглядзець бягучы спіс &raquo;',
            ],
            'ads' => [
                'title' => 'Трымайце osu! незалежнасць',
                'description' => 'Вашы ўклады дапамагаюць захаваць гульню незалежнай і цалкам свабоднай ад рэкламы і знешніх спонсараў.',
            ],
            'tournaments' => [
                'title' => 'Афіцыйныя турніры',
                'description' => 'Дапамажыце прафінансаваць правядзенне (і прызы) афіцыйных турніраў osu! World Cup.',
                'link_text' => 'Даследуйце турніры &raquo;',
            ],
            'bounty-program' => [
                'title' => 'Заахвочванне ўкладу ў адкрытым ПА',
                'description' => 'Падтрымайце ўдзельнікаў супольнасці, якія аддалі свой час і намаганні, каб дапамагчы зрабіць osu! лепш.',
                'link_text' => 'Даведацца больш &raquo;',
            ],
        ],
        'perks' => [
            'title' => 'Оў, і што ж я атрымаю?!',
            'osu_direct' => [
                'title' => 'osu!direct',
                'description' => 'хуткі і просты доступ да пошуку і спампоўкі бітмап, непакідая гульні.',
            ],

            'friend_ranking' => [
                'title' => 'Рэйтынг сяброў',
                'description' => "Даведайцеся, наколькі вы лепш вашых сяброў, па асобных табліцах рэкордаў для карт. Даступна як у гульні, так і на сайце.",
            ],

            'country_ranking' => [
                'title' => 'Рэйтынг краін',
                'description' => 'Заваюй сваю краіну, перш чым заваяваць свет.',
            ],

            'mod_filtering' => [
                'title' => 'Фільтр па модах',
                'description' => 'Хочаш бачыць толькі тых, хто гуляе з HRHD? Не праблема!',
            ],

            'auto_downloads' => [
                'title' => 'Аўтаспампоўка',
                'description' => 'Аўтаматычная спампоўка бітмап падчас шматкарыстальніцкай гульні, назірання за іншымі гульцамі або націскання спасылак у чаце!',
            ],

            'upload_more' => [
                'title' => 'Загрузіць больш',
                'description' => 'Дадатковыя слоты для бітмап, якія чакаюць ранкінга (да 10).',
            ],

            'early_access' => [
                'title' => 'Ранні доступ',
                'description' => 'Доступ да ранніх выпускаў гульні, дзе вы можаце пратэсціраваць новыя функцыі перш, чым яны з\'явяцца публічна!',
            ],

            'customisation' => [
                'title' => 'Індывідуальнасць',
                'description' => "Дапасуйце свой профіль, дадаўшы цалкам дапасавальную старонку карыстальніка.",
            ],

            'beatmap_filters' => [
                'title' => 'Фільтр бітмап',
                'description' => 'Фільтр бітмап шукае па мапах, на якіх гулялі або не гулялі. А таксама па атрыманых у іх рэйтынгах.',
            ],

            'yellow_fellow' => [
                'title' => 'Залатая мянушка',
                'description' => 'Будзьце пазнавальнымі ў гульні з новай ярка жоўтай мянушкай у чаце.',
            ],

            'speedy_downloads' => [
                'title' => 'Хуткія спампоўкі',
                'description' => 'Менш абмежаванняў для спампоўкі бітмап, асабліва праз osu!direct.',
            ],

            'change_username' => [
                'title' => 'Змяніць імя карыстальніка',
                'description' => 'Магчымасць змяніць імя карыстальніка без дадатковай аплаты. (толькі адзін раз)',
            ],

            'skinnables' => [
                'title' => 'Дапасаванне',
                'description' => 'Дадатковае дастасаванне ў гульні, кшталту зменнага фону меню.',
            ],

            'feature_votes' => [
                'title' => 'Галасаванне за новыя функцыі',
                'description' => 'Галасаванне за новыя функцыі. (2 голаса ў месяц)',
            ],

            'sort_options' => [
                'title' => 'Параметры сартавання',
                'description' => 'Магчымасць прагляду рэйтынгу бітмапы паміж краінамі / сябрамі / модамі ў гульні.',
            ],

            'more_favourites' => [
                'title' => 'Больш абраных бітмап',
                'description' => 'Максімальная колькасць бітмап, якія вы можаце дадаць у абранае павялічыцца з :normally &rarr; :supporter',
            ],
            'more_friends' => [
                'title' => 'Больш сяброў',
                'description' => 'Максімальная колькасць сяброў, з якімі вы можаце мець, павялічана з :normally &rarr; :supporter',
            ],
            'more_beatmaps' => [
                'title' => 'Можна выкласць яшчэ больш бітмап',
                'description' => 'Максімальную колькасць нерейтинговых карт, якое Вы можаце дадаць, пачынаецца з аднаго значэння і павялічваецца па меры таго, як Вашы карты становяцца рэйтынгавымі (да пэўнага абмежавання). Звычайна гэта 4 карты першапачаткова, плюс адна за кожную рэйтынгавую (да двух). З osu! Supporter: 8 карт першапачаткова, плюс адна за кожную рэйтынгавую (да 12).',
            ],
            'friend_filtering' => [
                'title' => 'Табліца лідэраў па сябрах',
                'description' => 'Паспаборнічае з вашымі сябрамі і даведайцеся, хто строме!',
            ],

        ],
        'supporter_status' => [
            'contribution' => 'Дзякуем за вашу падтрымку спасибо! Усяго вы ахвяравалі :dollars за :tags пакупак!',
            'gifted' => "З іх, вы падаравалі :giftedTags тэгаў (агулам падорана :giftedDollars), як шчодра!",
            'not_yet' => "Вы яшчэ не маеце тэг osu!supporter :(",
            'valid_until' => 'Ваш бягучы тэг osu!supporter дзейнічае да :date!',
            'was_valid_until' => 'Ваш тэг osu!supporter дзейнічаў да :date.',
        ],
    ],
];
