<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'beatmapset_update_notice' => [
        'new' => 'Проста паведамляю вам, што пасля вашага апошняга візіту ў ":title" быў новы адказ.',
        'subject' => 'Новае абнаўленне бітмапы «:title»',
        'unwatch' => 'Калі вы больш не хочаце глядзець за гэтай бітмапай, вы можаце альбо націснуць спасылку "Разгледзець", размешчаную на старонцы вышэй, альбо на старонцы падпісак для модынгу:',
        'visit' => 'Наведайце старонку абмеркавання тут:',
    ],

    'common' => [
        'closing' => 'З павагай,',
        'hello' => 'Прывітанне, :user,',
        'report' => 'Калі вы не запытвалі гэта змяненне, адкажыце на гэты емейл.',
        'ignore' => '',
    ],

    'donation_thanks' => [
        'benefit_more' => 'З часам з\'явіцца і больш новых пераваг для прыхільнікаў!',
        'feedback' => "Калі ў вас ёсць якія-небудзь пытанні ці водгукі, не саромейцеся адказваць на емэйл; Я звяжуся з вамі як мага хутчэй!",
        'keep_free' => 'Дзякуючы такім людзям, як вы, osu! можа падтрымліваць працу гульні і супольнасці без рэкламы і прымусовых плацяжоў.',
        'keep_running' => 'Ваша падтрымка працягвае жыццё osu! на :minutes! Гэта можа здацца не так шмат многа, але ўсё складваецца :).',
        'subject' => 'Дзякуй, osu! <3 вас',
        'translation' => 'Пераклад, прадастаўлены супольнасцю ў інфармацыйных мэтах, наступны:',

        'benefit' => [
            'gift' => 'Атрымальнік вашага падарунка цяпер будзе мець доступ да osu!direct і многім іншым прывілегіям тэга supporter.',
            'self' => 'Цяпер вы будзеце мець доступ да osu!direct і мноства іншых пераваг да :duration.',
        ],

        'support' => [
            '_' => 'Вялікі дзякуй за вашу :support да osu!.',
            'first' => 'падтрымка',
            'repeat' => 'далейшую падтрымку',
        ],
    ],

    'forum_new_reply' => [
        'new' => 'Проста паведамляю вам, што пасля вашага апошняга візіту ў ":title" быў новы адказ.',
        'subject' => '[osu!] Новы адказ у тэме «:title»',
        'unwatch' => 'Калі вы больш не хочаце глядзець за гэтай тэмай, вы можаце альбо націснуць спасылку "Адпісацца ад тэмы", якая знаходзіцца ўнізе раздзела вышэй, альбо на старонцы кіравання падпіскамі на тэмы:',
        'visit' => 'Перайдзіце да апошняга адказу, выкарыстоўваючы наступную сылку:',
    ],

    'password_reset' => [
        'code' => 'Ваш код спраўджання:',
        'requested' => 'Вы, альбо хтосьці, хто прыкідваецца вамі, запытаў скід пароля для вашага osu! рахунку.',
        'subject' => 'аднавіць уліковых запіс osu!',
    ],

    'store_payment_completed' => [
        'prepare_shipping' => 'Мы атрымалі ваш плацеж і рыхтуем ваш заказ да адпраўкі. Накіроўка можа заняць некалькі дзён, у залежнасці ад колькасці заказаў. Вы можаце сачыць за ходам вашага замовы тут, уключаючы падрабязнасці адсочвання, калі такія маюцца:',
        'processing' => 'Мы атрымалі ваш плацеж і ў цяперашні час апрацоўваем ваш заказ. Вы можаце сачыць за ходам вашага замовы тут:',
        'questions' => "Калі ў вас ёсць якія-небудзь пытанні, не саромейцеся адказваць на гэты емэйл.",
        'shipping' => 'Дастаўка',
        'subject' => 'Мы атрымалі ваш заказ у osu!store!',
        'thank_you' => 'Дзякуй за ваш заказ з osu!store!',
        'total' => 'Усяго',
    ],

    'supporter_gift' => [
        'anonymous_gift' => 'Чалавек, які падарыў вам гэты тэг, можа захаваць ананімнасць, таму ён не згадваецца ў гэтым паведамленні.',
        'anonymous_gift_maybe_not' => 'Але вы напэўна ўжо ведаеце, хто гэта;).',
        'duration' => 'Дзякуючы яму, у вас зараз ёсць доступ да osu!direct і іншым перавагам osu!supporter на: :duration.',
        'features' => 'Больш падрабязна пра гэтыя функцыі вы можаце даведацца тут:',
        'gifted' => 'Хтосьці толькі што падарыў вам osu!supporter тэг!',
        'subject' => 'Вам падаравалі osu!supporter!',
    ],

    'user_email_updated' => [
        'changed_to' => 'Гэта паведамленне па электроннай пошце, каб паведаміць, што ваш osu! адрас электроннай пошты быў зменены на: ":email".',
        'check' => 'Пераканайцеся, што вы атрымалі гэты емэйл на новы адрас, каб пазбегнуць страты доступу да osu! рахунак у будучыні.',
        'sent' => 'З меркаванняў бяспекі гэты емэйл быў адпраўлены як на ваш новы, так і на стары адрас электроннай пошты.',
        'subject' => 'Пацвярджэнне змены эл. пошты osu!',
    ],

    'user_force_reactivation' => [
        'main' => 'Падазраецца, што ваш уліковы запіс быў скампраметаваны, у ім былі нядаўна падазроныя дзеянні, альбо ВЕЛЬМІ слабы пароль. У выніку мы патрабуем ад вас усталяваць новы пароль. Пераканайцеся, што абралі БЯСПЕЧНЫ пароль.',
        'perform_reset' => 'Вы можаце выканаць скід з :url',
        'reason' => 'Прычына:',
        'subject' => 'патрабуецца паўторная актывацыя ўліковага запісу osu!',
    ],

    'user_notification_digest' => [
        'new' => 'Проста паведамляю вам, што з\'явіліся новыя абнаўленні для элементаў, якія вы назіраеце.',
        'settings' => 'Змяніць параметры апавяшчэнняў па электроннай пошце:',
        'subject' => 'Новыя апавяшчэнні osu!',
    ],

    'user_password_updated' => [
        'confirmation' => 'Гэта толькі пацверджанне таго, што ваш osu! пароль быў зменены.',
        'subject' => 'Пацвярджэнне змены паролю osu! ',
    ],

    'user_verification' => [
        'code' => 'Ваш код спраўджання:',
        'code_hint' => 'Вы можаце ўвесці код з прабеламі і без.',
        'link' => 'Акрамя таго, вы можаце перайсці па сылцы ніжэй, каб скончыць праверку:',
        'report' => 'Калі вы не запытвалі гэта, ВАДАЙТЕ АДРАЗУ, бо ваш уліковы запіс можа быць у небяспецы.',
        'subject' => 'Пацверджанне ўліковага запісу osu!',

        'action_from' => [
            '_' => 'Дзеянне, выкананае ў вашым уліковым запісе з: :country, патрабуе праверкі.',
            'unknown_country' => 'невядомая краіна',
        ],
    ],
];
