<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'cart' => [
        'checkout' => 'Завяршэнне пакупкі',
        'empty_cart' => 'Выдаліць усе тавары з кошыка',
        'info' => ':count_delimited тавар у кошыку ($:subtotal)|:count_delimited прадметы ў кошыку  ($:subtotal)',
        'more_goodies' => 'Я хачу праглядзець іншыя тавары перад завяршэннем пакупкі',
        'shipping_fees' => 'кошт дастаўкі',
        'title' => 'Кошык',
        'total' => 'усяго',

        'errors_no_checkout' => [
            'line_1' => 'Ой ой, у вас праблемы з кошыкам, якія перашкаджаюць куплі!',
            'line_2' => 'Каб працягнуць, выдаліце або абнавіць рэчы ніжэй.',
        ],

        'empty' => [
            'text' => 'Ваш кошык пусты.',
            'return_link' => [
                '_' => 'Вярніцеся да :link, каб знайсці іншыя тавары!',
                'link_text' => 'спіс крамы',
            ],
        ],
    ],

    'checkout' => [
        'cart_problems' => 'Ой-ой, праблемы з вашай карткай!',
        'cart_problems_edit' => 'Каб рэдагаваць гэта, націсніце сюды.',
        'declined' => 'Аплата была скасаваная.',
        'delayed_shipping' => 'У дадзены момант у нас шмат заказаў. Вы можаце заказваць, але помніце, што яго апрацоўка можа займаць дадатковыя 1-2 тадні.',
        'hide_from_activity' => 'Схаваць усе паведамленні аб тэгах osu!supporter з секцыі актыўнасці ў маім профілі пасля куплі',
        'old_cart' => 'Ваш кошык, здаецца, састарэў і быў перазагружаны, паспрабуйце нанова.',
        'pay' => 'Аплата праз Paypal',
        'title_compact' => 'праверыць',

        'has_pending' => [
            '_' => 'Вы маеце незавершаныя пакупкі, націсніце :link каб праглядзець іх.',
            'link_text' => 'сюды',
        ],

        'pending_checkout' => [
            'line_1' => 'Папярэдняя пакупка была пачатая, але не завершаная.',
            'line_2' => 'Каб працягнуць пакупку, выберыце спосаб аплаты.',
        ],
    ],

    'discount' => 'эканомія: :percent%',
    'free' => 'бясплатна!',

    'invoice' => [
        'contact' => 'Кантакты:',
        'date' => 'Дата:',
        'echeck_delay' => 'Так як аплата была праз eCheck, чаканне пацверджання аплаты праз Paypal можа займаць да 10 дзён!',
        'echeck_denied' => 'Аплата праз eCheck была адхіленая PayPal.',
        'hide_from_activity' => 'паведамленні аб тэгах osu!supporter пасля куплі не будуць адлюстраваны ў вашым профілі.',
        'sent_via' => 'Адпраўлена праз:',
        'shipping_to' => 'Дастаўка ў:',
        'title' => 'Да аплаты',
        'title_compact' => 'рахунак-фактура',

        'status' => [
            'cancelled' => [
                'title' => 'Ваш заказ быў адменены',
                'line_1' => [
                    '_' => "Калі вы не адмянялі заказ самастойна, калі ласка, звяжыцеся з :link, паказаўшы нумар вашага заказу (#:order_number).",
                    'link_text' => 'падтрымкай osu!store',
                ],
            ],
            'delivered' => [
                'title' => 'Ваш заказ дастаўлены! Спадзяемся, ён вам спадабаецца!',
                'line_1' => [
                    '_' => 'Калі ў вас узніклі праблемы з пакупкай, калі ласка, звяжыцеся з :link.',
                    'link_text' => 'падтрымкай osu!store',
                ],
            ],
            'prepared' => [
                'title' => 'Ваш заказ рыхтуецца да адпраўкі!',
                'line_1' => 'Калі ласка, дачакайцеся адпраўкі заказу. Інфармацыя пра адсочванне з\'явіцца тут пасля апрацоўкі заказу і адпраўкі. Гэты працэс можа заняць да 5 дзён (але звычайна менш!) у залежнасці ад нашай загружанасці.',
                'line_2' => 'Мы адпраўляем усе заказы з Японіі рознымі службамі дастаўкі ў залежнасці ад вагі і кошту.  Падрабязнасці дастаўкі з\'явяцца тут, як толькі мы адправім Ваш заказ.',
            ],
            'processing' => [
                'title' => 'Ваша аплата яшчэ не была пацверджана!',
                'line_1' => 'Калі вы ўжо аплацілі, то мы ўсё яшчэ можам чакаць пацверджання вашай куплі. Каплі ласка, абнавіць старонку праз хвіліну або дзве!',
                'line_2' => [
                    '_' => 'Калі ўзнікла праблема падчас аплаты, то :link',
                    'link_text' => 'націсніце тут, каб узнавіць аплату',
                ],
            ],
            'shipped' => [
                'title' => 'Ваш заказ адпраўлены!',
                'tracking_details' => 'Падрабязнасці адсочвання:',
                'no_tracking_details' => [
                    '_' => "У нас няма даных адсочвання, паколькі мы адправілі ваш заказ авіяпоштай, аднак вы можаце разлічваць на іх атрыманне на працягу 1-3 тыдняў. Часам мытня ў Еўропе можа затрымаць заказ па-за нашага кантролю. Калі ў вас засталіся пытанні, адкажыце на атрыманае вамі пісьмо з пацвярджэннем заказу (або :link).",
                    'link_text' => 'адпраўце нам пісьмо',
                ],
            ],
        ],
    ],

    'order' => [
        'cancel' => 'Адмяніць заказ',
        'cancel_confirm' => 'Гэты заказ будзе адменены, і аплата за яго не будзе прынята. Пастаўшчык плацяжоў можа не вызваліць рэзерваваныя сродкі адразу. Вы ўпэўнены?',
        'cancel_not_allowed' => 'Зараз гэты заказ нельга адмяніць.',
        'invoice' => 'Праглядзець рахунак',
        'no_orders' => 'Няма заказаў для паказу.',
        'paid_on' => 'Заказ размешчаны :date',
        'resume' => 'Працягнуць пакупку',
        'shipping_and_handling' => 'Дастаўка і апрацоўка',
        'shopify_expired' => 'Тэрмін дзеяння спасылкі на заказ для гэтага замовы скончыўся.',
        'subtotal' => 'Прамежкавая сума',
        'total' => 'Выніковая сума',

        'details' => [
            'order_number' => 'Заказ #',
            'payment_terms' => 'Умовы аплаты',
            'salesperson' => 'Прадавец',
            'shipping_method' => 'Спосаб дастаўкі',
            'shipping_terms' => 'Умовы дастаўкі',
            'title' => 'Склад замовы',
        ],

        'item' => [
            'quantity' => 'Колькасць',

            'display_name' => [
                'supporter_tag' => ':name для :username (:duration)',
            ],

            'subtext' => [
                'supporter_tag' => 'Паведамленне: :message',
            ],
        ],

        'not_modifiable_exception' => [
            'cancelled' => 'Вы не можаце змяніць свой заказ, так як ён быў скасаваны.',
            'checkout' => 'Вы не можаце змяніць свой заказ падчас яго апрацоўкі.', // checkout and processing should have the same message.
            'default' => 'Заказ немагчыма змяніць',
            'delivered' => 'Вы не можаце змяніць свой заказ, так як ён ужо быў дастаўлены.',
            'paid' => 'Вы не можаце змяніць свой заказ, так як ён ужо быў аплочаны.',
            'processing' => 'Вы не можаце змяніць свой заказ падчас яго апрацоўкі.',
            'shipped' => 'Вы не можаце змяніць свой заказ, так як ён ужо адпраўлены.',
        ],

        'status' => [
            'cancelled' => 'Скасавана',
            'checkout' => 'Падрыхтоўка',
            'delivered' => 'Дастаўлена',
            'paid' => 'Аплочана',
            'processing' => 'Чаканне пацвярджэння',
            'shipped' => 'У дарозе',
            'title' => 'Статус заказу',
        ],

        'thanks' => [
            'title' => 'Дзякуй за ваш заказ!',
            'line_1' => [
                '_' => 'У бліжэйшы час вы атрымаеце пісьмо з пацвярджэннем заказу. Калі ў вас засталіся пытанні, калі ласка, :link!',
                'link_text' => 'звяжыцеся з намі',
            ],
        ],
    ],

    'product' => [
        'name' => 'Назва',

        'stock' => [
            'out' => 'На дадзены момант гэтая рэч распродана. Праверце яе наяўнасць пазней!',
            'out_with_alternative' => 'На жаль, гэтай рэчы няма на складзе. Паспрабуйце іншыя параметры або праверце наяўнасць пазней!',
        ],

        'add_to_cart' => 'Дадаць да кошыку',
        'notify' => 'Апавясціць мяне, калі будзе даступна!',
        'out_of_stock' => '',

        'notification_success' => 'вы будзеце абвешчаны аб наяўнасці рэчы. націсніце :link, каб скасаваць',
        'notification_remove_text' => 'сюды',

        'notification_in_stock' => 'Гэты прадукт ўжо наяўны для продажу!',
    ],

    'supporter_tag' => [
        'gift' => 'падарунак для гульца',
        'gift_message' => 'дадайце паведамленне да вашага падарунку! (да :length знакаў)',

        'require_login' => [
            '_' => 'Вы павінны :link, каб атрымаць тэг osu!supporter!',
            'link_text' => 'увайсці',
        ],
    ],

    'username_change' => [
        'check' => 'Увядзіце імя карыстальніка, каб праверыць яго даступнасць!',
        'checking' => 'Ідзе праверка даступнасці :username...',
        'placeholder' => 'Увядзіце імя карыстальніка',
        'label' => 'Новае імя карыстальніка',
        'current' => 'Ваша сучаснае імя карыстальніка: ":username".',

        'require_login' => [
            '_' => 'Вы павінны :link, каб змяніць імя карыстальніка!',
            'link_text' => 'увайсці',
        ],
    ],

    'xsolla' => [
        'distributor' => '',
    ],
];
