<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'show' => [
        'fallback_translation' => 'Запытаная старонка яшчэ не перакладзена на выбраную мову (:language). Ідзе паказ старонкі па-англійску.',
        'incomplete_or_outdated' => 'Змесціва гэтай старонкі незавершанае або састарэлае. Калі можаце дапамагчы, калі ласка, абнавіце гэты артыкул!',
        'missing' => 'Запытаная старонка «:keyword» не знойдзена.',
        'missing_title' => 'Не знойдзена',
        'missing_translation' => 'Запытаная старонка для бягучай мовы не знойдзена.',
        'needs_cleanup_or_rewrite' => 'Гэты артыкул не адпавядае стандартам osu! wiki і мае патрэбу ў чыстцы або перапісванні. Калі Вы можаце дапамагчы, калі ласка, разгледзіце магчымасць абнавіць артыкул!',
        'search' => 'Пошук існых старонак для :link.',
        'stub' => '',
        'toc' => 'Змесціва',

        'edit' => [
            'link' => 'Паказаць на GitHub',
            'refresh' => 'Абнавіць',
        ],

        'translation' => [
            'legal' => 'Гэты пераклад даецца толькі для зручнасці. Арыгінальная версія :default з\'яўляецца адзінай юр. абавязковай версіяй тэксту.',
            'outdated' => 'Гэтая старонка змяшчае састарэлы пераклад зыходнага змесціва. Адкрыйце версію :default для атрымання дакладных звестак (і, калі можаце, дапамажыце нам з перакладам гэтай старонкі)!',

            'default' => 'Па-англійску',
        ],
    ],
];
