<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'support' => [
        'convinced' => [
            'title' => 'أنا مقتنع! D:',
            'support' => 'ادعم osu!',
            'gift' => 'او قدم الشارة للاعب اخر',
            'instructions' => 'انقر زر القلب للمضي قدما الى osu!store',
        ],
        'why-support' => [
            'title' => 'لماذا يجب ان أدعم !osu؟ إلى أين يذهب مالي؟',

            'team' => [
                'title' => 'إدعم الفريق',
                'description' => 'فريق صغير يطوّر ويُدير osu!. دعمك يساعدهم على أن، كما تعلم… يستمروا في الحياة.',
            ],
            'infra' => [
                'title' => 'بنية الخادم',
                'description' => 'المساهمات تذهب لدعم الخوادم التي تشغّل الموقع، وخدمات اللعب الجماعي، ولوحات الصدارة، وغيرها.',
            ],
            'featured-artists' => [
                'title' => 'الفنانين المميزين',
                'description' => 'بدعمك، يمكننا التواصل مع المزيد من الفنانين الرائعين والحصول على تراخيص لمزيد من الموسيقى المميزة لاستخدامها في osu!',
                'link_text' => 'عرض الجدول الحالي &raquo;',
            ],
            'ads' => [
                'title' => 'أبقِ osu! مكتفية ذاتيًا',
                'description' => 'تساعد مساهماتك في إبقاء اللعبة مستقلة ومجانية تمامًا من الإعلانات والرعاة الخارجيين.',
            ],
            'tournaments' => [
                'title' => 'المباريات الرسمية',
                'description' => 'ساعد في تمويل تشغيل بطولات كأس العالم الرسمية لـ osu! (وجوائزها).',
                'link_text' => 'تصفح المباريات &raquo;',
            ],
            'bounty-program' => [
                'title' => 'برنامج مكافأة مفتوح المصدر',
                'description' => 'ادعم مساهمي المجتمع الذين قدّموا وقتهم وجهدهم للمساعدة في جعل osu! أفضل.',
                'link_text' => 'اكتشف المزيد &raquo;',
            ],
        ],
        'perks' => [
            'title' => 'رائع! ما المزايا التي سأحصل عليها؟
',
            'osu_direct' => [
                'title' => 'osu!direct',
                'description' => 'احصل على وصول سريع وسهل للبحث عن وتنزيل خرائط الإيقاع دون الحاجة إلى مغادرة اللعبة.',
            ],

            'friend_ranking' => [
                'title' => 'ترتيب الأصدقاء',
                'description' => "تأكد كيف تبلي امام اصدقائك على جدول خريطة, على الموقع وفي اللعبة.",
            ],

            'country_ranking' => [
                'title' => 'ترتيب الدولة',
                'description' => 'قم بأحتلال دولتك قبل احتلال العالم.',
            ],

            'mod_filtering' => [
                'title' => 'فرز حسب المودات',
                'description' => 'تتعامل مع الناس الذين يلعبون HDHR فقط؟ لا مشكلة!',
            ],

            'auto_downloads' => [
                'title' => 'التنزيل التلقائي',
                'description' => 'سيتم تنزيل خرائط الإيقاع تلقائيًا في الألعاب الجماعية، وأثناء مشاهدة لاعبين آخرين، أو عند النقر على الروابط ذات الصلة في الدردشة!',
            ],

            'upload_more' => [
                'title' => 'اِرفع المزيد',
                'description' => 'خانات خرائط معلقة اضافية (لِكُل خريطة Ranked) تصل حتى 10.',
            ],

            'early_access' => [
                'title' => 'الوصول المبكر',
                'description' => 'احصل على وصول مبكر إلى الإصدارات الجديدة والميزات الجديدة قبل طرحها للعامة!<br/><br/>ويشمل ذلك أيضًا الوصول المبكر إلى الميزات الجديدة على الموقع الإلكتروني!',
            ],

            'customisation' => [
                'title' => 'التخصيص',
                'description' => "تميّز برفع صورة غلاف مخصّصة، وإنشاء قسم \"أنا!\" قابل للتخصيص بالكامل، أو حتى تغيير اللون إلى ما يناسبك داخل ملفك الشخصي.",
            ],

            'beatmap_filters' => [
                'title' => 'مرشحات الخرائط',
                'description' => 'قم بتصفية بحث الخرائط كـ ملعوبة و غير ملعوبة وكذلك الترتيب المعطى (اذا وجدت).',
            ],

            'yellow_fellow' => [
                'title' => 'الصديق الأصفر',
                'description' => 'كُن معروفاََ باِسمك المشع الاَصفر في دردشة اللعبة.',
            ],

            'speedy_downloads' => [
                'title' => 'تنزيل سريع',
                'description' => 'قيود تحميل أكثر تساهلاََ، خاصة عند استخدام osu!direct.',
            ],

            'change_username' => [
                'title' => 'تغيير اسم المستخدم',
                'description' => 'القدرة على تغيير اسمك دون تكاليف إضافية. (مرة واحدة بحد اقصى)',
            ],

            'skinnables' => [
                'title' => 'سمات اكثر',
                'description' => 'يمكنك تغيير شكل المزيد من الأغراض, مثل الخلفية في الصفحة الرئيسية للعبة.',
            ],

            'feature_votes' => [
                'title' => 'اصوات الميزات',
                'description' => 'صوت لميزات المستقبل (٢ بالشهر)',
            ],

            'sort_options' => [
                'title' => 'خيارات الترتيب',
                'description' => 'القدرة على عرض ترتيب الدولة / الصديق / تعديل معين داخل اللعبة.',
            ],

            'more_favourites' => [
                'title' => 'تفضيلات اكثر',
                'description' => 'عدد الخرائط التي تفضلها سيرتفع من :normally&rarr;:supporter',
            ],
            'more_friends' => [
                'title' => 'أصدقاء اكثر',
                'description' => 'عدد الأصدقاء الذين تمتلكهم سيرتفع من :normally&rarr;:supporter',
            ],
            'more_beatmaps' => [
                'title' => 'ارفع المزيد من الخرائط',
                'description' => 'عدد خرائط الإيقاع المعلّقة التي يمكنك امتلاكها في نفس الوقت يُحسب بناءً على قيمة أساسية بالإضافة إلى مكافأة إضافية لكل خريطة مُصنّفة لديك حاليًا (حتى حد أقصى).<br/><br/>عادةً يكون :base بالإضافة إلى :bonus لكل خريطة مُصنّفة (حتى :bonus_max). مع الدعم، يرتفع هذا إلى :supporter_base بالإضافة إلى :supporter_bonus لكل خريطة مُصنّفة (حتى :supporter_bonus_max).
',
            ],
            'friend_filtering' => [
                'title' => 'لوحة صدارة الأصدقاء',
                'description' => 'تنافس مع اصدقائك وتنبه كيف ستبلي ضدهم!<br/><br/><small>*ليس موجودا على الموقع الجديد, سيتوفر قريا(tm)</small>',
            ],

        ],
        'supporter_status' => [
            'contribution_with_duration' => 'شكرًا لدعمك المستمر! حتى الآن، لقد ساهمت بإجمالي :dollars، مما أكسبك وسام "Supporter" لمدة :duration.',
            'not_yet' => "ليس لديك شارة osu!supporter حتى الان :(",
            'valid_until' => 'شارة osu!supporter خاصتك نافذة لغاية :date!',
            'was_valid_until' => 'شارة osu!supporter خاصتك كانت نافذة لغاية :date.',

            'gifted' => [
                '_' => 'من إجمالي مساهماتك، لقد أهديت ما قيمته :dollars من الأوسمة إلى :users لمدة :duration. هذا كرمٌ مذهل للغاية!',
                'users' => ':count_delimited مستخدم آخر | :count_delimited مستخدم آخر',
            ],
        ],
    ],
];
