<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'support' => [
        'convinced' => [
            'title' => 'أنا مقتنع! D:',
            'support' => 'اِدعم osu!',
            'gift' => 'او قدم الشارة للاعب اخر',
            'instructions' => 'انقر زر القلب للمضي قدما الى osu!store',
        ],
        'why-support' => [
            'title' => 'لماذا يجب ان أدعم !osu؟ إلى أين يذهب مالي؟',

            'team' => [
                'title' => 'إدعم الفريق',
                'description' => 'يقوم فريق صغير ببرمجة و تشغيل osu!. دعمك يساعدهم على, تَعرِف... العيش.',
            ],
            'infra' => [
                'title' => 'بنية الخادم',
                'description' => 'المساهمات تقوم بالمساعدة على استمرار عمل الموقع, خدمات اللعب الجماعي, لوحات المتصدرين, إلخ.',
            ],
            'featured-artists' => [
                'title' => 'الفنانين المميزين',
                'description' => 'مع شارة الدعم خاصتك, يمكننا الوصول الى فنانين رائعين وترخيص موسيقى ممتعة اكثر لأستعمالها في osu!',
                'link_text' => 'عرض الجدول الحالي &raquo;',
            ],
            'ads' => [
                'title' => 'ابقي osu! مستقرة ذاتيا',
                'description' => 'يمكنك المشاركة في ابقاء اللعبة مستقلة ومجانية تماما من الأعلانات والرعاة الخارجيين.',
            ],
            'tournaments' => [
                'title' => 'المباريات الرسمية',
                'description' => 'ساعد بدفع تكاليف (وجائزة) مباراة كأس osu! العالمي الرسمي.',
                'link_text' => 'تصفح المباريات &raquo;',
            ],
            'bounty-program' => [
                'title' => 'برنامج مكافأة مفتوح المصدر',
                'description' => 'ادعم مشاركي المجتمع الذين اعطو وقتهم وجهدهم لمساعدة osu! لتصبح افضل.',
                'link_text' => 'اكتشف المزيد &raquo;',
            ],
        ],
        'perks' => [
            'title' => 'أوه؟ على ماذا احصُل؟!',
            'osu_direct' => [
                'title' => 'osu!direct',
                'description' => 'الوصول السريع والسهل للبحث عن الأغاني دون ترك اللعبة.',
            ],

            'friend_ranking' => [
                'title' => 'ترتيب الأصدقاء',
                'description' => "تأكد كيف تبلي امام اصدقائك على جدول خريطة, على الموقع وفي اللعبة.",
            ],

            'country_ranking' => [
                'title' => 'ترتيب الدولة',
                'description' => 'قم بأحتلال دولتك قبل احتلال العالم.',
            ],

            'mod_filtering' => [
                'title' => 'فرز بأِضافات الصعوبة',
                'description' => 'تتعامل مع الناس الذين يلعبون HDHR فقط؟ لا مشكلة!',
            ],

            'auto_downloads' => [
                'title' => 'تنزيل تلقائي',
                'description' => 'التحميل التلقائي عند اللعب المتعدد، مشاهدة الآخرين، أو النقر فوق الروابط في دردشة!',
            ],

            'upload_more' => [
                'title' => 'اِرفع المزيد',
                'description' => 'اماكن خرائط معلقة اضافية (للخرائط المصفوفة) تصل حتى ١٠.',
            ],

            'early_access' => [
                'title' => 'الوصول المبكر',
                'description' => 'الوصول إلى الإصدارات المبكرة، حيث يمكنك تجربة الميزات الجديدة قبل ان تكون عامة!',
            ],

            'customisation' => [
                'title' => 'التخصيص',
                'description' => "خصص ملفك الشخصي باِضافة خصائص متكاملة الى صفحتك الشخصية.",
            ],

            'beatmap_filters' => [
                'title' => 'مرشحات الخرائط',
                'description' => 'قم بتصفية بحث الخرائط كـ ملعوبة و غير ملعوبة وكذلك الترتيب المعطى (اذا وجدت).',
            ],

            'yellow_fellow' => [
                'title' => 'الصديق الأصفر',
                'description' => 'كُن معروفاََ باِسمك المشع الاَصفر في دردشة اللعبة.',
            ],

            'speedy_downloads' => [
                'title' => 'تنزيل سريع',
                'description' => 'قيود تحميل أكثر تساهلاََ، خاصة عند استخدام osu!direct.',
            ],

            'change_username' => [
                'title' => 'تغيير اسم المستخدم',
                'description' => 'القدرة على تغيير اسمك دون تكاليف إضافية. (مرة واحدة بحد اقصى)',
            ],

            'skinnables' => [
                'title' => 'التجليد',
                'description' => 'يمكنك تجليد المزيد من الأغراض, مثل الخلفية في الصفحة الرئيسية للعبة.',
            ],

            'feature_votes' => [
                'title' => 'اصوات الميزات',
                'description' => 'صوت لميزات المستقبل (٢ بالشهر)',
            ],

            'sort_options' => [
                'title' => 'خيارات الترتيب',
                'description' => 'القدرة على عرض ترتيب الدولة / الصديق / تعديل معين داخل اللعبة.',
            ],

            'more_favourites' => [
                'title' => 'تفضيلات اكثر',
                'description' => 'عدد الخرائط التي تفضلها سيرتفع من :normally&rarr;:supporter',
            ],
            'more_friends' => [
                'title' => 'أصدقاء اكثر',
                'description' => 'عدد الأصدقاء الذين تمتلكهم سيرتفع من :normally&rarr;:supporter',
            ],
            'more_beatmaps' => [
                'title' => 'ارفع المزيد من الخرائط',
                'description' => 'عدد الخرائط الغير-مصفوفة التي يمكن ان تملكها مرة واحدة محسوبة من القيمة الأساسية ونسبة اضافية لكل خريطة مصفوفة لديك حاليا (فوك الحد).<br/><br/>عادتاََ هذه 4 زائد 1 لكل خريطة مصفوفة (لحد 2). مع شارة الدعم, يرتفع الحد الى 8 زائد 1 لكل خريطة مصفوفة (لحد 12).',
            ],
            'friend_filtering' => [
                'title' => 'الأصدقاء المتصدرين',
                'description' => 'تنافس مع اصدقائك وتنبه كيف ستبلي ضدهم!<br/><br/><small>*ليس موجودا على الموقع الجديد, سيتوفر قريا(tm)</small>',
            ],

        ],
        'supporter_status' => [
            'contribution' => 'شكراََ لك للدعم الذي قدمتهُ حتى الان! لقد ساهمت بجموع :dollars لـ :tags اِشارات اشتريتها!',
            'gifted' => ":giftedTags من اِشاراتك التي اشتريتها قد قدمت كهدية (كمجموع :giftedDollars من الهداية التي قدمتها), كم انت كريم!",
            'not_yet' => "ليس لديك شارة osu!supporter حتى الان :(",
            'valid_until' => 'شارة osu!supporter خاصتك نافذة لغاية :date!',
            'was_valid_until' => 'شارة osu!supporter خاصتك كانت نافذة لغاية :date.',
        ],
    ],
];
