<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'beatmapset_update_notice' => [
        'new' => 'نود اِعلامَك ان هنالك تحديثاََ جديداََ للأغنية ":title" منذ اخر زيارة لك.',
        'subject' => 'تحديث جديد لـ الأغنية ":title"',
        'unwatch' => 'ان لم تكن ترغب في تتبع هذه الأغنية بعد الأن, يمكن اما ان تضغط على رابط "اِلغاء المشاهدة" في الصفحة ادناه, او من صفحة قائمة الاِقتراحات:',
        'visit' => 'عرض صفحة المناقشة هنا:',
    ],

    'common' => [
        'closing' => 'مع التحيات،',
        'hello' => 'مرحبا :user,',
        'report' => 'نرجو الرد على الرسالة فورا اذا لم تكن قد طلبت تغييرا.',
        'ignore' => '',
    ],

    'donation_thanks' => [
        'benefit_more' => 'خدمات الداعم الجديدة ستظهر قريبا مع الوقت!',
        'feedback' => "ان كانت لديك اي اسألة او مراجعات, لا تتردد في الرد على هذه الرسالة; سوف نتحقق منها في اقرب فرصة!",
        'keep_free' => 'انه بفضل الناس امثالك الذين يقومون بجعل osu! ومجتمعها قادرين على العمل بسلاسة دون اي اعلانات او دفعات اجبارية.',
        'keep_running' => 'دعمك يجعل osu! قيد العمل لحوالي لـ:minutes! قد لا يبدو رقما كبيرا, لكنه يفي بالغرض :).',
        'subject' => 'شكرا, osu! تحبك <3',
        'translation' => 'ألترجمة ألمقدمة من المجتمع المحلي لأغراض الإعلام تتبع:',

        'benefit' => [
            'gift' => 'الأن مع هديتك(هداياك) ستحصل على اذن وصول الى osu!direct والعديد من الأفضليات الأُخرى.',
            'self' => 'الأن ستحصل على اذن الوصول الى osu!direct والعديد من الأفضليات الأُخرى لـ:duration.',
        ],

        'support' => [
            '_' => 'شكرا جزيلاََ لـ:support تجاه osu!.',
            'first' => 'دَعمِك',
            'repeat' => 'دعم متواصل',
        ],
    ],

    'forum_new_reply' => [
        'new' => 'نود اِعلامَك ان هنالك رداََ جديداََ على ":title" منذ اخر زيارة لك.',
        'subject' => '[osu!] رد جديد للموضوع ":title"',
        'unwatch' => 'ان اِنتهت رغبتك في تتبع هذا الموضوع, يمكنك الضغط على اِما رابط "الغاء اشتراك الموضوع" في اسغل صفحة الموضوع, او من صفحة ادارة اِشتراكات المواضيع:',
        'visit' => 'قم بالاِنتقال الى اخر رد باستعمال الرابط ادناهُ:',
    ],

    'password_reset' => [
        'code' => 'رمز التحقق الخاص بك هو:',
        'requested' => 'أما انتَ او شخص يَدَعِ انه انت قام بطلب إعادة تعيين كلمة مرور حسابِك على !ْosu.',
        'subject' => 'اِستعادة حساب osu!',
    ],

    'store_payment_completed' => [
        'prepare_shipping' => 'لقد تلقينا دفعتك ونحن الأن نجهز طلبيتك للشحن. قد تأخذنا عدة ايام لأرسالها, اعتماداََ على كمية الطلبات. يمكنك متابعة نشاط طلبيتك هنا, مع تفاصيل المتابعة عند توفرها:',
        'processing' => 'لقد تلقينا دفعتك ونحن الأن نقوم بمعالجة طلبك. يمكنك متابعة نشاط طلبيتك من هنا:',
        'questions' => "إن كان لديك أي أسئلة, لا تترد في الرد على هذه الرسالة.",
        'shipping' => 'الشحن',
        'subject' => 'تلقينا طلب osu!store الخاص بك!',
        'thank_you' => 'شكرا لطلبك من osu!store!',
        'total' => 'المجموع',
    ],

    'supporter_gift' => [
        'anonymous_gift' => 'قد يفضل الشخص الذي وَهَبَك الهدية ان يبقى مُتخفِياََ, لذلك لم يذكروا في هذا الاِشعار.',
        'anonymous_gift_maybe_not' => 'ولكِنَك غالِباََ تَعرِفُه ;).',
        'duration' => 'بفضلِهِم, لديك وصول الى osu!direct و فوائِد osu!supporter الأخرى لمدة :duration.',
        'features' => 'يمكنك معرفة مزيد من التفاصيل عن هذهِ المميزات هنا:',
        'gifted' => 'قام احدُهٌم بهِبتِكَ شارة osu!supporter للتو!',
        'subject' => 'لقد حصلت على شارة osu!supporter كهدية!',
    ],

    'user_email_updated' => [
        'changed_to' => 'هذا البريد للتأكيد على ان بريدك الالكتروني في osu! قم تم تغييرهُ الى ":email".',
        'check' => 'نرجو قيامك بالتأكد من وصول البريد الى عنوانك الحديث لضمان عدم فقدان وصولِك الى حساب osu! في المستقبل.',
        'sent' => 'لأسباب امنية, تم ارسال البريد الى كلاََ مِن بريدك الأِلكتروني القديم و بريدك الألكتروني الحديث.',
        'subject' => 'تأكيد تغيير البريد الإلكتروني لـosu!',
    ],

    'user_force_reactivation' => [
        'main' => 'حِسابُك مُعلَم على انه مكشوف, يحوي مؤخراََ على نشاط مشبوه او كلمة مرور ضعيفة جداََ. كنتيجة, نطلب منك اِستبدال كلمة المرور. نرجو تأكدك من اختيار كلمة مرور قوية.',
        'perform_reset' => 'يمكنك طلب الأستعادة من :url',
        'reason' => 'السبب:',
        'subject' => 'حساب osu! يحتاج لأعادة تفعيل',
    ],

    'user_notification_digest' => [
        'new' => 'لمعلوماتك, يوجد تحديثات جديدة عن عناصر تتابعها.',
        'settings' => 'تغيير تفضيلات إشعار البريد الإلكتروني:',
        'subject' => 'إشعار osu! جديد',
    ],

    'user_password_updated' => [
        'confirmation' => 'هذا فقط للتأكد من ان كلمة سر حسابك في osu! قم تغيرت.',
        'subject' => 'تأكيد تغيير كلمة المرور لـosu!',
    ],

    'user_verification' => [
        'code' => 'رمز التحقق الخاص بك هو:',
        'code_hint' => 'يمكن ادخال الرمز مع\وبدون مسافات.',
        'link' => 'كبديل, يمكنك زيارة الرابط بالأسغل لأنهاء التحقق:',
        'report' => 'اذا لم تطلب هذا, نرجو الرد فورا فقد يكون حسابك في خطر.',
        'subject' => 'التحقق من حساب osu!',

        'action_from' => [
            '_' => 'طرأ على حسابك تغيير يحتاج لموافقة من :country.',
            'unknown_country' => 'بلد غير معروف',
        ],
    ],
];
