<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'beatmapset_update_notice' => [
        'new' => 'نود إعلامك بوجود تحديث جديد للخريطة ":title" منذ زيارتك الأخيرة.',
        'subject' => 'تحديث جديد لـ الأغنية ":title"',
        'unwatch' => 'إذا لم تعد ترغب في متابعة خريطة الإيقاع هذه، يمكنك إما النقر على رابط "إلغاء المتابعة" الموجود في الصفحة أعلاه، أو من صفحة قائمة المتابعة الخاصة بالتعديلات:',
        'visit' => 'عرض صفحة المناقشة هنا:',
    ],

    'common' => [
        'closing' => 'مع التحيات،',
        'hello' => 'مرحبًا :user,',
        'report' => 'يرجى الرد على هذا البريد الإلكتروني فورًا إذا لم تكن أنت من طلب هذا التغيير.',
        'ignore' => 'إذا لم تطلب هذا، يمكنك تجاهل هذا البريد الإلكتروني بأمان.',
    ],

    'donation_thanks' => [
        'benefit_more' => 'ستظهر المزيد من مزايا الداعمين الجديدة مع مرور الوقت أيضًا!',
        'feedback' => "إذا كان لديك أي أسئلة أو ملاحظات، لا تتردد في الرد على هذا البريد الإلكتروني؛ سأعود إليك في أقرب وقت ممكن!",
        'keep_free' => 'بفضل أشخاص مثلك، يستطيع osu! الحفاظ على تشغيل اللعبة والمجتمع بسلاسة دون أي إعلانات أو مدفوعات إجبارية.',
        'keep_running' => 'دعمك يساعد في استمرار تشغيل osu! لمدة حوالي :minutes! قد لا يبدو ذلك كثيرًا، لكنه يتراكم مع الوقت :).',
        'subject' => 'شكراً, osu! تحبك <3',
        'translation' => 'نُقدّم فيما يلي ترجمة تطوعية مُخصصة لأغراض معلوماتية (للاطلاع العام): ',

        'benefit' => [
            'gift' => 'سيتمكن متلقي هديتك الآن من الوصول إلى osu!direct والعديد من مزايا الداعمين الأخرى.',
            'self' => 'ستتمكن الآن من الوصول إلى osu!direct والعديد من مزايا الداعمين الأخرى لمدة :duration.',
        ],

        'support' => [
            '_' => 'شكرا جزيلاََ لـ:support تجاه osu!.',
            'first' => 'دَعمِك',
            'repeat' => 'دعم متواصل',
        ],
    ],

    'forum_new_reply' => [
        'new' => 'نود اِعلامَك ان هنالك رداََ جديداََ على ":title" منذ اخر زيارة لك.',
        'subject' => '[osu!] رد جديد للموضوع ":title"',
        'unwatch' => 'إذا لم تعد ترغب في متابعة هذا الموضوع، يمكنك إما النقر على رابط "إلغاء الاشتراك في الموضوع" الموجود أسفل الموضوع أعلاه، أو من صفحة إدارة اشتراكات المواضيع:',
        'visit' => 'انتقل مباشرة إلى أحدث رد باستخدام الرابط التالي:',
    ],

    'password_reset' => [
        'code' => 'رمز التحقق الخاص بك هو:',
        'requested' => 'إما أنك أنت أو شخص يدّعي أنه أنت قد طلب إعادة تعيين كلمة المرور لحسابك في !osu.',
        'subject' => 'استعادة حساب osu!',
    ],

    'store_payment_completed' => [
        'prepare_shipping' => 'لقد استلمنا دفعتك ونقوم حالياً بتجهيز طلبك للشحن. قد يستغرق الأمر بضعة أيام لإرساله، وذلك حسب كمية الطلبات لدينا. يمكنك متابعة حالة طلبك من هنا، بما في ذلك تفاصيل التتبع حين توفرها:',
        'processing' => 'لقد تلقّينا دفعتك ونقوم حاليًا بمعالجة طلبك. يمكنك متابعة حالة طلبك هنا:',
        'questions' => "إذا كانت لديك أي أسئلة، فلا تتردد في الرد على هذا البريد الإلكتروني.",
        'shipping' => 'الشحن',
        'subject' => 'تلقينا طلب osu!store الخاص بك!',
        'thank_you' => 'شكرا لطلبك من osu!store!',
        'total' => 'المجموع',
    ],

    'supporter_gift' => [
        'anonymous_gift' => 'قد يختار الشخص الذي أهداك هذا الوسام البقاء مجهول الهوية، ولذلك لم يتم ذكره في هذا الإشعار.',
        'anonymous_gift_maybe_not' => 'لكن من المحتمل أنك تعرف من هو بالفعل ;).',
        'duration' => 'بفضلهم، أصبح لديك وصول إلى osu!direct ومزايا الداعم الأخرى لمدة :duration القادمة.
',
        'features' => 'يمكنك معرفة مزيد من التفاصيل عن هذهِ المميزات هنا:',
        'gifted' => 'قام شخص ما بإهدائك شارة osu!supporter للتو!
',
        'gift_message' => 'لقد ترك لك الشخص الذي أهداك هذا الوسام رسالة:',
        'subject' => 'لقد حصلت على شارة osu!supporter كهدية!',
    ],

    'user_email_updated' => [
        'changed_to' => 'هذا بريد إلكتروني للتأكيد يُعلمك بأنه تم تغيير عنوان بريدك الإلكتروني في osu! إلى: ":email".',
        'check' => 'يرجى التأكد من أنك تلقيت هذا البريد الإلكتروني على عنوانك الجديد لتجنب فقدان الوصول إلى حسابك في osu! في المستقبل.',
        'sent' => 'لأسباب أمنية، تم إرسال هذه الرسالة إلى عنوان بريدك الإلكتروني الجديد والقديم معاً.',
        'subject' => 'تأكيد تغيير البريد الإلكتروني لـosu!',
    ],

    'user_force_reactivation' => [
        'main' => 'يُشتبه بأن حسابك قد تم اختراقه، أو أنه يحتوي على نشاط مشبوه حديث، أو أن كلمة المرور الخاصة به ضعيفة جدًا. ونتيجةً لذلك، نطلب منك تعيين كلمة مرور جديدة. يُرجى التأكد من اختيار كلمة مرور قوية.',
        'perform_reset' => 'يمكنك إجراء إعادة التعيين من :url',
        'reason' => 'السبب:',
        'subject' => 'إعادة تفعيل حساب osu! مطلوبة',
    ],

    'user_notification_digest' => [
        'new' => 'لإعلامك فقط، هناك تحديثات جديدة على العناصر التي تتابعها.',
        'settings' => 'تغيير تفضيلات إشعار البريد الإلكتروني:',
        'subject' => 'إشعارات جديدة في osu!',
    ],

    'user_password_updated' => [
        'confirmation' => 'هذا مجرد تأكيد على أنه قد تم تغيير كلمة مرور حسابك في osu!.',
        'subject' => 'تأكيد تغيير كلمة المرور لـosu!',
    ],

    'user_verification' => [
        'code' => 'رمز التحقق الخاص بك هو:',
        'code_hint' => 'يمكنك إدخال الرمز مع أو بدون مسافات.',
        'link' => 'بدلاً من ذلك، يمكنك زيارة الرابط أدناه لإكمال التحقق:',
        'report' => 'إذا لم تكن أنت من طلب ذلك، فيرجى الرد فوراً لأن حسابك قد يكون في خطر.',
        'subject' => 'التحقق من حساب osu!',

        'action_from' => [
            '_' => 'يتطلب إجراءٌ تم تنفيذه على حسابك من :country التحقق.',
            'unknown_country' => 'بلد غير معروف',
        ],
    ],
];
