<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'cart' => [
        'checkout' => 'إتمام الشراء',
        'empty_cart' => 'إزالة جميع العناصر من سلة التسوق',
        'info' => ':count_delimited عنصر في السلة ($:subtotal)|:count_delimited عناصر في السلة ($:subtotal)',
        'more_goodies' => 'أريد أن تحقق من المزيد من الأشياء قبل إتمام الأمر',
        'shipping_fees' => 'رسوم الشحن',
        'title' => 'عربة التسوق',
        'total' => 'المجموع',

        'errors_no_checkout' => [
            'line_1' => 'آه أوه، هناك مشاكل مع سلة التسوق الخاصة بك تمنع الدفع!',
            'line_2' => 'إزال أو حدث العناصر المذكورة أعلاه للاِستمرار.',
        ],

        'empty' => [
            'text' => 'سلة التسوق الخاصة بك فارغة.',
            'return_link' => [
                '_' => 'عُد الى :link لأيجاد بعض الأغراض الجيدة!',
                'link_text' => 'قائمة المتجر',
            ],
        ],
    ],

    'checkout' => [
        'cart_problems' => 'آه أوه، هناك مشاكل مع سلة التسوق الخاصة بك!',
        'cart_problems_edit' => 'اضغط هنا لتعديلها.',
        'declined' => 'تم إلغاء الدفع.',
        'delayed_shipping' => 'نحن حالياََ غارقون في الطلبات! انت مرحب بوضع طلبك, ولكن ارجوك انتظر **1-2 اسابيع اضافية اخرى** حتى ننتهي من الطلبات الحالية.',
        'hide_from_activity' => 'إخفاء جميع علامات osu!supporter في هذا الترتيب من نشاطي',
        'old_cart' => 'سلة التسوق الخاصة بك تبدو منتهية الصلاحية وتم اعادة شحنها, الرجاء المحاولة مجدداََ.',
        'pay' => 'الدفع بـ باي بال',
        'title_compact' => 'إتمام الشراء',

        'has_pending' => [
            '_' => 'لديك طلبات غير مكتملة, اضغط :link لعرضهم.',
            'link_text' => 'هتا',
        ],

        'pending_checkout' => [
            'line_1' => 'دفعة سابقة بدأت ولكن لم تنتهي.',
            'line_2' => 'استكمل طلبك بأختيار طريقة دفع.',
        ],
    ],

    'discount' => 'حفظ :percent%',
    'free' => 'مجاناً!',

    'invoice' => [
        'contact' => 'جهة الإتصال:',
        'date' => 'التاريخ:',
        'echeck_delay' => 'بما ان دفعتك كانت الكترونية، يرجى السماح لنا حتى 10 أيام إضافية لدفع للمرور عن طريق باي بال!',
        'echeck_denied' => '',
        'hide_from_activity' => 'إشارات osu!supporter لن تعرض بهذا الترتيب في نشاطك.',
        'sent_via' => 'ارسلت بواسطة:',
        'shipping_to' => 'تُشحن إلى:',
        'title' => 'الفاتورة',
        'title_compact' => 'الفاتورة',

        'status' => [
            'cancelled' => [
                'title' => 'تم إلغاء طلبك',
                'line_1' => [
                    '_' => "إذا لم تطلب إلغاء، يرجى الاتصال بـ :link واقتبس رقم طلبك في الرسالة (#:order_number).",
                    'link_text' => 'دعم متجر osu!',
                ],
            ],
            'delivered' => [
                'title' => 'لقد تم تسليم طلبك! نأمل أن تستمتع به!',
                'line_1' => [
                    '_' => 'إذا كان لديك أي مشاكل في عملية الشراء الخاصة بك، يرجى الاتصال بـ :link.',
                    'link_text' => 'دعم متجر osu!',
                ],
            ],
            'prepared' => [
                'title' => 'يتم إعداد طلبك!',
                'line_1' => 'الرجاء الانتظار لفترة أطول قليلاً حتى يتم شحنها. ستظهر معلومات التتبع هنا بمجرد معالجة الطلب وإرساله. هذا قد يستغرق 5 أيام (ولكن عادةً ما يكون أقل!) اعتماداً على مدى إنشغالنا.',
                'line_2' => 'نحن نرسل جميع الطلبات من اليابان باستخدام مجموعة متنوعة من خدمات الشحن حسب الوزن والقيمة. سيتم تحديث هذه المنطقة مع التفاصيل بمجرد شحن الطلب.',
            ],
            'processing' => [
                'title' => 'لم يتم تأكيد الدفع الخاص بك بعد!',
                'line_1' => 'إذا كنت قد دفعت فعلا، قد لا نزال تنتظر الحصول على تأكيد للدفع الخاص بك. الرجاء تحديث هذه الصفحة خلال دقيقة أو دقيقتين!',
                'line_2' => [
                    '_' => 'إذا واجهت مشكلة أثناء الدفع, :link',
                    'link_text' => 'انقر هنا لاِستئناف الدفع',
                ],
            ],
            'shipped' => [
                'title' => 'تم شحن طلبك!',
                'tracking_details' => 'وفيما يلي تفاصيل التعقب:',
                'no_tracking_details' => [
                    '_' => "ليس لدينا تفاصيل التتبع حيث أننا أرسلنا الحزمة الخاصة بك عبر البريد الجوي، ولكن يمكنك أن تتوقع تلقيها في غضون 1-3 أسابيع. وبالنسبة لأوروبا، يمكن للجمارك أحيانا أن تؤخر الأمر خارج نطاق سيطرتنا. إذا كان لديك أي مخاوف، يرجى الرد على بريد التأكيد الذي تلقيته :link.",
                    'link_text' => 'أرسل لنا بريد إلكتروني',
                ],
            ],
        ],
    ],

    'order' => [
        'cancel' => 'إلغاء الطلبية',
        'cancel_confirm' => 'سيتم إلغاء هذه الطلبية ولن يَتُمَ تسديد الدفُعات. قد لا يتم استرداد الدفعات على الفور, هل أنت متأكد؟',
        'cancel_not_allowed' => 'لا يمكن إلغاء هذه الطلبية حالياََ.',
        'invoice' => 'عرض الفاتورة',
        'no_orders' => 'لا طلبات للعرض.',
        'paid_on' => 'تم تعيين الطلب :date',
        'resume' => 'استئناف الدفع',
        'shipping_and_handling' => 'الشحن والتسليم',
        'shopify_expired' => 'انتهت صلاحية رابط الدفع لهذه الطلبية.',
        'subtotal' => 'حاصل الجمع',
        'total' => 'المجموع',

        'details' => [
            'order_number' => 'طلب الشراء #',
            'payment_terms' => 'شروط الدفع',
            'salesperson' => 'مندوب المبيعات',
            'shipping_method' => 'وسيلة الشحن',
            'shipping_terms' => 'شروط الشحن',
            'title' => 'تفاصيل الطلب',
        ],

        'item' => [
            'quantity' => 'الكمية',

            'display_name' => [
                'supporter_tag' => ':name لـ :username (:duration)',
            ],

            'subtext' => [
                'supporter_tag' => 'الرسالة: :message',
            ],
        ],

        'not_modifiable_exception' => [
            'cancelled' => 'لا يمكنك تعديل طلبك لأنه مُلغى.',
            'checkout' => 'لا يمكنك تعديل طلبك بينما يتم معالجته.', // checkout and processing should have the same message.
            'default' => 'الطلب غير قابل للتعديل',
            'delivered' => 'لا يمكنك تعديل طلبك لأنه تم توصيلة بالفعل.',
            'paid' => 'لا يمكنك تعديل طلبك لأنه تم الدفع له مسبقاََ.',
            'processing' => 'لا يمكنك تعديل طلبك بينما يتم معالجته.',
            'shipped' => 'لا يمكنك تعديل طلبك لأنه تم توصيلة بالفعل.',
        ],

        'status' => [
            'cancelled' => 'مُلغى',
            'checkout' => 'جاري الإعداد',
            'delivered' => 'وصلت',
            'paid' => 'دُفِعَت',
            'processing' => 'بانتظار التأكيد',
            'shipped' => 'تم الشحن',
            'title' => 'حالة الطلب',
        ],

        'thanks' => [
            'title' => 'شكرا على طلبك!',
            'line_1' => [
                '_' => 'سوف تتلقى رسالة تأكيد بالبريد الإلكتروني قريبا. إذا كان لديك أي استفسارات، يرجى :link!',
                'link_text' => 'اتصل بنا',
            ],
        ],
    ],

    'product' => [
        'name' => 'الإسم',

        'stock' => [
            'out' => 'هذا المنتج غير متوفر حالياََ. تحقق منه لاحقاََ!',
            'out_with_alternative' => 'للأسف نفذ المنتج. استعمل القائمة المنسدلة لأختيار نوع اخر او تحقق من هذا النوع لاحقاََ!',
        ],

        'add_to_cart' => 'أضف للسلة',
        'notify' => 'أرسل إشعاراً عند توفر هذا المنتج!',

        'notification_success' => 'سيتم إعلامك عندما يكون لدينا مخزون جديد. انقر فوق :link للإلغاء',
        'notification_remove_text' => 'هتا',

        'notification_in_stock' => 'هذا المنتج لم يعد متوفراََ!',
    ],

    'supporter_tag' => [
        'gift' => 'اهدِه الى لاعب',
        'gift_message' => 'أضف رسالة اختيارية إلى هديتك! (بحد اقصى :length حرفا)',

        'require_login' => [
            '_' => 'يجب ان تكون :link لتحصل على شارة osu!supporter!',
            'link_text' => 'مُسَجَل',
        ],
    ],

    'username_change' => [
        'check' => 'أدخل اسم مستخدم للتحقق من توَفُرِه!',
        'checking' => 'التحقق من توافر :username...',
        'placeholder' => 'اسم المستخدم المطلوب',
        'label' => 'اسم مستخدم جديد',
        'current' => 'اسم المستخدم الحالي الخاص بك هو ":username".',

        'require_login' => [
            '_' => 'تحتاج إلى أن تكون :link لتغيير اسمك!',
            'link_text' => 'مُسَجَل',
        ],
    ],

    'xsolla' => [
        'distributor' => '',
    ],
];
