<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'cart' => [
        'checkout' => 'Завршите куповину',
        'empty_cart' => 'Уклоните све производе из корпе',
        'info' => ':count_delimited производа у корпи ($:subtotal)|:count_delimited производа у корпи ($:subtotal)',
        'more_goodies' => 'Желим да погледам још ствари пре него што завршим куповину',
        'shipping_fees' => 'накнада за отпрему',
        'title' => 'Корпа',
        'total' => 'укупно',

        'errors_no_checkout' => [
            'line_1' => 'Нажалост постоји проблем са Вашом корпом који спречава завршавање куповине!',
            'line_2' => 'Уклоните или ажурирајте производе изнад да би сте наставили.',
        ],

        'empty' => [
            'text' => 'Ваша корпа је празна.',
            'return_link' => [
                '_' => 'Вратите се на :link да би сте нашли доступне производе!',
                'link_text' => 'листа производа',
            ],
        ],
    ],

    'checkout' => [
        'cart_problems' => 'Нажалост постоји проблем са Вашом корпом!',
        'cart_problems_edit' => 'Кликните овде да би сте изменили.',
        'declined' => 'Плаћање је отказано.',
        'delayed_shipping' => 'Тренутно имамо превише наруџбина! И даље можете поручити, али молимо Вас да очекујете **закашњење од 1-2 недеље** док не прођемо кроз све наруџбине.',
        'hide_from_activity' => 'Сакриј све ознаке osu!supporter у овом редоследу из мојих активности',
        'old_cart' => 'Изгледа да су ваша колица застарела и поново су учитана, молимо Вас да пробате поново.',
        'pay' => 'Завршите куповину преко Paypal-а',
        'title_compact' => 'завршите куповину',

        'has_pending' => [
            '_' => 'Имате куповине која нису завршене, кликните :link да би сте их погледали.',
            'link_text' => 'овде',
        ],

        'pending_checkout' => [
            'line_1' => 'Претходна куповина је започета, али није завршена.',
            'line_2' => 'Наставите са куповином тако што ћете изабрати методу плаћања.',
        ],
    ],

    'discount' => 'сачувајте :percent%',
    'free' => 'бесплатно!',

    'invoice' => [
        'contact' => 'Контакт:',
        'date' => 'Датум:',
        'echeck_delay' => 'Зато што је Ваша куповина плаћена eCheck-ом, молимо Вас да дозволите до 10 додатних дана док се куповина не потврди преко PayPal-а!',
        'echeck_denied' => 'еCheck плаћање је прихваћено од стране PayPal.',
        'hide_from_activity' => 'osu!supporter ознаке овим редоследом се не приказују у вашим недавним активностима.',
        'sent_via' => 'Пошаљи преко:',
        'shipping_to' => 'Испорука на:',
        'title' => 'Рачун',
        'title_compact' => 'рачун',

        'status' => [
            'cancelled' => [
                'title' => 'Ваша поруџбина је отказана',
                'line_1' => [
                    '_' => "Ако нисте тражили отказивање, контактирајте :link цитирајући број ваше поруџбине (#:order_number).
",
                    'link_text' => 'подршку osu!продавнице',
                ],
            ],
            'delivered' => [
                'title' => 'Ваша поруџбина је испоручена! Надамо се да ћете уживати!',
                'line_1' => [
                    '_' => 'Ако имате било каквих проблема са куповином, контактирајте :link.',
                    'link_text' => 'подршку osu!продавнице',
                ],
            ],
            'prepared' => [
                'title' => 'Ваша поруџбина је спремна!',
                'line_1' => 'Сачекајте још мало да буде испоручен. Информације о праћењу ће се појавити овде када се поруџбина обради и пошаље. Ово може потрајати до 5 дана (али обично мање!) У зависности од тога колико смо заузети.',
                'line_2' => 'Све поруџбине шаљемо из Јапана користећи различите услуге доставе у зависности од тежине и вредности. Ова област ће се ажурирати са појединостима када пошаљемо поруџбину.',
            ],
            'processing' => [
                'title' => 'Ваша куповина још увек није потврђена!',
                'line_1' => 'Ако сте већ платили, могуће је да и даље чекамо потврду Вашег плаћања. Молимо Вас да освежите страницу за минут или два!',
                'line_2' => [
                    '_' => 'Ако сте наишли на проблем у току завршавања куповине, :link',
                    'link_text' => 'кликните овде да наставите са куповином',
                ],
            ],
            'shipped' => [
                'title' => 'Наруџбина је послата!',
                'tracking_details' => 'Детаљи праћења:',
                'no_tracking_details' => [
                    '_' => "Немамо детаље о праћењу пошто смо ваш пакет послали ваздушном поштом, али можете очекивати да ћете га примити у року од 1-3 недеље. За Европу, понекад царина може да одложи наруџбу ван наше контроле. Ако имате било каквих недоумица, одговорите на поруку преко мејла са потврдом поруџбине коју сте примили (или :link).",
                    'link_text' => 'пошаљите нам имејл',
                ],
            ],
        ],
    ],

    'order' => [
        'cancel' => 'Откажи наруџбину',
        'cancel_confirm' => 'Ова наруџбина ће бити отказана и плаћање неће бити прихваћено. Провајдер плаћања можда неће одмах извршити повраћај новца. Да ли сте сигурни?',
        'cancel_not_allowed' => 'Ова наруџбина тренутно не може бити отказана.',
        'invoice' => 'Прикажи Рачун',
        'no_orders' => 'Нема наруџбина.',
        'paid_on' => 'Наруџбина извршена :date',
        'resume' => 'Наставите са куповином',
        'shipping_and_handling' => 'Достава и Руковање',
        'shopify_expired' => 'Линк за ову наруџбину је истекао.',
        'subtotal' => 'Међузбир',
        'total' => 'Укупно',

        'details' => [
            'order_number' => 'Поруџбина #',
            'payment_terms' => 'Услови Плаћања',
            'salesperson' => 'Продавац',
            'shipping_method' => 'Начин Испоруке',
            'shipping_terms' => 'Услови Испоруке',
            'title' => 'Детаљи Поруџбине',
        ],

        'item' => [
            'quantity' => 'Количина',

            'display_name' => [
                'supporter_tag' => ':name за :username (:duration)',
            ],

            'subtext' => [
                'supporter_tag' => 'Порука: :message',
            ],
        ],

        'not_modifiable_exception' => [
            'cancelled' => 'Не можете променити Вашу наруџбину зато што је отказана.',
            'checkout' => 'Не можете променити Вашу наруџбину док се процесуира.', // checkout and processing should have the same message.
            'default' => 'Наруџбина не може бити промењена',
            'delivered' => 'Не можете да промените Вашу наруџбину зато што је већ достављена.',
            'paid' => 'Не можете да промените Вашу наруџбину зато што је већ плаћена.',
            'processing' => 'Не можете променити Вашу наруџбину док се процесуира.',
            'shipped' => 'Не можете да промените Вашу наруџбину зато што је већ испоручена.',
        ],

        'status' => [
            'cancelled' => 'Отказано',
            'checkout' => 'Припрема се',
            'delivered' => 'Испоручено',
            'paid' => 'Плаћено',
            'processing' => 'Чека се потврда',
            'shipped' => 'Послато',
            'title' => 'Статус поруџбине',
        ],

        'thanks' => [
            'title' => 'Хвала вам на Вашој наруџбини!',
            'line_1' => [
                '_' => 'Ускоро ћете добити поруку преко мејла са потврдом. Ако имате било каквих питања, молимо :link!',
                'link_text' => 'контактирајте нас',
            ],
        ],
    ],

    'product' => [
        'name' => 'Име',

        'stock' => [
            'out' => 'Овај артикал тренутно није на лагеру. Проверите касније!',
            'out_with_alternative' => 'Нажалост овај артикал тренутно није на лагеру. Искористите падајући мени да изаберете другачији тип или проверите касније!',
        ],

        'add_to_cart' => 'Додај у Корпу',
        'notify' => 'Обавести ме када буде доступан/на!',

        'notification_success' => 'бићете обавештени када производ буде био на лагеру. Кликните :link да откажете ',
        'notification_remove_text' => 'овде',

        'notification_in_stock' => 'Овај производ је већ на лагеру!',
    ],

    'supporter_tag' => [
        'gift' => 'поклоните играчу',
        'gift_message' => 'додајте опционалну поруку свом поклону! (до :length знакова)',

        'require_login' => [
            '_' => 'Морате бити :link да би сте добили osu!supporter ознаку!',
            'link_text' => 'пријављени',
        ],
    ],

    'username_change' => [
        'check' => 'Укуцајте корисничко име да би сте проверили доступност!',
        'checking' => 'Проверавање доступност :username...',
        'placeholder' => 'Захтевано Корисничко Име',
        'label' => 'Ново Корисничко Име',
        'current' => 'Ваше тренутно корисничко име је ":username".',

        'require_login' => [
            '_' => 'Морате бити :link да би сте променили ваше име!',
            'link_text' => 'пријављени',
        ],
    ],

    'xsolla' => [
        'distributor' => '',
    ],
];
