<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'index' => [
        'none_running' => 'Тренутно нема активних турнира, молимо Вас проверите касније!',
        'registration_period' => 'Регистрација :start до :end',

        'header' => [
            'title' => 'Турнири заједнице',
        ],

        'item' => [
            'registered' => 'регистровани играчи',
        ],

        'state' => [
            'current' => 'Активни турнири',
            'previous' => 'Претходни турнири',
        ],
    ],

    'show' => [
        'banner' => 'Подржите Важ тим',
        'entered' => 'Ви сте регистровани за овај турнир.<br><br>Молимо да обратите пажњу да ово <b>не значи</b> да вам је додељен тим.<br><br>Даље инструкције ће бити послате преко имејла ближе датуму почетку турнира, тако да проверите да је имејл вашег osu! налога валидна!',
        'info_page' => 'Страница са информацијама',
        'login_to_register' => 'Молимо Вас да се :login да видите детаље регистрације!',
        'not_yet_entered' => 'Ви нисте регистровани за овај турнир.',
        'rank_too_low' => 'Нажалост не испуњавате рејтинг захтеве за овај турнир!',
        'registration_ends' => 'Регистрације се затварају :date',

        'button' => [
            'cancel' => 'Откажи регистрацију',
            'register' => 'Региструј ме!',
        ],

        'period' => [
            'end' => 'Крај',
            'start' => 'Старт',
        ],

        'state' => [
            'before_registration' => 'Регистрације за овај турнир нису још отворене.',
            'ended' => 'Овај турнир се завршио. Проверите страницу са информацијама за резултате.',
            'registration_closed' => 'Регистрације за овај турнир су затворене. Проверите страницу са информацијама за најновије информације.',
            'running' => 'Овај турнир је тренутно у току. Проверите страницу са информацијама за више детаља.',
        ],
    ],
    'tournament_period' => ':start до :end',
];
