<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'show' => [
        'fallback_translation' => 'Захтевна страница тренутно није преведена на изабран језик (:language). Приказаће се енглеска верзија.',
        'incomplete_or_outdated' => 'Садржај на овој страници је недовршен или застарео. Ако сте у могућности да помогнете, размотрите да ажурирате чланак!',
        'missing' => 'Захтевана страница ":keyword" није нађена.',
        'missing_title' => 'Није пронађено',
        'missing_translation' => 'Захтевана страница не може бити нађена за тренутно изабран језик.',
        'needs_cleanup_or_rewrite' => 'Ова страница не испуњава стандарде osu! википедије и треба бити очишћена или написана изнова. Ако сте у могућности да помогнете, размотрите о ажурирању чланка!',
        'search' => 'Тражите постојеће странице за :link.',
        'stub' => 'Овај чланак је недовршен и чека некога да је прошири.',
        'toc' => 'Садржаји',

        'edit' => [
            'link' => 'Погледај на GitHub',
            'refresh' => 'Освежи',
        ],

        'translation' => [
            'legal' => 'Овај превод је обезбеђен само ради погодности. Оригинал :default ће бити једина правно обавезујућа верзија овог текста.',
            'outdated' => 'Ова страница садржи застарео превог оригиналног садржаја. Молимо Вас да погледате :default за најтачније информације (и размотрите о ажурирању превода ако сте у могућности да помогнете)!',

            'default' => 'Енглеска верзија',
        ],
    ],
];
