<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'beatmapset_update_notice' => [
        'new' => 'רק מידעים אותך שהתבצע עדכון במפה ":title" מאז ביקורך האחרון.',
        'subject' => 'עדכון חדש למפה ":title"',
        'unwatch' => 'אם אינך מעוניין יותר לראות את המפה הזאת, אתה יכול ללחוץ על כפתור ה"לא לראות" הלינק נמצא בעמוד, או בשינוי רשימת המעקב שלך:',
        'visit' => 'בקר את דף הדיון כאן:',
    ],

    'common' => [
        'closing' => 'בברכה,',
        'hello' => 'היי :user',
        'report' => 'אנא הגב למייל הזה בצורה מיידית אם ביקשת את השינוי הזה.',
        'ignore' => '',
    ],

    'donation_thanks' => [
        'benefit_more' => 'ההתרונות בלהיות תורם יופיעו בנוסף עם הזמן!',
        'feedback' => "אם יש לכם שאלות או משוב, אל תתבישו לכתוב למייל הזה;mail אחזור אליכם בהקדם האפשרי!",
        'keep_free' => 'בזכות תורמים כמוך הפרויקט לא נסגר ולא מתבקש בפרסומות או הלוואות.',
        'keep_running' => 'התרומה שלך משאירה את !osu פעיל ויציב בסביבות :minutes! אולי זה לא נראה הרבה, אבל הכל עוזר לנו :).',
        'subject' => 'תודה, osu! אוהבים אותך',
        'translation' => 'התרגום מסופק על ידי שחקני הקהילה למטרות הסברה:',

        'benefit' => [
            'gift' => 'המתנות שלך רשאים להשתמש ב-osu!direct ועוד הרה יתרונות של תורמים.',
            'self' => 'עכשיו יש לך גישה ל-osu!direct ולעוד הרבה יתרונות של תורמים :duration.',
        ],

        'support' => [
            '_' => 'תודה רבה על ה:support כלפי osu!',
            'first' => 'תמיכה',
            'repeat' => 'המשך תמיכה',
        ],
    ],

    'forum_new_reply' => [
        'new' => 'רק מידעים אותך שיש תגובה חדשה ב":title" מאז הביקור האחרון שלך.',
        'subject' => '[osu!] תגובה חדשה לנושא ":title"',
        'unwatch' => 'אם אינך רוצה לראות אשכול זה יותר, אתה יכול ללחוץ על "בטל את מעקב האשכול" הנמצא בראש האשכול או באזור ניהול האשכול:',
        'visit' => 'עבור ישר לתגובה האחרונה באמצעות הקישור הזה:',
    ],

    'password_reset' => [
        'code' => 'קוד האימות שלך הוא:',
        'requested' => 'או אתם, או מישהו שמתחזה לכם, מבקש לעשות איפוס סיסמא למשתמש !osu שלכם.',
        'subject' => 'שחזור חשבון הosu!',
    ],

    'store_payment_completed' => [
        'prepare_shipping' => 'קיבלנו את התשלום שלך ומכינים את הזמנתך למשלוח. ייתכן שייקח כמה ימים עד שנשלח אותו החוצה, תלוי בכמות ההזמנות. תוכל לעקוב אחר התקדמות ההזמנה שלך כאן, כולל פרטי מעקב היכן שהם זמינים:',
        'processing' => 'קיבלנו את התשלום שלך ועובדים כעת את הזמנתך. תוכל לעקוב אחר התקדמות ההזמנה שלך כאן:',
        'questions' => "אם יש לכם שאלות, אל תהססו להגיב למייל הזה.",
        'shipping' => 'משלוח',
        'subject' => 'קיבלנו את ההזמנה שלך מ-osu!store',
        'thank_you' => 'תודה על ההזמנת בosu!store !',
        'total' => 'סך הכל',
    ],

    'supporter_gift' => [
        'anonymous_gift' => 'האדם אשר שלח לך את המתנה בחר להישאר אנונימי, אז השם שלו לא נכלל בהתראה הזו.',
        'anonymous_gift_maybe_not' => 'אבל כנראה שאתה יודע כבר מי זה ;).',
        'duration' => 'תודה לכם, עכשיו יש לך גישה ל-osu!direct ולאפשריות נוספות של תורם! ההתרונות הבאים :duration.',
        'features' => 'אתה יכול למצוא עוד פרטים על האפשרויות האלו כאן:',
        'gifted' => 'דמישהו שלח לך osu!supporter בתור מתנה!',
        'subject' => 'השלחת osu!supporter בהצלחה!',
    ],

    'user_email_updated' => [
        'changed_to' => 'זה הוא מכתב המידע אותך שכתובת המייל שלך שונתה ל::email.',
        'check' => 'אנא וודה שקיבלת הודעה זאת למייל החדש שלך למניאת אובדן משתמש ה-!osu שלך.',
        'sent' => 'מסיבות ביטחוניות, הדוא"ל הזה נשלח לשני הכתובות דוא"ל, הישנה והחדשה שלך.',
        'subject' => 'אישור שינוי דוא"ל osu!',
    ],

    'user_force_reactivation' => [
        'main' => 'יש חשד כי חשבונך נמצא בסכנה! יש בחשבונך פעילות חשודה לאחרונה או סיסמא חלשה מידי. כתוצאה מכך אנו דורשים שתגדיר סיסמה חדשה. אנא הקפד לבחור סיסמה מאובטחת.',
        'perform_reset' => 'הינך יכול לבצע את האיפוס מ:url',
        'reason' => 'סיבה:',
        'subject' => 'הפעלה מחדש של חשבון osu! נדרשת',
    ],

    'user_notification_digest' => [
        'new' => 'רק רוצים לידע כי יש עידכונים חדשים במוצרים שאתה מעוניין בהם.',
        'settings' => 'פתח העדפות הודעות דוא"ל שלי:',
        'subject' => 'התראות osu! חדשות',
    ],

    'user_password_updated' => [
        'confirmation' => 'רק מתהירים שהסיסמא למשתמש ה-!osu שלך שונתה.',
        'subject' => 'אישור איפוס סיסמת משתמש ה-!osu',
    ],

    'user_verification' => [
        'code' => 'קוד האימות שלך הוא:',
        'code_hint' => 'אפשרי לכתוב את הקוד בלי או עם רווחים.',
        'link' => 'בנוסף, תוכל להכנס לקישור למטה כדי לסיים את האימות:',
        'report' => 'אם אתם לא ביקשתם זאת, אנא הגבו במיידית למייל הזה או שהמשתמש שלכם יכול להיות בסכנה.',
        'subject' => 'אימות חשבון osu!',

        'action_from' => [
            '_' => 'פעולה שבוצעה במשתמש שלך מ:country דורשת אימות.',
            'unknown_country' => 'מיקום לא ידוע',
        ],
    ],
];
