<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'support' => [
        'convinced' => [
            'title' => 'Уверен сам! :D',
            'support' => 'подржите osu!',
            'gift' => 'или поклоните supporter другим играчима',
            'instructions' => 'кликните на срце да би сте ушли у osu!store',
        ],
        'why-support' => [
            'title' => 'Зашто да подржавам osu!? Где иде новац?
',

            'team' => [
                'title' => 'Подржите тим',
                'description' => 'Мали тим се развија и води osu!. Ваша подршка им помаже да, знате... живе.
',
            ],
            'infra' => [
                'title' => 'Серверска инфраструктура',
                'description' => 'Доприноси иду ка серверима за покретање веб странице, услугама за multiplayer, онлајн ранг листама итд.
',
            ],
            'featured-artists' => [
                'title' => 'Истакнути Уметници',
                'description' => 'Уз вашу подршку, можемо приступити још сјајнијим уметницима и лиценцирати још сјајне музике за коришћење у osu!',
                'link_text' => 'Погледајте тренутни списак &raquo;',
            ],
            'ads' => [
                'title' => 'Задржи osu! самоодрживи
',
                'description' => 'Ваши доприноси помажу да игра буде независна и потпуно ослобођена огласа и спољних спонзора.
',
            ],
            'tournaments' => [
                'title' => 'Званични Турнири',
                'description' => 'Помозите у финансирању одржавања (и награда за) званичног osu! Турнири Светског купа.',
                'link_text' => 'Истражите турнире &raquo;',
            ],
            'bounty-program' => [
                'title' => 'Open Source Bounty Program',
                'description' => 'Подржите особље заједнице које је уложило своје време и труд да помогну прављење osu! бољим.',
                'link_text' => 'Сазнајте више &raquo;',
            ],
        ],
        'perks' => [
            'title' => 'Кул! Које привилегије добијам?',
            'osu_direct' => [
                'title' => 'osu!direct',
                'description' => 'Добијте брз и лак приступ тражењу и преузимању мапа без напуштања игре.
',
            ],

            'friend_ranking' => [
                'title' => 'Ранг Пријатеља',
                'description' => "Погледајте како се борите против својих пријатеља на листинг мапа са најбољим резултатима, како у игри, тако и на веб локацији.
",
            ],

            'country_ranking' => [
                'title' => 'Државни Ранг',
                'description' => 'Освојите своју земљу пре него што освојите свет.
',
            ],

            'mod_filtering' => [
                'title' => 'Филтрирај по Модовима',
                'description' => 'Дружите се само са људима који играју HDHR? Нема проблема!
',
            ],

            'auto_downloads' => [
                'title' => 'Аутоматско Преузимање',
                'description' => 'Мапе ће се аутоматски преузимати у игрицама за више играча, док посматрате друге или када кликнете на релевантне везе у ћаскању!
',
            ],

            'upload_more' => [
                'title' => 'Отпремите Још',
                'description' => 'Додатна места за мапу на чекању (по рангираној мапи) до максимално 10.',
            ],

            'early_access' => [
                'title' => 'Рани Приступ',
                'description' => 'Добијте рани приступ новим издањима са новим функцијама пре него што постану јавне!<br/><br/>Ово укључује и рани приступ новим функцијама на веб локацији!',
            ],

            'customisation' => [
                'title' => 'Персонализација',
                'description' => "Истакните се тако што ћете отпремити прилагођену насловну слику или креирати потпуно прилагодљиво „ја!“ одељак у оквиру вашег корисничког профила.",
            ],

            'beatmap_filters' => [
                'title' => 'Филтер Мапа',
                'description' => 'Филтрирајте претраге мапа према играним и неиграним мапама, или према постигнутом рангу.
',
            ],

            'yellow_fellow' => [
                'title' => 'Жути Ортак',
                'description' => 'Будите препознатљиви у игри са својом новом светло жутом бојом корисничког имена за ћаскање.',
            ],

            'speedy_downloads' => [
                'title' => 'Брза Преузимања',
                'description' => 'Блаже ограничења преузимања, посебно када користите osu!direct.',
            ],

            'change_username' => [
                'title' => 'Промена Корисничко Имена',
                'description' => 'Једна бесплатна промена имена је укључена у вашу прву куповину подршке.',
            ],

            'skinnables' => [
                'title' => 'Додатни елементи скинова',
                'description' => 'Додатни елементи скинова у игри, попут позадине главног менија.',
            ],

            'feature_votes' => [
                'title' => '',
                'description' => '',
            ],

            'sort_options' => [
                'title' => 'Опције Сортирања',
                'description' => 'Могућност прегледа рангирања земље / пријатеља / модова у игри.',
            ],

            'more_favourites' => [
                'title' => 'Још Омиљених',
                'description' => '',
            ],
            'more_friends' => [
                'title' => 'Више Пријатеља',
                'description' => 'Максималан број пријатеља које можете имати је повећан :normally &rarr; :supporter',
            ],
            'more_beatmaps' => [
                'title' => 'Отпремите Још Мапа',
                'description' => '',
            ],
            'friend_filtering' => [
                'title' => 'Листинг Пријатеља',
                'description' => 'Такмичите се са својим пријатељима и видите како се рангирате против њих!
',
            ],

        ],
        'supporter_status' => [
            'contribution' => 'Хвала на вашој подршци! Допринели сте :dollars преко :tags ознака куповине!',
            'gifted' => "Дали сте :giftedTags ваших куповина као поклона (то вреди :giftedDollars), како великодушно!
",
            'not_yet' => "Никада нисте имали osu!supporter ознаку :(
",
            'valid_until' => 'Ваша тренутна ознака osu!supporter важи до :date!
',
            'was_valid_until' => 'Ваша ознака osu!supporter је била важећа до :date.',
        ],
    ],
];
