<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'audio' => [
        'autoplay' => 'Пустите следећу песму аутоматски',
    ],

    'defaults' => [
        'page_description' => 'osu! - Ритам је увек удаљен за *један клик*! Са Ouendan/EBA, Taiko и оригиналним модовима, као и са тотално функционалним креатором нивоа.',
    ],

    'header' => [
        'admin' => [
            'beatmapset' => 'сет мапа',
            'beatmapset_covers' => 'позадине за сет мапа',
            'contest' => 'такмичење',
            'contests' => 'такмичења',
            'root' => 'конзола',
        ],

        'artists' => [
            'index' => 'листинг',
        ],

        'beatmapsets' => [
            'show' => 'инфо',
            'discussions' => 'дискусија',
        ],

        'changelog' => [
            'index' => 'листинг',
        ],

        'help' => [
            'index' => 'индекс',
            'sitemap' => 'Sitemap',
        ],

        'store' => [
            'cart' => 'корпа',
            'orders' => 'претходне наруџбе',
            'products' => 'производи',
        ],

        'tournaments' => [
            'index' => 'листинг',
        ],

        'users' => [
            'modding' => 'модовање',
            'playlists' => 'плејлисте',
            'realtime' => 'мултиплејер',
            'show' => 'инфо',
        ],
    ],

    'gallery' => [
        'close' => 'Затвори (Esc)',
        'fullscreen' => 'Укључите/искључите цео екран',
        'zoom' => 'Увећај/умањи',
        'previous' => 'Претходно (стрелица лево)',
        'next' => 'Следеће (стрелица десно)',
    ],

    'menu' => [
        'beatmaps' => [
            '_' => 'мапе',
        ],
        'community' => [
            '_' => 'заједница',
            'dev' => 'развој',
        ],
        'help' => [
            '_' => 'помоћ',
            'getAbuse' => 'пријавите злоупотребу',
            'getFaq' => 'faq',
            'getRules' => 'правила',
            'getSupport' => 'не, стварно ми треба помоћ!',
        ],
        'home' => [
            '_' => 'почетна',
            'team' => 'тим',
        ],
        'rankings' => [
            '_' => 'рангови',
            'kudosu' => 'kudosu',
        ],
        'store' => [
            '_' => 'продавница',
        ],
    ],

    'footer' => [
        'general' => [
            '_' => 'Опште',
            'home' => 'Почетна',
            'changelog-index' => 'Списак измена',
            'beatmaps' => 'Листинг мапа',
            'download' => 'Преузмите osu!',
        ],
        'help' => [
            '_' => 'Помоћ и Заједница',
            'faq' => 'Често постављана питања',
            'forum' => 'Форуми заједнице',
            'livestreams' => 'Streams Уживо ',
            'report' => 'Пријавите проблем',
            'wiki' => 'Вики',
        ],
        'legal' => [
            '_' => 'Легално и Статус',
            'copyright' => 'Ауторска права (DMCA)',
            'privacy' => 'Приватност',
            'server_status' => 'Статус сервера',
            'source_code' => 'Изворни код',
            'terms' => 'Услови',
        ],
    ],

    'errors' => [
        '400' => [
            'error' => 'Невалидни параметар захтева',
            'description' => '',
        ],
        '404' => [
            'error' => 'Страница не постоји',
            'description' => "Извињавамо се, али страница коју сте тражили не постоји!",
        ],
        '403' => [
            'error' => "Не би сте требали да будете овде.",
            'description' => 'Можете пробати да се вратите назад, додуше.',
        ],
        '401' => [
            'error' => "Не би сте требали да будете овде.",
            'description' => 'Можете пробати да се вратите назад, додуше. Или можда да се улогујете.',
        ],
        '405' => [
            'error' => 'Страница не постоји',
            'description' => "Извињавамо се, али страница коју сте тражили не постоји!",
        ],
        '422' => [
            'error' => 'Невалидни параметар захтева',
            'description' => '',
        ],
        '429' => [
            'error' => 'Прешли сте лимит захтева',
            'description' => '',
        ],
        '500' => [
            'error' => 'Нешто се покварило! ;_;',
            'description' => "Ми смо аутоматски обавештени за сваку грешку.",
        ],
        'fatal' => [
            'error' => 'Нешто се покварило (баш се покварило)! ;_;',
            'description' => "Ми смо аутоматски обавештени за сваку грешку.",
        ],
        '503' => [
            'error' => 'Не ради због одржавања!',
            'description' => "Одржавање уобичајено траје негде између 5 секунди до 10 минута. Ако и даље не радимо након тога, посетите :link за више информација.",
            'link' => [
                'text' => '',
                'href' => '',
            ],
        ],
        // used by sentry if it returns an error
        'reference' => "За сваки случај, ево га код који можете послати подршци!",
    ],

    'popup_login' => [
        'button' => 'пријава / регистрација',

        'login' => [
            'forgot' => "Заборавио/ла сам моје детаље",
            'password' => 'лозинка',
            'title' => 'Пријавите се да наставите',
            'username' => 'корисничко име',

            'error' => [
                'email' => "Корисничко име или имејл адреса не постоји",
                'password' => 'Погрешна лозинка',
            ],
        ],

        'register' => [
            'download' => 'Преузмите',
            'info' => 'Преузмите osu! да би сте направили ваш налог!',
            'title' => "Немате налог?",
        ],
    ],

    'popup_user' => [
        'links' => [
            'account-edit' => 'Подешавања',
            'follows' => 'Листа за гледање',
            'friends' => 'Пријатељи',
            'logout' => 'Одјавите се',
            'profile' => 'Мој профил',
        ],
    ],

    'popup_search' => [
        'initial' => 'Куцајте за претрагу!',
        'retry' => 'Претрага није успела. Кликните да пробате поново.',
    ],
];
