<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'beatmapset_update_notice' => [
        'new' => 'Само вас обавештавамо да је дошло до новог ажурирања у мапи ":title" од ваше последње посете.',
        'subject' => 'Ново ажурирање мапе ":title"',
        'unwatch' => '',
        'visit' => 'Посетите страницу за дискусију овде:',
    ],

    'common' => [
        'closing' => 'Срдачан поздрав,',
        'hello' => 'Здраво :user,',
        'report' => 'Молимо одговорите на ову е-поруку ОДМАХ ако нисте тражили ову промену.',
        'ignore' => 'Ако ово нисте захтевали, можете безбедно да игноришете ову е-пошту.',
    ],

    'donation_thanks' => [
        'benefit_more' => 'Временом ће се појавити и више нових погодности за подршку!',
        'feedback' => "Ако имате било каквих питања или повратних информација, не устручавајте се да одговорите на ову поруку; Јавићу ти се што је пре могуће!",
        'keep_free' => 'Osu! је захваљујући људима попут вас! је у стању да одржава игру и заједницу без икаквих реклама или принудних плаћања.',
        'keep_running' => 'Ваша подршка држи osu! трајању око :minutes! Можда се не чини много, али све се сабира :).
',
        'subject' => 'Хвала, osu! <3 вас',
        'translation' => 'Следи превод који је обезбедила заједница у информативне сврхе:',

        'benefit' => [
            'gift' => 'Ваш поклон(и) ће сада имати приступ osu!direct-у и многим другим погодностима за подршку.',
            'self' => 'Сада ћете имати приступ osu!direct-у и многим другим погодностима за подршку током :duration.',
        ],

        'support' => [
            '_' => '',
            'first' => 'подршка',
            'repeat' => 'наставак подршке',
        ],
    ],

    'forum_new_reply' => [
        'new' => '',
        'subject' => '',
        'unwatch' => 'Ако више не желите да гледате ову тему, можете или да кликнете на везу „Откажи претплату на тему“ која се налази на дну теме изнад или на страници за управљање претплатама на теме:',
        'visit' => 'Пређите директно на најновији одговор користећи следећу везу:',
    ],

    'password_reset' => [
        'code' => 'Ваш верификациони код je:',
        'requested' => 'Или сте ви или неко ко се претвара да сте ви затражили ресетовање лозинке на вашем osu! налогу.',
        'subject' => 'osu! опоравак налога',
    ],

    'store_payment_completed' => [
        'prepare_shipping' => 'Примили смо вашу уплату и припремамо вашу поруџбину за испоруку. Може проћи неколико дана да га пошаљемо, у зависности од количине поруџбина. Овде можете пратити напредак ваше поруџбине, укључујући детаље о праћењу где су доступни:',
        'processing' => 'Примили смо вашу уплату и тренутно обрађујемо вашу поруџбину. Напредак наруџбине можете пратити овде:',
        'questions' => "Ако имате било каквих питања, не устручавајте се да одговорите на ову е-пошту.",
        'shipping' => 'Поштарина',
        'subject' => 'Примили смо вашу osu!store поруџбину!',
        'thank_you' => 'Хвала вам на osu!store наруџбини!',
        'total' => 'Укупно',
    ],

    'supporter_gift' => [
        'anonymous_gift' => 'Особа која вам је поклонила ову ознаку може одлучити да остане анонимна, тако да није поменута у овом обавештењу.',
        'anonymous_gift_maybe_not' => 'Али вероватно већ знате ко је то ;).',
        'duration' => 'Захваљујући њима, имате приступ osu!direct и другим погодностима за osu!supporter током следећег :duration.',
        'features' => 'Више детаља о овим карактеристикама можете сазнати овде:',
        'gifted' => 'Неко вам је управо поклонио osu!supporter ознаку!',
        'gift_message' => 'Особа која вам је поклонила ову ознаку вам је оставила поруку:',
        'subject' => 'Добили сте osu!supporter ознаку!',
    ],

    'user_email_updated' => [
        'changed_to' => '',
        'check' => '',
        'sent' => 'Из безбедносних разлога, ова е-порука је послата на вашу нову и стару адресу е-поште.',
        'subject' => '',
    ],

    'user_force_reactivation' => [
        'main' => '',
        'perform_reset' => 'Можете извршити ресетовање са :url',
        'reason' => 'Разлог:',
        'subject' => 'потребна је поновна активација osu! налога',
    ],

    'user_notification_digest' => [
        'new' => 'Само вас обавештавамо да је дошло до нових ажурирања о ставкама које гледате.',
        'settings' => 'Промените подешавања обавештења путем е-поште:',
        'subject' => 'Нова osu! обавештења',
    ],

    'user_password_updated' => [
        'confirmation' => 'Ово је само потврда да је osu! лозинка промењена.',
        'subject' => 'osu! потврда промене лозинке',
    ],

    'user_verification' => [
        'code' => 'Ваш верификациони код је:',
        'code_hint' => 'Можете унети код са или без размака.',
        'link' => 'Алтернативно, можете посетити и ову везу у наставку да бисте завршили верификацију:',
        'report' => 'Ако ово нисте захтевали, ОДМАХ ОДГОВОРИТЕ јер ваш налог може бити у опасности.',
        'subject' => 'osu! верификација налога',

        'action_from' => [
            '_' => 'Радња извршена на вашем налогу из :country захтева верификацију.',
            'unknown_country' => 'непозната држава',
        ],
    ],
];
