<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'box' => [
        'sent' => 'Послат је имејл на :mail са верификационим кодом. Укуцајте код.',
        'title' => 'Верификација налога',
        'verifying' => 'Проверавање...',
        'issuing' => 'Шаље се нови код...',

        'info' => [
            'check_spam' => "Немојте заборавити да погледате ваш спам фолдер ако не можете да нађете мејл.",
            'recover' => "Ако немате приступ вашем мејлу или сте заборавили који сте мејл користили, молимо Вас да пратите :link.",
            'recover_link' => 'процес повратка мејла',
            'reissue' => 'Такође можете :reissue_link или :logout_link.',
            'reissue_link' => 'захтевај нови кôд',
            'logout_link' => 'одјави се',
        ],
    ],

    'errors' => [
        'expired' => 'Верификациони код је истекао, нови верификациони мејл је послат.',
        'incorrect_key' => 'Нетачан верификациони код.',
        'retries_exceeded' => 'Нетачан верификациони код. Максимални број покушаја је искоришћен, послат је нови верификациони мејл.',
        'reissued' => 'Верификациони код је регенерисан, нови верификациони мејл је послат.',
        'unknown' => 'Десио се непознати проблем, послат је нови верификациони мејл.',
    ],
];
