<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'show' => [
        'fallback_translation' => 'Бұл бет сіз таңдаған тілге (:language) әлі аударылмады, сондықтан сіз оның Ағылшынша нұсқасын көріп тұрсыз.',
        'incomplete_or_outdated' => 'Бұл беттің мазмұны ескірген немесе толық емес болып табылады. Көмектесе алсаңыз - өтініш, бұл мақаланы жаңартыңызшы!',
        'missing' => '":keyword" сұралған беті табылмады.',
        'missing_title' => 'Табылмады',
        'missing_translation' => 'Қазір таңдаулы тілге сәйкес сұралған бет табылмады.',
        'needs_cleanup_or_rewrite' => 'Бұл бет osu! wiki стандарттарына келмейді, сондықтан оны дұрыстау немесе қайта жазу керек. Көмектесе алсаңыз - өтініш, бұл мақаланы жаңартыңызшы!',
        'search' => 'Бар :link беттерін іздеу.',
        'stub' => 'Бұл мақала әлі бітпеген және жазып бітіруге мұқтаж болуда.',
        'toc' => 'Мазмұны',

        'edit' => [
            'link' => 'GitHub-та көрсету',
            'refresh' => 'Жаңалау',
        ],

        'translation' => [
            'legal' => 'Бұл аударма тек ыңғайлылық үшін берілген. Түпнұсқа :default жалғыз заңды бекітілген нұсқа болып табылады.',
            'outdated' => 'Бұл беттің аудармасы ескірген. Өтініш, дәлме-дәл ақпарат үшін :defaultн көріңіз (және егер көмектесе алсаңыз аударманы жаңартыңызшы)!',

            'default' => 'Ағылшынша нұсқасы',
        ],
    ],
];
