<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'index' => [
        'none_running' => 'На данный момент не проходит никаких турниров, пожалуйста, загляните позже!',
        'registration_period' => 'Регистрация: с :start до :end',

        'header' => [
            'title' => 'Турниры сообщества',
        ],

        'item' => [
            'registered' => 'Зарегистрированные игроки',
        ],

        'state' => [
            'current' => 'Активные турниры',
            'previous' => 'Прошедшие турниры',
        ],
    ],

    'show' => [
        'banner' => 'Поддержите свою команду',
        'entered' => 'Вы зарегистрированы на этот турнир.<br><br>Обратите внимание: это не значит что вас назначили в команду.<br><br>Дальнейшие инструкции будут отправлены на вашу почту, ближе к дате турнира, поэтому пожалуйста, проверьте, действительна ли почта, к которой привязан ваш osu! аккаунт!',
        'info_page' => 'Подробная статья',
        'login_to_register' => 'Пожалуйста :login чтобы видеть больше информации о турнире!',
        'not_yet_entered' => 'Вы не зарегистрированы на этом турнире.',
        'rank_too_low' => 'Извините, но Вы не подходите по рейтинговым требованиям для данного турнира!',
        'registration_ends' => 'Регистрация закрывается :date',

        'button' => [
            'cancel' => 'Отменить регистрацию',
            'register' => 'Запишите меня!',
        ],

        'period' => [
            'end' => 'Окончание',
            'start' => 'Начало',
        ],

        'state' => [
            'before_registration' => 'Регистрация на этот турнир ещё не открыта.',
            'ended' => 'Этот турнир завершён. Проверьте страницу с информацией для просмотра результатов.',
            'registration_closed' => 'Регистрация на этот турнир закрыта. Откройте информационную страницу для просмотра последних изменений.',
            'running' => 'Этот турнир уже проводится. Откройте информационную страницу для просмотра последних изменений.',
        ],
    ],
    'tournament_period' => ':start до :end',
];
