<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'create' => [
        'finish' => 'Завершить',
        'key' => 'Отсканируйте QR-код в приложении для аутентификации и введите здесь одноразовый пароль',
        'key_copy' => 'Или нажмите на эту ссылку, чтобы скопировать секретный ключ к приложению для аутентификации',
        'key_link' => 'Воспользуйтесь этой ссылкой, если вы находитесь на этой странице с мобильного устройства',
        'password' => 'Чтобы настроить приложение для аутентификации, введите ваш текущий пароль',
        'start' => 'Продолжить',
    ],

    'destroy' => [
        'missing' => 'У вас ещё нет настроенного приложения для аутентификации.',
        'ok' => 'Приложение для аутентификации удалено.',
    ],

    'edit' => [
        'password' => 'Чтобы удалить приложение для аутентификации, введите ваш текущий пароль.',
        'start' => 'Удалить',
    ],

    'store' => [
        'existing' => 'Вы уже настроили приложение для аутентификации.',
        'ok' => 'Приложение для аутентификации успешно настроено',
        'restart' => 'Произошла ошибка. Пожалуйста, начните процесс настройки заново.',
    ],
];
