<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'show' => [
        'fallback_translation' => 'Эта страница не переведена на русский язык, поэтому вы смотрите исходный вариант на английском.',
        'incomplete_or_outdated' => 'Содержимое этой страницы является неполным или устаревшим, но вы всегда сможете помочь нам дополнить его!',
        'missing' => 'Вы хотели открыть страницу ":keyword", но её в базе знаний нет. Может она существовала раньше, но сейчас здесь ничего нет.',
        'missing_title' => 'Здесь пусто',
        'missing_translation' => 'Запрашиваемая страница не найдена для этого языка.',
        'needs_cleanup_or_rewrite' => 'Эта статья не соответствует стандартам osu! wiki и нуждается в чистке или переписывании. Если Вы можете помочь, пожалуйста, рассмотрите возможность обновить статью!',
        'search' => 'Найти существующие страницы для :link.',
        'toc' => 'Содержание',

        'edit' => [
            'link' => 'Показать на GitHub',
            'refresh' => 'Обновить',
        ],

        'translation' => [
            'legal' => 'Этот вариант перевода предоставлен для вашего удобства. Единственным и юридически действительным вариантом является оригинал :default.',
            'outdated' => 'Предоставленный ниже вариант перевода устарел. Откройте исходную страницу :default для просмотра актуальной информации (а ещё вы можете помочь нам перевести эту страницу)!',

            'default' => 'на английском языке',
        ],
    ],
];
