<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'show' => [
        'fallback_translation' => 'Эта страница не переведена на :language язык, поэтому вы видите версию на английском.',
        'incomplete_or_outdated' => 'Содержимое этой страницы является неполным или устаревшим, но вы всегда сможете помочь нам дополнить его!',
        'missing' => 'Запрашиваемая страница ":keyword" не найдена.',
        'missing_title' => 'Не найдено',
        'missing_translation' => 'Запрашиваемая страница для выбранного языка не найдена.',
        'needs_cleanup_or_rewrite' => 'Эта статья не соответствует стандартам osu! wiki и нуждается в чистке или переписывании. Если Вы можете помочь, пожалуйста, рассмотрите возможность обновить статью!',
        'search' => 'Найти существующие страницы для :link.',
        'toc' => 'Содержание',

        'edit' => [
            'link' => 'Показать на GitHub',
            'refresh' => 'Обновить',
        ],

        'translation' => [
            'legal' => 'Этот вариант перевода предоставлен для вашего удобства. Единственным и юридически действительным вариантом является оригинал :default.',
            'outdated' => 'Перевод содержимого этой страницы уже устарел. Откройте версию на :default для получения свежей информации (и помогите, пожалуйста, обновить перевод)!
',

            'default' => 'на английском языке',
        ],
    ],
];
