<?php

/**
 *    Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
 *    See the LICENCE file in the repository root for full licence text.
 */

return [
    'show' => [
        'fallback_translation' => 'Запрашиваемая страница не переведена на русский язык. Показывается версия на английском.',
        'incomplete_or_outdated' => 'Эта страница не закончена или устарела. Если можете помочь, пожалуйста, обновите эту статью!',
        'missing' => 'Запрашиваемая страница ":keyword" не найдена.',
        'missing_title' => 'Не найдено',
        'missing_translation' => 'Запрашиваемая страница не найдена для этого языка.',
        'search' => 'Найти существующие страницы для :link.',
        'toc' => 'Содержимое',

        'edit' => [
            'link' => 'Показать на GitHub',
            'refresh' => 'Обновить',
        ],

        'translation' => [
            'legal' => 'Этот перевод предоставляется только для удобства. Оригинальная версия :default является единственной юридически обязательной версией этого текста.',
            'outdated' => 'Эта страница содержит устаревший перевод исходного контента. Откройте версию :default для получения свежей информации (и, если можете, помогите нам с переводом этой страницы)!',

            'default' => 'на английском языке',
        ],
    ],
    'main' => [
        'title' => 'База знаний',
        'subtitle' => 'потому что osu!педия звучит глупо',
    ],
];
