<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'show' => [
        'fallback_translation' => 'Эта статья пока ещё не переведена на :language язык, поэтому вы видите версию на английском.',
        'incomplete_or_outdated' => 'Сведения в этой статье неполны или уже устарели. Если вы можете помочь, пожалуйста, обновите её!',
        'missing' => 'Запрашиваемая статья ":keyword" не найдена.',
        'missing_title' => 'Статья не найдена',
        'missing_translation' => 'Статья не переведена на выбранный язык.',
        'needs_cleanup_or_rewrite' => 'Эта статья не соответствует стандартам osu! wiki и нуждается в доработке или переписывании. Если вы можете помочь, пожалуйста, обновите её!',
        'search' => 'Поищите :link в существующих статьях.',
        'stub' => 'Эта статья не завершена и нуждается в дописывании.',
        'toc' => 'Содержание',

        'edit' => [
            'link' => 'Открыть на GitHub',
            'refresh' => 'Обновить',
        ],

        'translation' => [
            'legal' => 'Этот перевод предоставлен для вашего удобства. Единственным и юридически действительным вариантом является оригинал :default.',
            'outdated' => 'Этот перевод устарел. Откройте статью :default, чтобы увидеть актуальные сведения (и помогите, пожалуйста, обновить перевод)!',

            'default' => 'на английском языке',
        ],
    ],
];
