<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'show' => [
        'fallback_translation' => 'Эта статья пока ещё не переведена на :language язык, поэтому Вы видите версию на английском.',
        'incomplete_or_outdated' => 'Содержимое этой страницы является неполным или устаревшим. Если Вы можете помочь - пожалуйста, обновите статью!',
        'missing' => 'Запрашиваемая статья ":keyword" не найдена.',
        'missing_title' => 'Не найдено',
        'missing_translation' => 'Запрашиваемая статья для выбранного языка не найдена.',
        'needs_cleanup_or_rewrite' => 'Эта статья не соответствует стандартам osu!wiki и нуждается в очистке или переписывании. Если Вы можете помочь - пожалуйста, обновите статью!',
        'search' => 'Вы можете поискать похожие статьи, кликнув на запрос :link.',
        'stub' => 'Эта статья неполна и нуждается в дополнении.',
        'toc' => 'Содержание',

        'edit' => [
            'link' => 'Открыть на GitHub',
            'refresh' => 'Обновить',
        ],

        'translation' => [
            'legal' => 'Этот вариант перевода предоставлен для вашего удобства. Единственным и юридически действительным вариантом является оригинал :default.',
            'outdated' => 'Эта страница содержит устаревший перевод оригинального содержимого. Откройте версию :default для уточнения информации (и помогите, пожалуйста, обновить перевод)!',

            'default' => 'на английском языке',
        ],
    ],
];
