<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'page_description' => 'Обрані виконавці osu!',
    'title' => 'Обрані виконавці',

    'admin' => [
        'hidden' => 'ВИКОНАВЕЦЬ ЗАРАЗ ПРИХОВАНИЙ',
    ],

    'beatmaps' => [
        '_' => 'Карти',
        'download' => 'Завантажити шаблон карти',
        'download-na' => 'Шаблон карти поки недоступний',
    ],

    'index' => [
        'description' => 'Обрані виконавці - це наша програма в osu!, за якою ми співпрацюємо з виконавцями, щоб наповнити osu! новою і оригінальною музикою. Ці виконавці і їх композиції були ретельно підібрані командою osu! як найбільш відповідні для створення карт. Деякі з представлених виконавців присвятили грі osu! ексклюзивні композиції. <br> <br> До всіх композицій у цій секції додається .osz файл з уже заданими таймінгами. Всі композиції були офіційно ліцензовані для використання в osu! і пов\'язаних проектах.',
    ],

    'links' => [
        'beatmaps' => 'osu! бітмапи',
        'osu' => 'профіль osu!',
        'site' => 'Офіційний веб-сайт',
    ],

    'songs' => [
        '_' => 'Пісні',
        'count' => ':count|пісня:count пісні',
        'original' => 'osu! оригінал',
        'original_badge' => 'ОРИГІНАЛ',
    ],

    'tracklist' => [
        'title' => 'назва',
        'length' => 'довжина',
        'bpm' => 'bpm',
        'genre' => 'жанр',
    ],

    'tracks' => [
        'index' => [
            '_' => 'пошук треків',

            'form' => [
                'advanced' => 'Розширений пошук ',
                'album' => 'Альбом ',
                'artist' => 'Артист ',
                'bpm_gte' => 'BPM Мінімум ',
                'bpm_lte' => 'BPM Максимум',
                'empty' => 'Немає жодного треку в заданому критерію. ',
                'genre' => 'Жанр ',
                'genre_all' => 'Всі ',
                'length_gte' => 'Мінімальна довжина ',
                'length_lte' => 'Максимальна довжина ',
            ],
        ],
    ],
];
