<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'page_description' => 'Вибрані виконавці osu!',
    'title' => 'Вибрані виконавці',

    'admin' => [
        'hidden' => 'ВИКОНАВЕЦЬ ЗАРАЗ ПРИХОВАНИЙ',
    ],

    'beatmaps' => [
        '_' => 'Карти',
        'download' => 'Завантажити шаблон карти',
        'download-na' => 'Шаблон карти поки недоступний',
    ],

    'index' => [
        'description' => 'Вибрані виконавці - це наша програма в osu!, за якою ми співпрацюємо з виконавцями, щоб наповнити osu! новою і оригінальною музикою. Ці виконавці і їх композиції були ретельно підібрані командою osu! як найбільш підходящі для створення карт. Деякі з представлених виконавців присвятили для osu! ексклюзивні композиції. <br> <br> До всіх композицій у цій секції додається .osz файл з уже заданими таймінгами. Всі композиції були офіційно ліцензовані для використання в osu! і пов\'язаних проектах.',
    ],

    'links' => [
        'osu' => 'профіль osu!',
        'site' => 'Офіційний веб-сайт',
    ],

    'songs' => [
        '_' => 'Пісні',
        'count' => ':count|пісня:count пісні',
        'exclusive' => 'osu! ексклюзив',
    ],

    'tracklist' => [
        'title' => 'назва',
        'length' => 'довжина',
        'bpm' => 'bpm',
        'genre' => 'жанр',
    ],
];
