<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'play_more' => 'Може краще пограємо osu?',
    'require_login' => 'Увійдіть, щоб продовжити.',
    'require_verification' => 'Будь ласка, пройдіть перевірку для продовження.',
    'restricted' => "Не можна це робити поки ваші права обмежені.",
    'silenced' => "Не можна робити це поки ви заглушені.",
    'unauthorized' => 'Доступ заборонено.',

    'beatmap_discussion' => [
        'destroy' => [
            'is_hype' => 'Не можна відмінити хайп.',
            'has_reply' => 'Не можна видалити дискусію з відповідями',
        ],
        'nominate' => [
            'exhausted' => 'Ви вичерпали ліміт номінацій за день, спробуйте завтра.',
            'incorrect_state' => 'Помилка під час виконання цієї дії, спробуйте оновити сторінку.',
            'owner' => "Неможливо номінувати власну ж карту.",
            'set_metadata' => 'Ви повинні вказати жанр та мову перед номінацією.',
        ],
        'resolve' => [
            'not_owner' => 'Тільки автор теми та власник карти має дозвіл завершити обговорення.',
        ],

        'store' => [
            'mapper_note_wrong_user' => 'Лише власник карти або номінатор/член групи NAT може залишати замітки для мапперів.',
        ],

        'vote' => [
            'bot' => "Неможливо проголосувати за обговорення, створене ботом",
            'limit_exceeded' => 'Будь ласка, зачекайте деякий час перед повторним голосуванням',
            'owner' => "Не можна голосувати у власному обговоренні.",
            'wrong_beatmapset_state' => 'Голосувати можна лише в обговореннях очікуючих карт.',
        ],
    ],

    'beatmap_discussion_post' => [
        'destroy' => [
            'not_owner' => 'Тільки ви можете видаляти свої пости.',
            'resolved' => 'Ви не можете видаляти пости в вирішених обговореннях.',
            'system_generated' => 'Автоматично згенеровані пости не можуть бути видалені.',
        ],

        'edit' => [
            'not_owner' => 'Тільки автор може редагувати публікацію.',
            'resolved' => 'Ви не можете редагувати пости в вирішених обговореннях.',
            'system_generated' => 'Неможливо редагувати автоматично згенеровану публікацію.',
        ],
    ],

    'beatmapset' => [
        'discussion_locked' => 'Ця мапа закрита для обговорень.',

        'metadata' => [
            'nominated' => 'Ви не можете змінювати метадані номінованій карті. Зв\'яжіться з членом BN або NAT, якщо ви думаєте, що вони вказані невірно.',
        ],
    ],

    'chat' => [
        'annnonce_only' => 'Цей канал лише для оголошень.',
        'blocked' => 'Неможливо надіслати повідомлення користувачу, який заблокував вас або якого заблокували ви.',
        'friends_only' => 'Користувач заблокував повідомлення від користувачів не зі списку друзів.',
        'moderated' => 'Наразі канал модерується.',
        'no_access' => 'У вас немає доступу до цього каналу.',
        'receive_friends_only' => 'Цей користувач не зможе відповісти, оскільки ви приймаєте повідомлення лише від людей з вашого списку друзів.',
        'restricted' => 'Ви не можете надсилати повідомлення коли ви заглушені, обмежені або заблоковані.',
        'silenced' => 'Ви не можете надсилати повідомлення, коли заглушені, обмежені або заблоковані.',
    ],

    'comment' => [
        'store' => [
            'disabled' => 'Коментарі відключені',
        ],
        'update' => [
            'deleted' => "Неможливо редагувати видалену публікацію.",
        ],
    ],

    'contest' => [
        'voting_over' => 'Ви не можете змінити свій вибір після закінчення періоду голосування.',

        'entry' => [
            'limit_reached' => 'Ви вичерпали кількість заявок для цього конкурсу',
            'over' => 'Дякуємо за ваші заявки на участь в цьому конкурсі! Заявки більше не приймаються і голосування розпочнеться найближчим часом.',
        ],
    ],

    'forum' => [
        'moderate' => [
            'no_permission' => 'Недостатньо прав для модерації цього форуму.',
        ],

        'post' => [
            'delete' => [
                'only_last_post' => 'Лише остання публікація може бути видалена.',
                'locked' => 'Неможливо видалити публікацію в закритій темі.',
                'no_forum_access' => 'Потрібний доступ до запитаного форуму.',
                'not_owner' => 'Тільки автор може видалити пост.',
            ],

            'edit' => [
                'deleted' => 'Неможливо редагувати видалену публікацію.',
                'locked' => 'Пост заблоковано для редагування.',
                'no_forum_access' => 'Необхідний доступ до запитуваного форуму.',
                'not_owner' => 'Тільки автор може редагувати дану публікацію.',
                'topic_locked' => 'Неможливо редагувати публікацію в заблокованій темі.',
            ],

            'store' => [
                'play_more' => 'Пограйте в гру, перш ніж писати що-небудь на форумі. Якщо у вас проблеми з грою, спробуйте написати про це на форумі «Допомоги і підтримки».',
                'too_many_help_posts' => "Перш ніж ви зможете створювати додаткові пости, ви повинні пограти в гру довше. Якщо у вас все ще проблеми з грою, напишіть нам на support@ppy.sh", // FIXME: unhardcode email address.
            ],
        ],

        'topic' => [
            'reply' => [
                'double_post' => 'Будь ласка, відредагуйте ваше останнє повідомлення замість повторної публікації.',
                'locked' => 'Неможливо відповісти в закритій темі.',
                'no_forum_access' => 'Потрібен доступ до запитаного форуму.',
                'no_permission' => 'Недостатньо прав, щоб відповісти.',

                'user' => [
                    'require_login' => 'Будь ласка, увійдіть, щоб відповісти.',
                    'restricted' => "Не можна відповісти поки ваш обліковий запис заблокований.",
                    'silenced' => "Не можна відповісти поки ви заглушені.",
                ],
            ],

            'store' => [
                'no_forum_access' => 'Потрібний доступ до запитаного форуму.',
                'no_permission' => 'Недостатньо прав на створення нової теми.',
                'forum_closed' => 'Не можна публікувати поки форум закритий.',
            ],

            'vote' => [
                'no_forum_access' => 'Потрібний доступ до запитаного форуму.',
                'over' => 'Опитування завершено, і не може бути більше проголосовано.',
                'play_more' => 'Вам потрібно пограти ще, перед тим як голосувати на форумі.',
                'voted' => 'Зміна голосу заборонена.',

                'user' => [
                    'require_login' => 'Увійдіть, щоб проголосувати.',
                    'restricted' => "Не можна голосувати поки ваш обліковий запис заблоковано.",
                    'silenced' => "Не можна голосувати поки ви заглушені.",
                ],
            ],

            'watch' => [
                'no_forum_access' => 'Необхідний доступ до запитуваного форуму.',
            ],
        ],

        'topic_cover' => [
            'edit' => [
                'uneditable' => 'Вказана невірна обкладинка.',
                'not_owner' => 'Тільки автор теми може міняти обкладинку.',
            ],
            'store' => [
                'forum_not_allowed' => 'Цей форум не підтримує теми обкладинки.',
            ],
        ],

        'view' => [
            'admin_only' => 'Тільки адміністратор може переглядати цей форум.',
        ],
    ],

    'score' => [
        'pin' => [
            'not_owner' => 'Тільки власник результату може його закріпити.',
            'too_many' => 'Закріплено занадто багато результатів.',
        ],
    ],

    'user' => [
        'page' => [
            'edit' => [
                'locked' => 'Користувацька сторінка заблокована.',
                'not_owner' => 'Можна редагувати лише власну сторінку.',
                'require_supporter_tag' => 'необхідний тег osu!прихильника.',
            ],
        ],
    ],
];
