<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'support' => [
        'convinced' => [
            'title' => 'Переконав! :D',
            'support' => 'підтримай osu!',
            'gift' => 'або подаруй osu!прихильник іншим гравцям',
            'instructions' => 'натисніть на кнопку з сердечком для переходу в крамницю',
        ],
        'why-support' => [
            'title' => 'Навіщо мені підтримувати osu!? Куди йдуть гроші?',

            'team' => [
                'title' => 'Підтримати команду',
                'description' => 'Маленька команда розробляє і тримає osu! на плаву. Ваша підтримка допомагає їм, знаєте... жити.',
            ],
            'infra' => [
                'title' => 'Iнфраструктура сервера',
                'description' => 'Внески ідуть на утримання серверів для сайту, мультиплеєра, таблиць рекордів, й т. д.',
            ],
            'featured-artists' => [
                'title' => 'Обрані Виконавці',
                'description' => 'З вашою підтримкою, ми можемо наблизитись до співпраці з великою кількістю крутих виконавців й ліцензувати більше відмінної музики для використання в osu!',
                'link_text' => 'Подивіться, хто вже з нами &raquo;',
            ],
            'ads' => [
                'title' => 'Підтримуйте незалежність й самодостатність osu!',
                'description' => 'Ваші внески допоможуть грі залишитися незалежною й повністю вільною від реклами й зовнішніх спонсорів.',
            ],
            'tournaments' => [
                'title' => 'Офіційні турніри',
                'description' => 'Ваші внески допоможуть у підтримці фінансування офіційних турнірів osu! World Cup (а також призових фондів для них).',
                'link_text' => 'Переглянути турніри &raquo;',
            ],
            'bounty-program' => [
                'title' => 'Програма заохочення вкладу у відкрите ПЗ',
                'description' => 'Підтримайте учасників спільноти, які витратили час і сили для того, щоб зробити osu! краще.',
                'link_text' => 'Дізнатися більше &raquo;',
            ],
        ],
        'perks' => [
            'title' => 'Круто! А які привілеї я отримаю?',
            'osu_direct' => [
                'title' => 'osu!direct',
                'description' => 'Швидкий і легкий доступ до пошуку й завантаження мап, відразу у грі.',
            ],

            'friend_ranking' => [
                'title' => 'Рейтинг друзів',
                'description' => "Дізнайтесь, як ви змагаєтесь і наскільки ви краще своїх друзів, за таблицями рекордів для мап як в грі - так і на сайті.",
            ],

            'country_ranking' => [
                'title' => 'Рейтинг країни',
                'description' => 'Підкоріть свою країну, перш ніж підкорювати світ.',
            ],

            'mod_filtering' => [
                'title' => 'Фільтрування по модам',
                'description' => 'Цікавитесь тільки тими, хто грає з HDHR? Без проблем!',
            ],

            'auto_downloads' => [
                'title' => 'Автоматичні завантаження',
                'description' => 'Мапи будуть автоматично завантажуватися при грі в мультиплеєрі, під час спостереження за іншими або при кліці по посиланню в чаті!',
            ],

            'upload_more' => [
                'title' => 'Завантажуй більше',
                'description' => 'Додаткові слоти для мап в очікуванні (на кожну ранговану мапу) максимум до 10.',
            ],

            'early_access' => [
                'title' => 'Ранній доступ',
                'description' => 'Отримання доступу до попередніх версій гри, де ви можете випробувати нові функії, перш ніж вони вийдуть в публіку!<br/><br/>Це включає ранній доступ до нових функцій на сайті!',
            ],

            'customisation' => [
                'title' => 'Індивідуальність',
                'description' => "Налаштуйте свій профіль, додавши персональну обкладинку або додавши повністю настроюваний розділ \"про мене!\" у своєму профілі.",
            ],

            'beatmap_filters' => [
                'title' => 'Фільтри бітмап',
                'description' => 'Фільтр для пошуку мап за зіграними або не зіграними, або по отриманих на них оцінках.',
            ],

            'yellow_fellow' => [
                'title' => 'Жовтий нік',
                'description' => 'Будьте впізнаваними у грі з яскраво-жовтим кольором ніку.',
            ],

            'speedy_downloads' => [
                'title' => 'Швидкі завантаження',
                'description' => 'Менше обмежень по завантаженню карт, особливо через osu!direct.',
            ],

            'change_username' => [
                'title' => 'Зміна імені користувача',
                'description' => 'Можливість змінити своє ім\'я користувача (лише один раз) при першій покупці osu!прихильника.',
            ],

            'skinnables' => [
                'title' => 'Скіни',
                'description' => 'Розширенні можливості використання скінів, такі як встановлення свого фону в меню.',
            ],

            'feature_votes' => [
                'title' => 'Голосування за нові функції',
                'description' => 'Ви можете голосувати за додавання нових функцій в osu! (2 голоси в місяць)',
            ],

            'sort_options' => [
                'title' => 'Параметри сортування',
                'description' => 'Можливість перегляду рейтингу мапи між країнами / друзями / модами у грі.',
            ],

            'more_favourites' => [
                'title' => 'Більше Вподобайок',
                'description' => 'Максимальне число мап, які ви можете вподобати, збільшиться з :normally &rarr; :supporter',
            ],
            'more_friends' => [
                'title' => 'Більше друзів',
                'description' => 'Максимальна кількість друзів, яких Ви можете додати збільшено з :normally &rarr; :supporter',
            ],
            'more_beatmaps' => [
                'title' => 'Завантажуйте більше мап',
                'description' => 'Скільки нерейтингових мап ви можете мати одночасно, залежить від базового значення, плюс бонус за кожну рейтингову мапу яку ви маєте (до певного ліміту). <br/><br/> Зазвичай це :base плюс :bonus за кожну рейтингову мапу (до :bonus_max). З osu!прихильником це значення збільшується до :supporter_base плюс :supporter_bonus за кожну рейтингову мапу (до :supporter_bonus_max).',
            ],
            'friend_filtering' => [
                'title' => 'Рейтинг друзів',
                'description' => 'Змагайтесь з друзями й дізнайтесь наскільки ви краще них!',
            ],

        ],
        'supporter_status' => [
            'contribution' => 'Дуже дякуємо за вашу підтримку! Всього ви пожертвували :dollars за :tags придбань!',
            'gifted' => "З них, ви подарували :giftedTags тегів (в результаті подаровано :giftedDollars), як щедро!",
            'not_yet' => "У вас ніколи не було тегу osu!прихильника :(",
            'valid_until' => 'Ваш osu!прихильник буде діяти до :date!',
            'was_valid_until' => 'Ваш тег osu!прихильник був чинний до :date.',
        ],
    ],
];
