<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'support' => [
        'convinced' => [
            'title' => 'Переконав! :D',
            'support' => 'підтримай osu!',
            'gift' => 'або подаруй osu!supporter іншому гравцеві',
            'instructions' => 'натисніть на сердечко для переходу в магазин',
        ],
        'why-support' => [
            'title' => 'Навіщо мені підтримувати osu!? Куди йдуть гроші?',

            'team' => [
                'title' => 'Підтримати команду',
                'description' => 'Маленька команда розробляє і тримає osu! на плаву. Ваша підтримка допомагає їм, знаєте... жити.',
            ],
            'infra' => [
                'title' => 'Iнфраструктура сервера',
                'description' => 'Внески ідуть на утримання серверів для сайту, мультиплеєра, таблиць рекордів, й т. д.',
            ],
            'featured-artists' => [
                'title' => 'Обрані Виконавці',
                'description' => 'З вашою підтримкою ми зможемо співпрацювати з великою кількістю крутих виконавців і ліцензувати ще більше відмінної музики для використання в osu!',
                'link_text' => 'Подивіться, хто вже є &raquo;',
            ],
            'ads' => [
                'title' => 'Підтримуйте незалежність osu!',
                'description' => 'Ваші внески допоможуть грі залишитися незалежною й повністю вільною від реклами й зовнішніх спонсорів.',
            ],
            'tournaments' => [
                'title' => 'Офіційні турніри',
                'description' => 'Допоможіть фінансувати офіційні турніри osu! World Cup (а також призи для них).',
                'link_text' => 'Перегляньте турніри &raquo;',
            ],
            'bounty-program' => [
                'title' => 'Програма заохочення вкладу у відкрите ПЗ',
                'description' => 'Підтримайте учасників спільноти, які витратили час і сили для того, щоб зробити osu! краще.',
                'link_text' => 'Дізнайтесь більше &raquo;',
            ],
        ],
        'perks' => [
            'title' => 'Цікаво, а що ж я отримаю?!',
            'osu_direct' => [
                'title' => 'osu!direct',
                'description' => 'Швидкий і легкий доступ до пошуку і завантаження мап, прямо в грі.',
            ],

            'friend_ranking' => [
                'title' => 'Рейтинг друзів',
                'description' => "Дізнайтеся, наскільки ви краще ваших друзів, за таблицями рекордів для карт, доступних як в грі, так і на сайті.",
            ],

            'country_ranking' => [
                'title' => 'Рейтинг країни',
                'description' => 'Завоюйте країну, перш ніж завойовувати світ.',
            ],

            'mod_filtering' => [
                'title' => 'Фільтр по модам',
                'description' => 'Цікавитесь тільки тими, хто грає з HDHR? Без проблем!',
            ],

            'auto_downloads' => [
                'title' => 'Автоматичні завантаження',
                'description' => 'Мапи будуть автоматично завантажуватися при грі в мультиплеєрі, під час спостереження за іншими або при кліці по посиланню в чаті!',
            ],

            'upload_more' => [
                'title' => 'Завантажуй більше',
                'description' => 'Додаткові слоти для мап в очікуванні рангу (за кожну мапу до 10).',
            ],

            'early_access' => [
                'title' => 'Ранній доступ',
                'description' => 'Отримання доступу до попередніх версій гри, де ви можете випробувати нові функії, перш ніж вони вийдуть в публіку!<br/><br/>Це включає ранній доступ до нових функцій на сайті!',
            ],

            'customisation' => [
                'title' => 'Індивідуальність',
                'description' => "Налаштуйте свій профіль, додавши повністю настроювану сторінку \"про мене!\".",
            ],

            'beatmap_filters' => [
                'title' => 'Фільтри карт',
                'description' => 'Фільтр для пошуку карт, в які ви грали або не грали. А також за отриманими на них рейтингами.',
            ],

            'yellow_fellow' => [
                'title' => 'Золотий нік',
                'description' => 'Будьте відомим в грі з яскраво-жовтим кольором ника.',
            ],

            'speedy_downloads' => [
                'title' => 'Швидкі завантаження',
                'description' => 'Менше обмежень по завантаженню карт, особливо через osu!direct.',
            ],

            'change_username' => [
                'title' => 'Зміна нікнейму',
                'description' => 'Можливість змінити свій нікнейм без додаткових витрат (тільки один раз)',
            ],

            'skinnables' => [
                'title' => 'Кастомізація',
                'description' => 'Розширенні можливості використання скінів, такі як встановлення свого фону в меню.',
            ],

            'feature_votes' => [
                'title' => 'Голосування за нові функції',
                'description' => 'Ви можете голосувати за додавання нових функцій в osu! (2 голоси в місяць)',
            ],

            'sort_options' => [
                'title' => 'Параметри сортування',
                'description' => 'Можливість перегляду рейтингу мапи між країнами / друзями / модами в грі.',
            ],

            'more_favourites' => [
                'title' => 'Більше Вподобайок',
                'description' => 'Максимальне число мап, які ви можете вподобати, збільшиться з :normally &rarr; :supporter',
            ],
            'more_friends' => [
                'title' => 'Більше друзів',
                'description' => 'Максимальна кількість друзів, яких Ви можете додати збільшено з :normally &rarr; :supporter',
            ],
            'more_beatmaps' => [
                'title' => 'Завантажуйте більше мап',
                'description' => 'Скільки нерейтингових мап ви можете мати одночасно звалежить від базового значення плюс бонус за кожну рейтингову мапу яку ви маєте (до певного ліміту). <br/><br/> Зазвичай це :base плюс :bonus за кожну рейтингову мапу (до :bonus_max). З osu!прихильником це значення збільшується до :supporter_base плюс :supporter_bonus за кожну рейтингову мапу (до :supporter_bonus_max).',
            ],
            'friend_filtering' => [
                'title' => 'Рейтинг друзів',
                'description' => 'Змагайтесь з друзями і дізнайтеся наскільки ви сильніші проти них!',
            ],

        ],
        'supporter_status' => [
            'contribution' => 'Дуже дякуємо за вашу підтримку! Всього ви пожертвували :dollars за :tags придбань!',
            'gifted' => "З них, ви подарували :giftedTags тегів (в результаті подаровано :giftedDollars), як щедро!",
            'not_yet' => "У вас ніколи не було тегу osu!прихильника :(",
            'valid_until' => 'Ваш osu!прихильник буде діяти до :date!',
            'was_valid_until' => 'Ваш тег osu!прихильник був чинний до :date.',
        ],
    ],
];
