<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'support' => [
        'convinced' => [
            'title' => 'Я переконав! :D',
            'support' => 'підтримай osu!',
            'gift' => 'або подаруй osu! прихильник іншому гравцеві',
            'instructions' => 'натисніть на сердечко для переходу в магазин',
        ],
        'why-support' => [
            'title' => 'Навіщо мені підтримувати osu!? Куди йдуть гроші?',

            'team' => [
                'title' => 'Підтримати команду',
                'description' => 'Маленька команда розробляє osu! Ваша допомога допомагає їм... жити.',
            ],
            'infra' => [
                'title' => 'Iнфраструктура сервера',
                'description' => 'Допомога йде на утримання серверів для сайту, мультиплеєра, таблиць рекордів, і т.д.',
            ],
            'featured-artists' => [
                'title' => 'Обрані Артисти',
                'description' => 'З вашою підтримкою ми зможемо співпрацювати з великою кількістю крутих виконавців і ліцензувати ще більше відмінної музики для використання в osu!',
                'link_text' => 'Подивіться, хто вже є &raquo;',
            ],
            'ads' => [
                'title' => 'Підтримуйте незалежність osu!',
                'description' => 'Ваш внесок допоможе грі залишитися незалежною і повністю вільною від реклами і зовнішніх спонсорів.',
            ],
            'tournaments' => [
                'title' => 'Офіційні турніри',
                'description' => 'Допоможіть фінансувати офіційні турніри osu! World Cup (а також призи для них).',
                'link_text' => 'Перегляньте турніри &raquo;',
            ],
            'bounty-program' => [
                'title' => 'Програма заохочення вкладу у відкрите ПЗ',
                'description' => 'Підтримайте учасників спільноти, які витратили час і сили для того, щоб зробити osu! краще.',
                'link_text' => 'Дізнайтесь більше &raquo;',
            ],
        ],
        'perks' => [
            'title' => 'Цікаво, а що ж я отримаю?!',
            'osu_direct' => [
                'title' => 'osu!direct',
                'description' => 'швидкий і легкий доступ до пошуку і завантаження карт, прямо у грі.',
            ],

            'friend_ranking' => [
                'title' => 'Рейтинг друзів',
                'description' => "Дізнайтеся, наскільки ви краще ваших друзів, за таблицями рекордів для карт, доступних як в грі, так і на сайті.",
            ],

            'country_ranking' => [
                'title' => 'Рейтинг країни',
                'description' => 'Завоюйте країну, перш ніж завойовувати світ.',
            ],

            'mod_filtering' => [
                'title' => 'Фільтр по модам',
                'description' => 'Цікавитесь тільки з тими, хто грає з HDHR? Немає проблем!',
            ],

            'auto_downloads' => [
                'title' => 'Автоматичне звантаження',
                'description' => 'Миттєве завантаження карт при грі в мультиплеєрі, спостереженні за іншими гравцями або при кліці по посиланнях в чаті!',
            ],

            'upload_more' => [
                'title' => 'Завантажуй більше',
                'description' => 'Додаткові слоти для очікуючих рангу карт (до 10).',
            ],

            'early_access' => [
                'title' => 'Ранній доступ',
                'description' => 'Доступ до попередніх версій гри, де ви можете спробувати нові функції, перш ніж вони дістануть розголосу!',
            ],

            'customisation' => [
                'title' => 'Індивідуальність',
                'description' => "Налаштуйте свій профіль, додавши повністю настроювану сторінку \"про мене!\".",
            ],

            'beatmap_filters' => [
                'title' => 'Фільтри карт',
                'description' => 'Фільтр для пошуку карт, в які ви грали або не грали. А також за отриманими на них рейтингами.',
            ],

            'yellow_fellow' => [
                'title' => 'Золотий нік',
                'description' => 'Будьте відомим в грі з яскраво-жовтим кольором ника.',
            ],

            'speedy_downloads' => [
                'title' => 'Швидкі завантаження',
                'description' => 'Менше обмежень по завантаженню карт, особливо через osu!direct.',
            ],

            'change_username' => [
                'title' => 'Зміна нікнейму',
                'description' => 'Можливість змінити свій нікнейм без додаткових витрат (тільки один раз)',
            ],

            'skinnables' => [
                'title' => 'Кастомізація',
                'description' => 'Розширені можливості обкладинки, дозволять тобі, наприклад, встановити свій фон в меню.',
            ],

            'feature_votes' => [
                'title' => 'Голосування за нові фічі',
                'description' => 'Ви можете голосувати за додавання нових функцій в osu! (2 голоси в місяць)',
            ],

            'sort_options' => [
                'title' => 'Параметри сортування',
                'description' => 'Можливість перегляду рейтингу карти між країнами / друзями / модами в грі.',
            ],

            'more_favourites' => [
                'title' => 'Більше обраних',
                'description' => 'Максимальне число карт, які ви можете додати в обрані, збільшиться з :normally &rarr; :supporter',
            ],
            'more_friends' => [
                'title' => 'Більше друзів',
                'description' => 'Максимальна кількість друзів, яких Ви можете додати збільшено з :normally &rarr; :supporter',
            ],
            'more_beatmaps' => [
                'title' => 'Завантажте більше карт',
                'description' => 'Хоч скільки рейтінових карт ви можете додати зважає на базового значення плюс дополнітелной бонус за кожну рейтингову карту яку ви маєте (до певного ліміту). <br/></br> Зазвичай це :base плюс :bonus за кожну рейтингову карту (до :bonus_max ). З osu!supporter це значення збільшується до :supporter_base плюс :supporter_bonus за кожну рейтингову карту (до :supporter_bonus_max)',
            ],
            'friend_filtering' => [
                'title' => 'Рейтинг друзів',
                'description' => 'Змагаються з друзями і дізнайтеся наскільки ви сильні проти них!',
            ],

        ],
        'supporter_status' => [
            'contribution' => 'Дуже дякую за вашу підтримку! Всього ви пожертвували :dollars за :tags покупок!',
            'gifted' => "З них, ви подарували :giftedTags тегів (в результаті подаровано :giftedDollars), як щедро!",
            'not_yet' => "У вас немає osu!прихильник :(",
            'valid_until' => 'Ваш osu!прихильник буде активним до :date!',
            'was_valid_until' => 'Ваш osu!прихильник закінчується :date.',
        ],
    ],
];
