<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'beatmapset_update_notice' => [
        'new' => 'Просто повідомляємо, що мапа ":title" оновилася з моменту вашого останнього візиту.',
        'subject' => 'Оновлення для мапи ":title"',
        'unwatch' => 'Якщо ви більше не бажаєте стежити за цією бітмапою, ви або можете натиснути на посилання "Перестати стежити" на сторінці вище, або зі сторінки відстеження моддингу:',
        'visit' => 'Перейдіть на сторінку обговорення:',
    ],

    'common' => [
        'closing' => 'З повагою,',
        'hello' => 'Вітання, :user,',
        'report' => 'Будь ласка, НЕГАЙНО дайте відповідь на цей лист, якщо ви не створювали цей запит.',
        'ignore' => 'Якщо ви відправляли запит на це, ви можете спокійно проігнорувати цей лист.',
    ],

    'donation_thanks' => [
        'benefit_more' => 'Більше нових переваг osu!supporter з\'являтимуться з часом!',
        'feedback' => "Якщо у вас залишилися питання або ви хочете залишити відгук, не соромтеся відповідати на цей лист; Ми відповімо якнайшвидше!",
        'keep_free' => 'Завдяки таким людям, як ви, osu! завжди буде здатне підтримувати безперебійну роботу гри й спільноти без будь-яких рекламних оголошень або примусових платежів.',
        'keep_running' => 'Ваша підтримка дозволить osu! працювати приблизно :minutes! Вам може здатися, що цього недостатньо, але будь-який внесок важливий :)',
        'subject' => 'Спасибі, osu! <3 вас',
        'translation' => 'Нище приводиться переклад, що надається спільнотою для інформаційних цілей:',

        'benefit' => [
            'gift' => 'Одержувач подарунка тепер матиме доступ до osu!direct і іншим привілеям.',
            'self' => 'Ви тепер будете мати доступ до osu!direct і багатьом іншим функціям на :duration.',
        ],

        'support' => [
            '_' => 'Красно дякуємо за вашу :support для osu!.',
            'first' => 'підтримку',
            'repeat' => 'тривала підтримка',
        ],
    ],

    'forum_new_reply' => [
        'new' => 'Просто дам знати, що в ":title" з\'явився новий відповідь з твого останнього візиту.',
        'subject' => '[osu!] Нова відповідь в темі ":title"',
        'unwatch' => 'Якщо Ви більше не хочете спостерігати цю тему, натисніть на посилання "Відписатися" внизу теми, або зі сторінки підписок на теми:',
        'visit' => 'Перейдіть відразу до останнього відповіді використовуючи це посилання:',
    ],

    'password_reset' => [
        'code' => 'Ваш код підтвердження:',
        'requested' => 'Ви або той хто видає вас за себе, запросив скидання паролю на ваш обліковий запис osu!.',
        'subject' => 'Відновлення облікового запису osu!',
    ],

    'store_payment_completed' => [
        'prepare_shipping' => 'Ми отримали ваш платіж і готуємо його доставлення. Це може зайняти кілька днів, в залежності від кількості замовлення. Ви можете спостерігати за процесом тут, включаючи деталі доставлення:',
        'processing' => 'Ми отримали Ваш платіж і зараз обробляємо Ваше замовлення. Ви можете слідкувати за прогресом свого замовлення тут:',
        'questions' => "Якщо ви маєте будь-які запитання, не соромтесь відповідати на це повідомлення.",
        'shipping' => 'Доставка',
        'subject' => 'Ми отримали ваше замовлення в osu!store!',
        'thank_you' => 'Дякую за замовлення в osu!store!',
        'total' => 'Всього',
    ],

    'supporter_gift' => [
        'anonymous_gift' => 'Людина, який подарував вам цей тег, може хотіти залишитися анонімним, тому його ми його ім\'я залишиться незгаданим.',
        'anonymous_gift_maybe_not' => 'Але ви вже швидше за все знаєте хто це ;).',
        'duration' => 'Завдяки йому, у вас тепер є доступ до osu!direct і іншим привілеям osu!прихильника на :duration.',
        'features' => 'Ви можете дізнатися більше про них тут:',
        'gifted' => 'Хтось щойно подарував вам osu!прихильника!',
        'gift_message' => '',
        'subject' => 'Вам подарували osu!прихильника!',
    ],

    'user_email_updated' => [
        'changed_to' => 'Цей лист з підтвердженням про те, що ваша адреса електронної пошти osu! буде змінений на ":email".',
        'check' => 'Будь ласка, переконайтеся, що ви отримали цей лист на ваш новий адреса, щоб запобігти втраті доступу до вашого профілю osu! в майбутньому.',
        'sent' => 'З метою безпеки, цей лист було відправлено і на Ваш старий, і на нову адресу електронної пошти.',
        'subject' => 'підтвердження зміни адреси osu!',
    ],

    'user_force_reactivation' => [
        'main' => 'Ваш обліковий запис підозрюється в скомпрометованості, мав підозрілу активність або ДУЖЕ слабкий пароль. В разі цього, ми потребуємо від вас встановлення нового паролю. Будь ласка, переконайтеся що цього разу ви обрали БЕЗПЕЧНИЙ пароль.',
        'perform_reset' => 'Ви можете виконати скидання за посиланням :url',
        'reason' => 'Причина:',
        'subject' => 'Необхідна реактивація облікового запису osu!',
    ],

    'user_notification_digest' => [
        'new' => 'Просто повідомляємо вас про наявність нових оновлень в темах на які ви підписані.',
        'settings' => 'Змінити налаштування оповіщень поштою:',
        'subject' => 'Нові сповіщення osu!',
    ],

    'user_password_updated' => [
        'confirmation' => 'Це всього лише подвержденном, що Ваш пароль до osu! був змінений.',
        'subject' => 'Підтвердження зміни пароля облікового запису osu!',
    ],

    'user_verification' => [
        'code' => 'Ваш код підтвердження:',
        'code_hint' => 'Ви можете ввести код з пробілами або без них.',
        'link' => 'В якості альтернативи, Ви також можете перейти по посиланню нижче для завершення верифікації:',
        'report' => 'Якщо ви не запитували цього, будь ласка, НЕГАЙНО ВІДПОВІДАЙТЕ на цей лист, оскільки Ваш обліковий запис може бути під загрозою.',
        'subject' => 'підтвердження акаунта osu!',

        'action_from' => [
            '_' => 'Дія, виконана на вашому обліковому запису з :country потребує підтвердження.',
            'unknown_country' => 'невідома країна',
        ],
    ],
];
