<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'beatmapset_update_notice' => [
        'new' => 'Просто повідомляємо, що карта ":title" оновилася з моменту вашого останнього візиту.',
        'subject' => 'Оновлення для карти ":title"',
        'unwatch' => 'Якщо ви більше не бажаєте стежити за цій картою, ви або можете натиснути на посилання "Перестати стежити" на сторінці вище, або зі сторінки відстеження моддинга:',
        'visit' => 'Перейдіть на сторінку обговорення:',
    ],

    'common' => [
        'closing' => 'З повагою,',
        'hello' => 'Вітання, :user,',
        'report' => 'Будь ласка, НЕГАЙНО дайте відповідь на цей лист, якщо ви не запитували це зміна.',
    ],

    'donation_thanks' => [
        'benefit_more' => 'Також, з часом у osu! Supporter з\'явиться ще більше привілеїв!',
        'feedback' => "Якщо у вас залишилися питання або Відгуки, не соромтеся відповідати на цей лист; Ми напиши вам якомога швидше!",
        'keep_free' => 'Завдяки таким людям, як Ви, osu! здатне забезпечити безперебійну роботу гри і спільноти без будь-яких рекламних оголошень або примусових платежів.',
        'keep_running' => 'Ваша підтримка дозволить osu! працювати приблизно :minutes! Вам може здатися, що це мало, але кожен внесок має важливий :)',
        'subject' => 'Спасибі, osu! <3 вас',
        'translation' => 'Нижче наводиться призначений для користувача переклад для ознокомленія:',

        'benefit' => [
            'gift' => 'Одержувач подарунка тепер матиме доступ до osu!direct і іншим привілеям.',
            'self' => 'Ви тепер будете мати доступ до osu!direct і багатьом іншим функціям на :duration.',
        ],

        'support' => [
            '_' => 'Дякую за вашу :support для osu!',
            'first' => 'підтримка',
            'repeat' => 'тривала підтримка',
        ],
    ],

    'forum_new_reply' => [
        'new' => 'Просто дам знати, що в ":title" з\'явився новий відповідь з твого останнього візиту.',
        'subject' => '[osu!] Нова відповідь в темі ":title"',
        'unwatch' => 'Якщо Ви більше не хочете спостерігати цю тему, натисніть на посилання "Відписатися" внизу теми, або зі сторінки підписок на теми:',
        'visit' => 'Перейдіть відразу до останнього відповіді використовуючи це посилання:',
    ],

    'password_reset' => [
        'code' => 'Ваш код підтвердження:',
        'requested' => 'Ви або той хто прикидається вами запросив зміну пароля на ваш обліковий запис osu!',
        'subject' => 'відновлення акаунта osu!',
    ],

    'store_payment_completed' => [
        'prepare_shipping' => 'Ми отримали ваш платіж і готуємо його до відправки. Це може зайняти кілька днів, в залежності від кількості замовлення. Ви можете спостерігати за процесом тут, включаючи деталі доставки:',
        'processing' => 'Ми отримали Ваш платіж і зараз обробляємо Ваше замовлення. Ви можете слідкувати за прогресом свого замовлення тут:',
        'questions' => "Якщо у вас є будь-які питання не соромтеся відповідати на дане повідомлення.",
        'shipping' => 'Доставка',
        'subject' => 'Ми отримали ваше замовлення в osu!store!',
        'thank_you' => 'Дякую за замовлення в osu!store!',
        'total' => 'Всього',
    ],

    'supporter_gift' => [
        'anonymous_gift' => 'Людина, який подарував вам цей тег, може хотіти залишитися анонімним, тому його ми його не згадали.',
        'anonymous_gift_maybe_not' => 'Але ви вже швидше за все знаєте хто це ;).',
        'duration' => 'Завдяки йому, у вас тепер є доступ до osu!direct і іншим привілеям osu!supporter на :duration.',
        'features' => 'Ви можете дізнатися більше про них тут:',
        'gifted' => 'Хто то подарував вам osu!supporter',
        'subject' => 'Вам подарували osu!supporter',
    ],

    'user_email_updated' => [
        'changed_to' => 'Цей лист з підтвердженням про те, що ваша адреса електронної пошти osu! буде змінений на ":email".',
        'check' => 'Будь ласка, переконайтеся, що ви отримали цей лист на ваш новий адреса, щоб запобігти втраті доступу до вашого профілю osu! в майбутньому.',
        'sent' => 'З метою безпеки, цей лист було відправлено і на Ваш старий, і на нову адресу електронної пошти.',
        'subject' => 'підтвердження зміни адреси osu!',
    ],

    'user_force_reactivation' => [
        'main' => 'Передбачається, що Ваш обліковий запис була зламана, має недавні підозрілі дії або ДУЖЕ слабкий пароль. В результаті ми вимагаємо, щоб Ви встановили новий пароль. Будь ласка, переконайтеся, що Ви вибрали БЕЗПЕЧНИЙ пароль.',
        'perform_reset' => 'Ви можете скинути за посиланням :url',
        'reason' => 'Причина:',
        'subject' => 'Необхідна повторна активація облікового запису osu!',
    ],

    'user_notification_digest' => [
        'new' => 'Просто повідомляю вам про наявність нових оновлень в темах, на які ви підписані.',
        'settings' => 'Змінити налаштування повідомлень електронної пошти:',
        'subject' => 'Нові сповіщення osu!',
    ],

    'user_password_updated' => [
        'confirmation' => 'Це всього лише подвержденном, що Ваш пароль до osu! був змінений.',
        'subject' => 'Підтвердження зміни пароля облікового запису osu!',
    ],

    'user_verification' => [
        'code' => 'Ваш код підтвердження:',
        'code_hint' => 'Ви можете ввести код з пробілами або без них.',
        'link' => 'В якості альтернативи, Ви також можете перейти по посиланню нижче для завершення верифікації:',
        'report' => 'Якщо Ви не запитували його, будь ласка, НЕГАЙНО дайте відповідь на лист, так як Ваш акаунт може бути під загрозою.',
        'subject' => 'підтвердження акаунта osu!',

        'action_from' => [
            '_' => 'Дія, виконана на вашому обліковому записі з :country потребує верифікації.',
            'unknown_country' => 'невідома країна',
        ],
    ],
];
