<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'index' => [
        'none_running' => 'На даний момент немає турнірів, будь ласка, спробуйте пізніше!',
        'registration_period' => 'Реєстрація: з :start до :end',

        'header' => [
            'title' => 'Турніри спільноти',
        ],

        'item' => [
            'registered' => 'Зареєстровані гравці',
        ],

        'state' => [
            'current' => 'Активні турніри',
            'previous' => 'Минулі турніри',
        ],
    ],

    'show' => [
        'banner' => 'Підтримайте свою команду',
        'entered' => 'Ви зареєстровані на цей турнір. <br> <br> Зверніть увагу: це <b>не означає</b> що вас призначили в команду. <br> <br> Подальші інструкції будуть відправлені на вашу пошту, ближче до дати турніру, тому будь ласка, перевірте, чи дійсна пошта, до якої прив\'язаний ваш osu! акаунт!',
        'info_page' => 'Інформаційна сторінка',
        'login_to_register' => 'Будь ласка :login щоб бачити більше інформації про турнір!',
        'not_yet_entered' => 'Ви не зареєстровані на цьому турнірі.',
        'rank_too_low' => 'Вибачте, але ви не відповідаєте вимогам, необхідним на даний турнір!',
        'registration_ends' => 'Реєстрація закрита до :date',

        'button' => [
            'cancel' => 'Скасувати реєстрацію',
            'register' => 'Запишіть мене!',
        ],

        'period' => [
            'end' => 'Кінець',
            'start' => 'Початок',
        ],

        'state' => [
            'before_registration' => 'Реєстрація на цей турнір поки не відкрита.',
            'ended' => 'Цей турнір завершений. Перевірте сторінку з інформацією для перегляду результатів.',
            'registration_closed' => 'Реєстрація на цей турнір закрита. Відкрийте інформаційну сторінку для перегляду останніх змін.',
            'running' => 'Цей турнір вже проводиться. Відкрийте інформаційну сторінку для перегляду останніх змін.',
        ],
    ],
    'tournament_period' => ':start до :end',
];
