<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'index' => [
        'none_running' => 'На цей час турніри не проводяться, будь ласка, спробуйте пізніше!',
        'registration_period' => 'Реєстрація: з :start до :end',

        'header' => [
            'title' => 'Турніри спільноти',
        ],

        'item' => [
            'registered' => 'Зареєстрованих гравців',
        ],

        'state' => [
            'current' => 'Активні турніри',
            'previous' => 'Минулі турніри',
        ],
    ],

    'show' => [
        'banner' => 'Підтримайте свою команду',
        'entered' => 'Ви зареєстровані на цей турнір.<br><br>Зверніть увагу: це <b>не</b> означає, що вас призначили в команду.<br><br>Подальші інструкції будуть відправленні вам поштою ближче до дати турніру, тому перевірте, будь ласка, чи дійсна пошта, до якої прив\'язаний ваш обліковий запис osu!',
        'info_page' => 'Інформаційна сторінка',
        'login_to_register' => 'Будь ласка, :login, щоб бачити більше інформації про реєстрацію!',
        'not_yet_entered' => 'Ви не зареєстровані на цей турнір.',
        'rank_too_low' => 'Вибачте, ваш рейтинг не відповідає вимогам, встановленим для цього турніру!',
        'registration_ends' => 'Реєстрація закінчується :date',

        'button' => [
            'cancel' => 'Скасувати реєстрацію',
            'register' => 'Запишіть мене!',
        ],

        'period' => [
            'end' => 'Кінець',
            'start' => 'Початок',
        ],

        'state' => [
            'before_registration' => 'Реєстрація на цей турнір поки не відкрита.',
            'ended' => 'Цей турнір завершений. Ви можете переглянути результати на інформаційній сторінці.',
            'registration_closed' => 'Реєстрація на цей турнір закрита. Відкрийте інформаційну сторінку для перегляду останніх змін.',
            'running' => 'Цей турнір вже розпочався. Більше інформації можна знайти на інформаційній сторінці.',
        ],
    ],
    'tournament_period' => 'з :start до :end',
];
