<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'deleted' => '[видалений користувач]',

    'beatmapset_activities' => [
        'title' => "Історія редагування карт користувача :user",
        'title_compact' => 'Редагування',

        'discussions' => [
            'title_recent' => 'Нещодавно розпочаті дискусії',
        ],

        'events' => [
            'title_recent' => 'Недавні події',
        ],

        'posts' => [
            'title_recent' => 'Недавні публікації',
        ],

        'votes_received' => [
            'title_most' => 'Найпопулярніші (за 3 місяці)',
        ],

        'votes_made' => [
            'title_most' => 'Найпопулярніші (за 3 місяці)',
        ],
    ],

    'blocks' => [
        'banner_text' => 'Ви заблокували цього користувача.',
        'blocked_count' => 'заблоковати користувача (:count)',
        'hide_profile' => 'Приховати профіль',
        'not_blocked' => 'Користувач не заблокований.',
        'show_profile' => 'Показати профіль',
        'too_many' => 'Досягнуто ліміт блокування.',
        'button' => [
            'block' => 'Заблокувати',
            'unblock' => 'Розблокувати',
        ],
    ],

    'card' => [
        'loading' => 'Завантаження...',
        'send_message' => 'Надіслати повідомлення',
    ],

    'disabled' => [
        'title' => 'Ой-ой! Схоже, що ваш обліковий запис був відключений.',
        'warning' => "Врахуйте, що якщо ви порушили правила, то як мінімум місяць ваші спроби оскаржити блокування розглядатися не будуть. Після закінчення одного місяця можете зв'язуватися з нами, якщо вважаєте за це необхідним. Також знайте, що створення нових акаунтів щоб уникнути блокування <strong>лише продовжить цей місячний період</strong>, в який ви не зможете відновити свій головний аккаунт. До того ж, <strong>створення вторинних акаунтів заборонено правилами</strong>, тому радимо вам не робити цього!",

        'if_mistake' => [
            '_' => 'Якщо ви вважаєте, що це помилка ви можете зв\'язатися з нами (через :email або після натискання на "?" В правому-нижньому кутку цієї сторінки). Зауважте, що ми завжди впевнені в своїх діях, так як вони засновані на надійних даних. Ми залишаємо за собою право ігнорувати ваші скарги, якщо порахуємо, що ви ведете себе недобросовісно.',
            'email' => 'ел. поште',
        ],

        'reasons' => [
            'compromised' => 'Можливо, ваш аккаунт був скомпрометований. Він може бути тимчасово відключений, поки особистість власника підтверджується.',
            'opening' => 'Є ряд причин, які можуть призвести до відключення вашого облікового запису:',

            'tos' => [
                '_' => 'Ви зламали один або кілька наших :community_rules або :tos.',
                'community_rules' => 'правила спільноти',
                'tos' => 'умови обслуговування',
            ],
        ],
    ],

    'filtering' => [
        'by_game_mode' => 'Учасники за режимом гри',
    ],

    'force_reactivation' => [
        'reason' => [
            'inactive_different_country' => "Ваш обліковий запис вже давно не використовується.",
        ],
    ],

    'login' => [
        '_' => 'Вхід',
        'button' => 'Вхід',
        'button_posting' => 'Входимо...',
        'email_login_disabled' => 'Вхід через електронну пошту відключений. Будь ласка, використовуйте ім\'я користувача.',
        'failed' => 'Помилка авторизації',
        'forgot' => 'Забули пароль?',
        'info' => 'Увійдіть, щоб продовжити',
        'invalid_captcha' => 'Занадто багато невдалих спроб входу в систему, будь ласка, завершіть капчу і спробуйте ще раз. (Оновити сторінку, якщо капча не видима)',
        'locked_ip' => 'ваша IP адреса заблокована. Будь ласка спробуйте пізніше.',
        'password' => 'Пароль',
        'register' => "У вас все ще немає аккаунта osu!? Створіть новий",
        'remember' => 'Запам\'ятати цей браузер',
        'title' => 'Увійдіть, щоб продовжити',
        'username' => 'Ім\'я користувача',

        'beta' => [
            'main' => 'Доступ до бета-версії обмежений.',
            'small' => '(osu!supporters отримають доступ пізніше)',
        ],
    ],

    'posts' => [
        'title' => 'Публікації :username',
    ],

    'anonymous' => [
        'login_link' => 'натисніть тут, щоб увійти',
        'login_text' => 'увійти',
        'username' => 'Гість',
        'error' => 'Спершу ввійдіть до облікового запису.',
    ],
    'logout_confirm' => 'Ви справді бажаєте вийти? :(',
    'report' => [
        'button_text' => 'Поскаржитися',
        'comments' => 'Додаткові коментарі',
        'placeholder' => 'Будь ласка, надайте будь-яку інформацію, яка, на вашу думку, може бути корисною.',
        'reason' => 'Причина',
        'thanks' => 'Дякуємо за повідомлення!',
        'title' => 'Поскаржитись на :username?',

        'actions' => [
            'send' => 'Надіслати скаргу',
            'cancel' => 'Відмінити',
        ],

        'options' => [
            'cheating' => 'Нечесна гра / чіти',
            'insults' => 'Образа мене / інших',
            'spam' => 'Спам',
            'unwanted_content' => 'Повідомити про неприйнятний вміст',
            'nonsense' => 'Нісенітниця',
            'other' => 'Інше (вкажіть нижче)',
        ],
    ],
    'restricted_banner' => [
        'title' => 'Ваш обліковий запис обмежено!',
        'message' => 'Поки права вашого облікового запису обмежені, ви не зможете взаємодіяти з іншими гравцями і ваші результати будуть видні тільки вам. Зазвичай це результат автоматизованого процесу і, як правило, обмеження знімається на протязі доби. Якщо ви хочете оскаржити ваше обмеження, будь ласка <a href="mailto:accounts@ppy.sh"> зв\'яжіться з підтримкою </a>.',
    ],
    'show' => [
        'age' => ':age років',
        'change_avatar' => 'змінити аватар!',
        'first_members' => 'Тут з самого початку',
        'is_developer' => 'osu!розробник',
        'is_supporter' => 'osu!прихильник',
        'joined_at' => 'Дата реєстрації: :date',
        'lastvisit' => 'Останній раз бачили :date',
        'lastvisit_online' => 'Зараз в мережі',
        'missingtext' => 'Можливо, ви зробили помилку! (Або гравець заблокований)',
        'origin_country' => 'Проживає в :country',
        'previous_usernames' => 'також відомий як',
        'plays_with' => 'Грає з :devices',
        'title' => "профіль :username",

        'comments_count' => [
            '_' => 'Опубліковано :link',
            'count' => ':count_delimited коментар|:count_delimited коментарі',
        ],
        'edit' => [
            'cover' => [
                'button' => 'Змінити обкладинку профілю',
                'defaults_info' => 'Більше варіантів буде доступно найближчим часом',
                'upload' => [
                    'broken_file' => 'Не вдалося обробити зображення. Спробуйте ще раз.',
                    'button' => 'Завантажити зображення',
                    'dropzone' => 'Для завантаження файлу перетягніть його сюди',
                    'dropzone_info' => 'Ви також можете перетягнути зображення сюди для завантаження',
                    'size_info' => 'Розмір обкладинки повинен бути 2400x620',
                    'too_large' => 'Завантажене зображення занадто велике.',
                    'unsupported_format' => 'Формат не підтримується.',

                    'restriction_info' => [
                        '_' => 'Завантаження доступна тільки :link',
                        'link' => 'власникам osu!supporter',
                    ],
                ],
            ],

            'default_playmode' => [
                'is_default_tooltip' => 'режим гри за замовчуванням',
                'set' => 'вибрати :mode як режим гри за замовчуванням',
            ],
        ],

        'extra' => [
            'none' => 'нічого',
            'unranked' => 'Немає недавніх ігор',

            'achievements' => [
                'achieved-on' => 'Отримано :date',
                'locked' => 'Не отримано',
                'title' => 'Досягнення',
            ],
            'beatmaps' => [
                'by_artist' => 'від :artist',
                'title' => 'Карти',

                'favourite' => [
                    'title' => 'Улюблені карти',
                ],
                'graveyard' => [
                    'title' => 'Закинуті карти',
                ],
                'loved' => [
                    'title' => 'Улюблені карти',
                ],
                'pending' => [
                    'title' => 'На розгляді',
                ],
                'ranked' => [
                    'title' => 'Рейтингові і схвалені карти',
                ],
            ],
            'discussions' => [
                'title' => 'Обговорення',
                'title_longer' => 'Недавні обговорення',
                'show_more' => 'бачити більше обговорень',
            ],
            'events' => [
                'title' => 'Події',
                'title_longer' => 'Недавні події',
                'show_more' => 'бачити більше подій',
            ],
            'historical' => [
                'title' => 'Активність',

                'monthly_playcounts' => [
                    'title' => 'Активність по місяцях',
                    'count_label' => 'Ігор',
                ],
                'most_played' => [
                    'count' => 'разів зіграно',
                    'title' => 'Найбільше зіграні карти',
                ],
                'recent_plays' => [
                    'accuracy' => 'точність: :percentage',
                    'title' => 'Останні ігри (24г)',
                ],
                'replays_watched_counts' => [
                    'title' => 'Історія перегляду повторів',
                    'count_label' => 'Переглянуті повтори',
                ],
            ],
            'kudosu' => [
                'recent_entries' => 'Останні обміни',
                'title' => 'Кудосу!',
                'total' => 'Кудосу накопичено',

                'entry' => [
                    'amount' => ':amount кудосу',
                    'empty' => "Цей користувач не обмінювався Кудосу!",

                    'beatmap_discussion' => [
                        'allow_kudosu' => [
                            'give' => 'Отримано :amount за відповідь в :post',
                        ],

                        'deny_kudosu' => [
                            'reset' => 'Відібрано :amount за відповідь в :post',
                        ],

                        'delete' => [
                            'reset' => 'Втрачено :amount за видалення відповіді в :post',
                        ],

                        'restore' => [
                            'give' => 'Отримано :amount за відновлення відповіді в :post',
                        ],

                        'vote' => [
                            'give' => 'Отримано :amount за отримання голосів в :post',
                            'reset' => 'Втрачено :amount за втрату голосів у :post',
                        ],

                        'recalculate' => [
                            'give' => 'Отримано :amount за перерахунок голосів в :post',
                            'reset' => 'Втрачено :amount за перерахунок голосів в :post',
                        ],
                    ],

                    'forum_post' => [
                        'give' => ':giver дав :amount за відповідь в :post',
                        'reset' => ':giver забрав кудосу за відповідь в :post',
                        'revoke' => ':giver забрав кудосу за відповідь в :post',
                    ],
                ],

                'total_info' => [
                    '_' => 'Залежить від того, скільки вкладу користувач вніс у модерацію карт. Відвідайте :link для додаткової інформації.',
                    'link' => 'цієї сторінки',
                ],
            ],
            'me' => [
                'title' => 'про мене!',
            ],
            'medals' => [
                'empty' => "Цей користувач поки що нічого не отримав. ; _;",
                'recent' => 'Останні досягнення',
                'title' => 'Досягнення',
            ],
            'posts' => [
                'title' => 'Пости',
                'title_longer' => 'Недавні пости',
                'show_more' => 'бачити більше постiв',
            ],
            'recent_activity' => [
                'title' => 'Недавня активність',
            ],
            'top_ranks' => [
                'download_replay' => 'Завантажити повтор',
                'not_ranked' => 'Очки продуктивності видаються тільки за рейтингові або одобрені карти.',
                'pp_weight' => 'зважено: :percentage',
                'view_details' => 'Придивитися до деталей',
                'title' => 'Рейтинги',

                'best' => [
                    'title' => 'Кращі результати',
                ],
                'first' => [
                    'title' => 'Рекорди',
                ],
            ],
            'votes' => [
                'given' => 'Голосів дано (за 3 місяці)',
                'received' => 'Голосів отримано (за 3 місяці)',
                'title' => 'Голосів',
                'title_longer' => 'Недавні голосу',
                'vote_count' => ':count_delimited голос|:count_delimited голосів',
            ],
            'account_standing' => [
                'title' => 'Статус аккаунту',
                'bad_standing' => "аккаунт <strong>:username </strong> не в хорошому стані :(",
                'remaining_silence' => 'користувачу <strong>:username </strong> можна буде говорити через :duration.',

                'recent_infringements' => [
                    'title' => 'Недавні порушення',
                    'date' => 'дата',
                    'action' => 'покарання',
                    'length' => 'тривалість',
                    'length_permanent' => 'Назавжди',
                    'description' => 'опис',
                    'actor' => 'від :username',

                    'actions' => [
                        'restriction' => 'Заблокувати',
                        'silence' => 'Заглушений',
                        'note' => 'Замітка',
                    ],
                ],
            ],
        ],

        'info' => [
            'discord' => '',
            'interests' => 'Вподобання',
            'location' => 'Поточне місцезнаходження',
            'occupation' => 'Рід занять',
            'twitter' => '',
            'website' => 'Сайт',
        ],
        'not_found' => [
            'reason_1' => 'Вони могли змінити свої псевдоніми.',
            'reason_2' => 'Обліковий запис може бути тимчасово недоступним через скарги або проблеми з безпекою.',
            'reason_3' => 'Можливо, ви зробили помилку!',
            'reason_header' => 'Є кілька можливих причин:',
            'title' => 'Користувач не знайдений або не існує ;_;',
        ],
        'page' => [
            'button' => 'Редагувати профіль',
            'description' => '<strong>про мене!</strong> є настроюваною областю профілю.',
            'edit_big' => 'Редагуйте мене!',
            'placeholder' => 'Введіть вміст сторінки',

            'restriction_info' => [
                '_' => 'Для використання цієї функції потрібен :link.',
                'link' => 'тег osu!supporter',
            ],
        ],
        'post_count' => [
            '_' => 'Написав :link',
            'count' => ':count пост|:count пости|:count постів',
        ],
        'rank' => [
            'country' => 'Рейтинг країни для :mode',
            'country_simple' => 'Рейтинг країни',
            'global' => 'Глобальний рейтинг для :mode',
            'global_simple' => 'Рейтинг в світі',
        ],
        'stats' => [
            'hit_accuracy' => 'Точність попадань',
            'level' => 'Рівень :level',
            'level_progress' => 'Прогрес до наступного рівня',
            'maximum_combo' => 'Максимальне комбо',
            'medals' => 'Досягнення',
            'play_count' => 'Кількість ігор',
            'play_time' => 'Загальний час у грі',
            'ranked_score' => 'Рейтингові очки',
            'replays_watched_by_others' => 'Повтори переглянуті іншими',
            'score_ranks' => 'Рейтинг по очках',
            'total_hits' => 'Всього попадань',
            'total_score' => 'Всього очків',
            // modding stats
            'graveyard_beatmapset_count' => 'Закинуті карти',
            'loved_beatmapset_count' => 'Улюблені карти',
            'pending_beatmapset_count' => 'Карти на розгляді',
            'ranked_beatmapset_count' => 'Рейтингові і схвалені карти',
        ],
    ],

    'silenced_banner' => [
        'title' => 'Наразі ви заглушені. ',
        'message' => 'Деякі дії можуть бути недоступними.',
    ],

    'status' => [
        'all' => 'Всі',
        'online' => 'В мережі',
        'offline' => 'Не в мережі',
    ],
    'store' => [
        'saved' => 'Користувач створений',
    ],
    'verify' => [
        'title' => 'Підтвердження аккаунта',
    ],

    'view_mode' => [
        'brick' => 'Показувати цеглою',
        'card' => 'Показувати картками',
        'list' => 'Показувати списком',
    ],
];
