<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'create' => [
        'finish' => 'Готово',
        'key' => 'Скануй QR-код додатком для автентифікації і введіть ключ верифікації',
        'key_copy' => 'Або клацніть на це посилання щоб скопіювати ключ для автентифікатора',
        'key_link' => 'Використовуйте це посилання якщо ви використовуєте мобільний телефон',
        'password' => 'Щоб налаштувати додаток автентифікації, будь ласка, введіть ваш поточний пароль',
        'start' => 'Продовжити',
    ],

    'destroy' => [
        'missing' => 'Ви не маєте налаштований додаток аутентифікації.',
        'ok' => 'Додаток для аутентифікації видалено.',
    ],

    'edit' => [
        'password' => 'Будь ласка, введіть ваш поточний пароль щоб вилучити перевірку додатком аутентифікації.',
        'start' => 'Видалити',
    ],

    'store' => [
        'existing' => 'Ви вже маєте налаштований додаток для аутентифікації.',
        'ok' => 'Додаток для аутентифікації було налаштовано. ',
        'restart' => 'Сталась помилка. Будь ласка, спробуйте ще раз.',
    ],
];
