<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'show' => [
        'fallback_translation' => 'Дана сторінка ще не перекладена на обрану мову (:language). Буде показано англійську версію сторінки.',
        'incomplete_or_outdated' => 'Вміст цієї сторінки є неповним або застарілим. Якщо ви бажаєте допомогти, будь ласка, допоможіть нам доповнити її!',
        'missing' => 'Запитувана сторінка ":keyword" не знайдена.',
        'missing_title' => 'Не знайдено',
        'missing_translation' => 'Для цієї мови, запитувана сторінка не знайдена.',
        'needs_cleanup_or_rewrite' => 'Ця стаття не відповідає стандартам osu! wiki потребує чистки або перезапису. Якщо ви можете допомогти, будь ласка, розгляньте можливість оновити статтю!',
        'search' => 'Пошук наявних сторінок для :link.',
        'stub' => 'Ця стаття неповна і в очікуванні на когось хто її розширить.',
        'toc' => 'Вміст',

        'edit' => [
            'link' => 'Переглянути на GitHub',
            'refresh' => 'Оновити',
        ],

        'translation' => [
            'legal' => 'Цей переклад наданий лише для зручності. Оригінал :default повинен бути юридично обов\'язковою версією цього тексту.',
            'outdated' => 'Ця сторінка містить застарілий переклад. Відкрийте версію :default для отримання свіжої інформації (і, якщо можете, допоможіть нам з перекладом цієї сторінки)!',

            'default' => 'Англійська версія',
        ],
    ],
];
