<?php

// Copyright (c) ppy Pty Ltd <contact@ppy.sh>. Licensed under the GNU Affero General Public License v3.0.
// See the LICENCE file in the repository root for full licence text.

return [
    'show' => [
        'fallback_translation' => 'Дана сторінка ще не перекладена на обрану мову (:language). Буде відображено англійську версію сторінки.',
        'incomplete_or_outdated' => 'Вміст цієї сторінки є неповним або застарілим, але ви завжди зможете допомогти нам доповнити його!',
        'missing' => 'Дана сторінка ":keyword" не знайдена.',
        'missing_title' => 'Не знайдено',
        'missing_translation' => 'Запитувана сторінка не знайдена для цієї мови.',
        'needs_cleanup_or_rewrite' => 'Ця стаття не відповідає стандартам osu! wiki і потребує чищення або переписуванні. Якщо Ви можете допомогти, будь ласка, розгляньте можливість оновити статтю!',
        'search' => 'Пошук наявних сторінок для :link.',
        'stub' => '',
        'toc' => 'Вміст',

        'edit' => [
            'link' => 'Переглянути на GitHub',
            'refresh' => 'Оновити',
        ],

        'translation' => [
            'legal' => 'Цей переклад надається тільки для зручності. Оригінальна версія :default є єдиною юридично обов\'язковою версією цього тексту.',
            'outdated' => 'Ця сторінка містить застарілий переклад. Відкрийте версію :default для отримання свіжої інформації (і, якщо можете, допоможіть нам з перекладом цієї сторінки)!',

            'default' => 'Англійська версія',
        ],
    ],
];
